{
 "transformers_version": "5.11.0",
 "architectures": null,
 "output_hidden_states": false,
 "return_dict": true,
 "dtype": null,
 "chunk_size_feed_forward": 0,
 "is_encoder_decoder": false,
 "id2label": {
  "0": "LABEL_0",
  "1": "LABEL_1"
 },
 "label2id": {
  "LABEL_0": 0,
  "LABEL_1": 1
 },
 "problem_type": null,
 "vision_config": {
  "architectures": null,
  "output_hidden_states": false,
  "return_dict": true,
  "dtype": null,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "id2label": {
   "0": "LABEL_0",
   "1": "LABEL_1"
  },
  "label2id": {
   "LABEL_0": 0,
   "LABEL_1": 1
  },
  "problem_type": null,
  "hidden_size": 24,
  "output_channels": 16,
  "num_hidden_layers": 4,
  "num_attention_heads": 3,
  "num_channels": 3,
  "image_size": 32,
  "patch_size": 8,
  "hidden_act": "gelu",
  "layer_norm_eps": 1e-06,
  "attention_dropout": 0.0,
  "initializer_range": 1e-10,
  "qkv_bias": true,
  "mlp_ratio": 4.0,
  "use_abs_pos": true,
  "use_rel_pos": true,
  "window_size": 2,
  "global_attn_indexes": [
   2
  ],
  "num_pos_feats": 128,
  "mlp_dim": 48,
  "scale": 12,
  "_name_or_path": "",
  "model_type": "sam_vision_model",
  "output_attentions": false
 },
 "prompt_encoder_config": {
  "architectures": null,
  "output_hidden_states": false,
  "return_dict": true,
  "dtype": null,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "id2label": {
   "0": "LABEL_0",
   "1": "LABEL_1"
  },
  "label2id": {
   "LABEL_0": 0,
   "LABEL_1": 1
  },
  "problem_type": null,
  "hidden_size": 256,
  "image_size": 1024,
  "patch_size": 16,
  "mask_input_channels": 16,
  "num_point_embeddings": 4,
  "hidden_act": "gelu",
  "layer_norm_eps": 1e-06,
  "image_embedding_size": 64,
  "_name_or_path": "",
  "model_type": "",
  "output_attentions": false
 },
 "mask_decoder_config": {
  "architectures": null,
  "output_hidden_states": false,
  "return_dict": true,
  "dtype": null,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "id2label": {
   "0": "LABEL_0",
   "1": "LABEL_1"
  },
  "label2id": {
   "LABEL_0": 0,
   "LABEL_1": 1
  },
  "problem_type": null,
  "hidden_size": 256,
  "hidden_act": "relu",
  "mlp_dim": 2048,
  "num_hidden_layers": 2,
  "num_attention_heads": 8,
  "attention_downsample_rate": 2,
  "num_multimask_outputs": 3,
  "iou_head_depth": 3,
  "iou_head_hidden_dim": 256,
  "layer_norm_eps": 1e-06,
  "_name_or_path": "",
  "model_type": "",
  "output_attentions": false
 },
 "initializer_range": 0.02,
 "tie_word_embeddings": true,
 "_name_or_path": "",
 "model_type": "sam",
 "output_attentions": false
}