{
 "architectures": [
  "JambaForCausalLM"
 ],
 "model_type": "jamba",
 "vocab_size": 17,
 "hidden_size": 8,
 "intermediate_size": 12,
 "num_hidden_layers": 6,
 "num_attention_heads": 4,
 "num_key_value_heads": 2,
 "hidden_act": "silu",
 "rms_norm_eps": 1e-06,
 "tie_word_embeddings": false,
 "num_experts": 2,
 "num_experts_per_tok": 1,
 "expert_layer_period": 3,
 "expert_layer_offset": 1,
 "attn_layer_period": 2,
 "attn_layer_offset": 1,
 "mamba_d_state": 4,
 "mamba_d_conv": 4,
 "mamba_expand": 2,
 "mamba_dt_rank": 3,
 "mamba_conv_bias": true,
 "mamba_proj_bias": false,
 "use_mamba_kernels": false
}