{
 "hidden_size": 8,
 "intermediate_size": 5,
 "intermediate_size_mlp": 12,
 "num_hidden_layers": 4,
 "num_attention_heads": 2,
 "num_key_value_heads": 1,
 "head_dim": 6,
 "vocab_size": 13,
 "max_position_embeddings": 64,
 "rms_norm_eps": 1e-05,
 "rope_theta": 10000.0,
 "num_local_experts": 4,
 "num_experts_per_tok": 2,
 "interleave_moe_layer_step": 2,
 "no_rope_layer_interval": 2,
 "use_qk_norm": true,
 "attn_temperature_tuning": true,
 "attention_chunk_size": 8192,
 "floor_scale": 4,
 "attn_scale": 0.7,
 "attention_bias": false,
 "tie_word_embeddings": false,
 "hidden_act": "silu",
 "architectures": [
  "Llama4ForCausalLM"
 ],
 "model_type": "llama4_text"
}