{
 "model_type": "granitemoe",
 "hidden_size": 8,
 "intermediate_size": 12,
 "num_hidden_layers": 2,
 "num_attention_heads": 2,
 "num_key_value_heads": 1,
 "vocab_size": 13,
 "max_position_embeddings": 16,
 "rms_norm_eps": 1e-05,
 "rope_theta": 10000.0,
 "attention_bias": false,
 "tie_word_embeddings": true,
 "hidden_act": "silu",
 "embedding_multiplier": 1.7,
 "residual_multiplier": 0.6,
 "attention_multiplier": 2.0,
 "logits_scaling": 2.5,
 "architectures": [
  "GraniteMoeSharedForCausalLM"
 ],
 "num_local_experts": 3,
 "num_experts_per_tok": 2,
 "shared_intermediate_size": 10
}