{"version": "1.0", "truncation": null, "padding": null, "added_tokens": [{"id": 0, "content": "<|endoftext|>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true}], "normalizer": null, "pre_tokenizer": {"type": "Sequence", "pretokenizers": [{"type": "Punctuation", "behavior": "Contiguous"}, {"type": "ByteLevel", "add_prefix_space": false, "trim_offsets": true, "use_regex": true}, {"type": "Digits", "individual_digits": false}, {"type": "Split", "pattern": {"Regex": "[0-9][0-9][0-9]"}, "behavior": "Isolated", "invert": false}]}, "post_processor": null, "decoder": {"type": "ByteLevel", "add_prefix_space": true, "trim_offsets": true, "use_regex": true}, "model": {"type": "BPE", "dropout": null, "unk_token": null, "continuing_subword_prefix": null, "end_of_word_suffix": null, "fuse_unk": false, "byte_fallback": false, "ignore_merges": false, "vocab": {"<|endoftext|>": 0, "!": 1, "\"": 2, "#": 3, "$": 4, "%": 5, "&": 6, "'": 7, "(": 8, ")": 9, "*": 10, "+": 11, ",": 12, "-": 13, ".": 14, "/": 15, "0": 16, "1": 17, "2": 18, "3": 19, "4": 20, "5": 21, "6": 22, "7": 23, "8": 24, "9": 25, ":": 26, ";": 27, "<": 28, "=": 29, ">": 30, "?": 31, "@": 32, "A": 33, "B": 34, "C": 35, "D": 36, "E": 37, "F": 38, "G": 39, "H": 40, "I": 41, "J": 42, "K": 43, "L": 44, "M": 45, "N": 46, "O": 47, "P": 48, "Q": 49, "R": 50, "S": 51, "T": 52, "U": 53, "V": 54, "W": 55, "X": 56, "Y": 57, "Z": 58, "[": 59, "\\": 60, "]": 61, "^": 62, "_": 63, "`": 64, "a": 65, "b": 66, "c": 67, "d": 68, "e": 69, "f": 70, "g": 71, "h": 72, "i": 73, "j": 74, "k": 75, "l": 76, "m": 77, "n": 78, "o": 79, "p": 80, "q": 81, "r": 82, "s": 83, "t": 84, "u": 85, "v": 86, "w": 87, "x": 88, "y": 89, "z": 90, "{": 91, "|": 92, "}": 93, "~": 94, "¡": 95, "¢": 96, "£": 97, "¤": 98, "¥": 99, "¦": 100, "§": 101, "¨": 102, "©": 103, "ª": 104, "«": 105, "¬": 106, "®": 107, "¯": 108, "°": 109, "±": 110, "²": 111, "³": 112, "´": 113, "µ": 114, "¶": 115, "·": 116, "¸": 117, "¹": 118, "º": 119, "»": 120, "¼": 121, "½": 122, "¾": 123, "¿": 124, "À": 125, "Á": 126, "Â": 127, "Ã": 128, "Ä": 129, "Å": 130, "Æ": 131, "Ç": 132, "È": 133, "É": 134, "Ê": 135, "Ë": 136, "Ì": 137, "Í": 138, "Î": 139, "Ï": 140, "Ð": 141, "Ñ": 142, "Ò": 143, "Ó": 144, "Ô": 145, "Õ": 146, "Ö": 147, "×": 148, "Ø": 149, "Ù": 150, "Ú": 151, "Û": 152, "Ü": 153, "Ý": 154, "Þ": 155, "ß": 156, "à": 157, "á": 158, "â": 159, "ã": 160, "ä": 161, "å": 162, "æ": 163, "ç": 164, "è": 165, "é": 166, "ê": 167, "ë": 168, "ì": 169, "í": 170, "î": 171, "ï": 172, "ð": 173, "ñ": 174, "ò": 175, "ó": 176, "ô": 177, "õ": 178, "ö": 179, "÷": 180, "ø": 181, "ù": 182, "ú": 183, "û": 184, "ü": 185, "ý": 186, "þ": 187, "ÿ": 188, "Ā": 189, "ā": 190, "Ă": 191, "ă": 192, "Ą": 193, "ą": 194, "Ć": 195, "ć": 196, "Ĉ": 197, "ĉ": 198, "Ċ": 199, "ċ": 200, "Č": 201, "č": 202, "Ď": 203, "ď": 204, "Đ": 205, "đ": 206, "Ē": 207, "ē": 208, "Ĕ": 209, "ĕ": 210, "Ė": 211, "ė": 212, "Ę": 213, "ę": 214, "Ě": 215, "ě": 216, "Ĝ": 217, "ĝ": 218, "Ğ": 219, "ğ": 220, "Ġ": 221, "ġ": 222, "Ģ": 223, "ģ": 224, "Ĥ": 225, "ĥ": 226, "Ħ": 227, "ħ": 228, "Ĩ": 229, "ĩ": 230, "Ī": 231, "ī": 232, "Ĭ": 233, "ĭ": 234, "Į": 235, "į": 236, "İ": 237, "ı": 238, "Ĳ": 239, "ĳ": 240, "Ĵ": 241, "ĵ": 242, "Ķ": 243, "ķ": 244, "ĸ": 245, "Ĺ": 246, "ĺ": 247, "Ļ": 248, "ļ": 249, "Ľ": 250, "ľ": 251, "Ŀ": 252, "ŀ": 253, "Ł": 254, "ł": 255, "Ń": 256, "eĠ": 257, "th": 258, "sĠ": 259, "tĠ": 260, "Ġth": 261, "er": 262, "el": 263, "on": 264, "ĠtheĠ": 265, "or": 266, "sh": 267, "yĠ": 268, "Ġa": 269, "ell": 270, "atĠ": 271, "ck": 272, "ea": 273, "nd": 274, "qu": 275, "ellsĠ": 276, ",Ġ": 277, "44": 278, "at": 279, "do": 280, "e.": 281, "ick": 282, "ju": 283, "nĠ": 284, "ou": 285, "sea": 286, "Ġb": 287, "Ġw": 288, "eĠs": 289, "seash": 290, "33": 291, "af": 292, "and": 293, "ch": 294, "e,": 295, "g.": 296, "iv": 297, "li": 298, "mp": 299, "ow": 300, "ox": 301, "oĠb": 302, "rĠ": 303, "s.": 304, "satĠ": 305, "toĠb": 306, "ver": 307, "ze": 308, "Ġd": 309, "Ġm": 310, "Ġn": 311, "Ġju": 312, "eĠc": 313, "eĠqu": 314, "ereĠ": 315, "onĠtheĠ": 316, "ĠaĠ": 317, "Ġand": 318, "Ġwi": 319, "eĠsellsĠ": 320, "satĠonĠtheĠ": 321, "'sĠ": 322, "'tĠ": 323, ".ĠtheĠ": 324, "02": 325, "12": 326, "1,Ġ": 327, "22": 328, "2Ġw": 329, "202": 330, "36": 331, "3Ġand": 332, "5Ġd": 333, "52Ġw": 334, "6Ġth": 335, ";Ġ": 336, "AĠn": 337, "Don": 338, "How": 339, "InĠ": 340, "Pa": 341, "Sh": 342, "Th": 343, "ar": 344, "ay": 345, "az": 346, "asĠ": 347, "aiv": 348, "be": 349, "br": 350, "by": 351, "ber": 352, "box": 353, "cr": 354, "cou": 355, "der": 356, "dĠaĠ": 357, "ee": 358, "en": 359, "ep": 360, "es": 361, "ex": 362, "eyĠ": 363, "ever": 364, "edĠaĠ": 365, "ff": 366, "for": 367, "fiv": 368, "fox": 369, "gl": 370, "gs": 371, "gĠ": 372, "her": 373, "hat": 374, "in": 375, "it": 376, "isĠ": 377, "ion": 378, "keĠ": 379, "ks.": 380, "lo": 381, "leĠ": 382, "laz": 383, "mat": 384, "mber": 385, "nu": 386, "ntĠ": 387, "never": 388, "otĠ": 389, "over": 390, "pp": 391, "pat": 392, "rel": 393, "ron": 394, "row": 395, "s,Ġ": 396, "se.": 397, "sou": 398, "tion": 399}, "merges": [["e", "Ġ"], ["t", "h"], ["s", "Ġ"], ["t", "Ġ"], ["Ġ", "th"], ["e", "r"], ["e", "l"], ["o", "n"], ["Ġth", "eĠ"], ["o", "r"], ["s", "h"], ["y", "Ġ"], ["Ġ", "a"], ["el", "l"], ["a", "tĠ"], ["c", "k"], ["e", "a"], ["n", "d"], ["q", "u"], ["ell", "sĠ"], [",", "Ġ"], ["4", "4"], ["a", "t"], ["d", "o"], ["e", "."], ["i", "ck"], ["j", "u"], ["n", "Ġ"], ["o", "u"], ["s", "ea"], ["Ġ", "b"], ["Ġ", "w"], ["eĠ", "s"], ["sea", "sh"], ["3", "3"], ["a", "f"], ["a", "nd"], ["c", "h"], ["e", ","], ["g", "."], ["i", "v"], ["l", "i"], ["m", "p"], ["o", "w"], ["o", "x"], ["o", "Ġb"], ["r", "Ġ"], ["s", "."], ["s", "atĠ"], ["t", "oĠb"], ["v", "er"], ["z", "e"], ["Ġ", "d"], ["Ġ", "m"], ["Ġ", "n"], ["Ġ", "ju"], ["eĠ", "c"], ["eĠ", "qu"], ["er", "eĠ"], ["on", "ĠtheĠ"], ["Ġa", "Ġ"], ["Ġa", "nd"], ["Ġw", "i"], ["eĠs", "ellsĠ"], ["satĠ", "onĠtheĠ"], ["'", "sĠ"], ["'", "tĠ"], [".", "ĠtheĠ"], ["0", "2"], ["1", "2"], ["1", ",Ġ"], ["2", "2"], ["2", "Ġw"], ["2", "02"], ["3", "6"], ["3", "Ġand"], ["5", "Ġd"], ["5", "2Ġw"], ["6", "Ġth"], [";", "Ġ"], ["A", "Ġn"], ["D", "on"], ["H", "ow"], ["I", "nĠ"], ["P", "a"], ["S", "h"], ["T", "h"], ["a", "r"], ["a", "y"], ["a", "z"], ["a", "sĠ"], ["a", "iv"], ["b", "e"], ["b", "r"], ["b", "y"], ["b", "er"], ["b", "ox"], ["c", "r"], ["c", "ou"], ["d", "er"], ["d", "ĠaĠ"], ["e", "e"], ["e", "n"], ["e", "p"], ["e", "s"], ["e", "x"], ["e", "yĠ"], ["e", "ver"], ["e", "dĠaĠ"], ["f", "f"], ["f", "or"], ["f", "iv"], ["f", "ox"], ["g", "l"], ["g", "s"], ["g", "Ġ"], ["h", "er"], ["h", "at"], ["i", "n"], ["i", "t"], ["i", "sĠ"], ["i", "on"], ["k", "eĠ"], ["k", "s."], ["l", "o"], ["l", "eĠ"], ["l", "az"], ["m", "at"], ["m", "ber"], ["n", "u"], ["n", "tĠ"], ["n", "ever"], ["o", "tĠ"], ["o", "ver"], ["p", "p"], ["p", "at"], ["r", "el"], ["r", "on"], ["r", "ow"], ["s", ",Ġ"], ["s", "e."], ["s", "ou"], ["t", "ion"]]}}