{
 "architectures": [
  "MixtralForCausalLM"
 ],
 "model_type": "mixtral",
 "hidden_size": 8,
 "intermediate_size": 12,
 "num_hidden_layers": 2,
 "num_attention_heads": 2,
 "num_key_value_heads": 1,
 "vocab_size": 13,
 "max_position_embeddings": 16,
 "rms_norm_eps": 1e-05,
 "rope_theta": 10000.0,
 "tie_word_embeddings": false,
 "hidden_act": "silu",
 "num_local_experts": 4,
 "num_experts_per_tok": 2,
 "sliding_window": null,
 "output_router_logits": false
}