{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|im_end|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "Regex": "[^\\r\\n\\p{L}\\p{N}]?[\\p{Lu}\\p{Lt}\\p{Lm}\\p{Lo}\\p{M}]*[\\p{Ll}\\p{Lm}\\p{Lo}\\p{M}]+(?i:'s|'t|'re|'ve|'m|'ll|'d)?|[^\\r\\n\\p{L}\\p{N}]?[\\p{Lu}\\p{Lt}\\p{Lm}\\p{Lo}\\p{M}]+[\\p{Ll}\\p{Lm}\\p{Lo}\\p{M}]*(?i:'s|'t|'re|'ve|'m|'ll|'d)?|\\p{N}{1,3}| ?[^\\s\\p{L}\\p{N}]+[\\r\\n/]*|\\s*[\\r\\n]+|\\s+(?!\\S)|\\s+"
        },
        "behavior": "Isolated",
        "invert": false
      },
      {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": false
      }
    ]
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "<|im_end|>": 1,
      "!": 2,
      "\"": 3,
      "#": 4,
      "$": 5,
      "%": 6,
      "&": 7,
      "'": 8,
      "(": 9,
      ")": 10,
      "*": 11,
      "+": 12,
      ",": 13,
      "-": 14,
      ".": 15,
      "/": 16,
      "0": 17,
      "1": 18,
      "2": 19,
      "3": 20,
      "4": 21,
      "5": 22,
      "6": 23,
      "7": 24,
      "8": 25,
      "9": 26,
      ":": 27,
      ";": 28,
      "<": 29,
      "=": 30,
      ">": 31,
      "?": 32,
      "@": 33,
      "A": 34,
      "B": 35,
      "C": 36,
      "D": 37,
      "E": 38,
      "F": 39,
      "G": 40,
      "H": 41,
      "I": 42,
      "J": 43,
      "K": 44,
      "L": 45,
      "M": 46,
      "N": 47,
      "O": 48,
      "P": 49,
      "Q": 50,
      "R": 51,
      "S": 52,
      "T": 53,
      "U": 54,
      "V": 55,
      "W": 56,
      "X": 57,
      "Y": 58,
      "Z": 59,
      "[": 60,
      "\\": 61,
      "]": 62,
      "^": 63,
      "_": 64,
      "`": 65,
      "a": 66,
      "b": 67,
      "c": 68,
      "d": 69,
      "e": 70,
      "f": 71,
      "g": 72,
      "h": 73,
      "i": 74,
      "j": 75,
      "k": 76,
      "l": 77,
      "m": 78,
      "n": 79,
      "o": 80,
      "p": 81,
      "q": 82,
      "r": 83,
      "s": 84,
      "t": 85,
      "u": 86,
      "v": 87,
      "w": 88,
      "x": 89,
      "y": 90,
      "z": 91,
      "{": 92,
      "|": 93,
      "}": 94,
      "~": 95,
      "¡": 96,
      "¢": 97,
      "£": 98,
      "¤": 99,
      "¥": 100,
      "¦": 101,
      "§": 102,
      "¨": 103,
      "©": 104,
      "ª": 105,
      "«": 106,
      "¬": 107,
      "®": 108,
      "¯": 109,
      "°": 110,
      "±": 111,
      "²": 112,
      "³": 113,
      "´": 114,
      "µ": 115,
      "¶": 116,
      "·": 117,
      "¸": 118,
      "¹": 119,
      "º": 120,
      "»": 121,
      "¼": 122,
      "½": 123,
      "¾": 124,
      "¿": 125,
      "À": 126,
      "Á": 127,
      "Â": 128,
      "Ã": 129,
      "Ä": 130,
      "Å": 131,
      "Æ": 132,
      "Ç": 133,
      "È": 134,
      "É": 135,
      "Ê": 136,
      "Ë": 137,
      "Ì": 138,
      "Í": 139,
      "Î": 140,
      "Ï": 141,
      "Ð": 142,
      "Ñ": 143,
      "Ò": 144,
      "Ó": 145,
      "Ô": 146,
      "Õ": 147,
      "Ö": 148,
      "×": 149,
      "Ø": 150,
      "Ù": 151,
      "Ú": 152,
      "Û": 153,
      "Ü": 154,
      "Ý": 155,
      "Þ": 156,
      "ß": 157,
      "à": 158,
      "á": 159,
      "â": 160,
      "ã": 161,
      "ä": 162,
      "å": 163,
      "æ": 164,
      "ç": 165,
      "è": 166,
      "é": 167,
      "ê": 168,
      "ë": 169,
      "ì": 170,
      "í": 171,
      "î": 172,
      "ï": 173,
      "ð": 174,
      "ñ": 175,
      "ò": 176,
      "ó": 177,
      "ô": 178,
      "õ": 179,
      "ö": 180,
      "÷": 181,
      "ø": 182,
      "ù": 183,
      "ú": 184,
      "û": 185,
      "ü": 186,
      "ý": 187,
      "þ": 188,
      "ÿ": 189,
      "Ā": 190,
      "ā": 191,
      "Ă": 192,
      "ă": 193,
      "Ą": 194,
      "ą": 195,
      "Ć": 196,
      "ć": 197,
      "Ĉ": 198,
      "ĉ": 199,
      "Ċ": 200,
      "ċ": 201,
      "Č": 202,
      "č": 203,
      "Ď": 204,
      "ď": 205,
      "Đ": 206,
      "đ": 207,
      "Ē": 208,
      "ē": 209,
      "Ĕ": 210,
      "ĕ": 211,
      "Ė": 212,
      "ė": 213,
      "Ę": 214,
      "ę": 215,
      "Ě": 216,
      "ě": 217,
      "Ĝ": 218,
      "ĝ": 219,
      "Ğ": 220,
      "ğ": 221,
      "Ġ": 222,
      "ġ": 223,
      "Ģ": 224,
      "ģ": 225,
      "Ĥ": 226,
      "ĥ": 227,
      "Ħ": 228,
      "ħ": 229,
      "Ĩ": 230,
      "ĩ": 231,
      "Ī": 232,
      "ī": 233,
      "Ĭ": 234,
      "ĭ": 235,
      "Į": 236,
      "į": 237,
      "İ": 238,
      "ı": 239,
      "Ĳ": 240,
      "ĳ": 241,
      "Ĵ": 242,
      "ĵ": 243,
      "Ķ": 244,
      "ķ": 245,
      "ĸ": 246,
      "Ĺ": 247,
      "ĺ": 248,
      "Ļ": 249,
      "ļ": 250,
      "Ľ": 251,
      "ľ": 252,
      "Ŀ": 253,
      "ŀ": 254,
      "Ł": 255,
      "ł": 256,
      "Ń": 257,
      "he": 258,
      "Ġs": 259,
      "Ġt": 260,
      "re": 261,
      "Ġthe": 262,
      "Ġa": 263,
      "at": 264,
      "on": 265,
      "Ġb": 266,
      "ll": 267,
      "ve": 268,
      "Ġc": 269,
      "Ġd": 270,
      "Ġse": 271,
      "lls": 272,
      "as": 273,
      "ck": 274,
      "nd": 275,
      "qu": 276,
      "Ġl": 277,
      "Ġw": 278,
      "Ġand": 279,
      "ick": 280,
      "ju": 281,
      "og": 282,
      "or": 283,
      "ou": 284,
      "Ġm": 285,
      "Ġn": 286,
      "Ġqu": 287,
      "Ġju": 288,
      "hells": 289,
      "Ġbe": 290,
      "Ġseas": 291,
      "33": 292,
      "44": 293,
      "af": 294,
      "en": 295,
      "ere": 296,
      "fo": 297,
      "hat": 298,
      "is": 299,
      "it": 300,
      "ive": 301,
      "ly": 302,
      "mp": 303,
      "ow": 304,
      "pe": 305,
      "ä¸": 306,
      "Ġon": 307,
      "Ġor": 308,
      "Ġsat": 309,
      "ver": 310,
      "Ġdog": 311,
      "Ġsells": 312,
      "Ġli": 313,
      "Ġquick": 314,
      "Ġjump": 315,
      "Ġseashells": 316,
      "'s": 317,
      "'t": 318,
      "02": 319,
      "12": 320,
      "22": 321,
      "202": 322,
      "36": 323,
      "52": 324,
      "Don": 325,
      "How": 326,
      "In": 327,
      "Pa": 328,
      "She": 329,
      "The": 330,
      "ar": 331,
      "ay": 332,
      "az": 333,
      "aive": 334,
      "be": 335,
      "br": 336,
      "ch": 337,
      "dere": 338,
      "ee": 339,
      "es": 340,
      "ever": 341,
      "ebr": 342,
      "ff": 343,
      "five": 344,
      "gs": 345,
      "gly": 346,
      "ho": 347,
      "hs": 348,
      "hick": 349,
      "in": 350,
      "ion": 351,
      "ke": 352,
      "ks": 353,
      "le": 354,
      "mbe": 355,
      "nt": 356,
      "nu": 357,
      "ot": 358,
      "ox": 359,
      "oz": 360,
      "over": 361,
      "pat": 362,
      "ppe": 363,
      "rs": 364,
      "ron": 365,
      "row": 366,
      "to": 367,
      "the": 368,
      "ths": 369,
      "tion": 370,
      "ure": 371,
      "xin": 372,
      "you": 373,
      "zebr": 374,
      "¥½": 375,
      "¯ķ": 376,
      "µĭ": 377,
      "½ł": 378,
      "ä½ł": 379,
      "å¥½": 380,
      "æĸ": 381,
      "æµĭ": 382,
      "çķ": 383,
      "è¯ķ": 384,
      "Ġhe": 385,
      "Ġve": 386,
      "Ġfo": 387,
      "Ġhat": 388,
      "Ġis": 389,
      "Ġit": 390,
      "Ġfive": 391,
      "Ġover": 392,
      "Ġpat": 393,
      "Ġyou": 394,
      "Ġzebr": 395,
      "ĩæµĭ": 396,
      "ĸçķ": 397,
      "Ńæĸ": 398,
      "Ġshe": 399
    },
    "merges": [
      [
        "h",
        "e"
      ],
      [
        "Ġ",
        "s"
      ],
      [
        "Ġ",
        "t"
      ],
      [
        "r",
        "e"
      ],
      [
        "Ġt",
        "he"
      ],
      [
        "Ġ",
        "a"
      ],
      [
        "a",
        "t"
      ],
      [
        "o",
        "n"
      ],
      [
        "Ġ",
        "b"
      ],
      [
        "l",
        "l"
      ],
      [
        "v",
        "e"
      ],
      [
        "Ġ",
        "c"
      ],
      [
        "Ġ",
        "d"
      ],
      [
        "Ġs",
        "e"
      ],
      [
        "ll",
        "s"
      ],
      [
        "a",
        "s"
      ],
      [
        "c",
        "k"
      ],
      [
        "n",
        "d"
      ],
      [
        "q",
        "u"
      ],
      [
        "Ġ",
        "l"
      ],
      [
        "Ġ",
        "w"
      ],
      [
        "Ġa",
        "nd"
      ],
      [
        "i",
        "ck"
      ],
      [
        "j",
        "u"
      ],
      [
        "o",
        "g"
      ],
      [
        "o",
        "r"
      ],
      [
        "o",
        "u"
      ],
      [
        "Ġ",
        "m"
      ],
      [
        "Ġ",
        "n"
      ],
      [
        "Ġ",
        "qu"
      ],
      [
        "Ġ",
        "ju"
      ],
      [
        "he",
        "lls"
      ],
      [
        "Ġb",
        "e"
      ],
      [
        "Ġse",
        "as"
      ],
      [
        "3",
        "3"
      ],
      [
        "4",
        "4"
      ],
      [
        "a",
        "f"
      ],
      [
        "e",
        "n"
      ],
      [
        "e",
        "re"
      ],
      [
        "f",
        "o"
      ],
      [
        "h",
        "at"
      ],
      [
        "i",
        "s"
      ],
      [
        "i",
        "t"
      ],
      [
        "i",
        "ve"
      ],
      [
        "l",
        "y"
      ],
      [
        "m",
        "p"
      ],
      [
        "o",
        "w"
      ],
      [
        "p",
        "e"
      ],
      [
        "ä",
        "¸"
      ],
      [
        "Ġ",
        "on"
      ],
      [
        "Ġ",
        "or"
      ],
      [
        "Ġs",
        "at"
      ],
      [
        "ve",
        "r"
      ],
      [
        "Ġd",
        "og"
      ],
      [
        "Ġse",
        "lls"
      ],
      [
        "Ġl",
        "i"
      ],
      [
        "Ġqu",
        "ick"
      ],
      [
        "Ġju",
        "mp"
      ],
      [
        "Ġseas",
        "hells"
      ],
      [
        "'",
        "s"
      ],
      [
        "'",
        "t"
      ],
      [
        "0",
        "2"
      ],
      [
        "1",
        "2"
      ],
      [
        "2",
        "2"
      ],
      [
        "2",
        "02"
      ],
      [
        "3",
        "6"
      ],
      [
        "5",
        "2"
      ],
      [
        "D",
        "on"
      ],
      [
        "H",
        "ow"
      ],
      [
        "I",
        "n"
      ],
      [
        "P",
        "a"
      ],
      [
        "S",
        "he"
      ],
      [
        "T",
        "he"
      ],
      [
        "a",
        "r"
      ],
      [
        "a",
        "y"
      ],
      [
        "a",
        "z"
      ],
      [
        "a",
        "ive"
      ],
      [
        "b",
        "e"
      ],
      [
        "b",
        "r"
      ],
      [
        "c",
        "h"
      ],
      [
        "d",
        "ere"
      ],
      [
        "e",
        "e"
      ],
      [
        "e",
        "s"
      ],
      [
        "e",
        "ver"
      ],
      [
        "e",
        "br"
      ],
      [
        "f",
        "f"
      ],
      [
        "f",
        "ive"
      ],
      [
        "g",
        "s"
      ],
      [
        "g",
        "ly"
      ],
      [
        "h",
        "o"
      ],
      [
        "h",
        "s"
      ],
      [
        "h",
        "ick"
      ],
      [
        "i",
        "n"
      ],
      [
        "i",
        "on"
      ],
      [
        "k",
        "e"
      ],
      [
        "k",
        "s"
      ],
      [
        "l",
        "e"
      ],
      [
        "m",
        "be"
      ],
      [
        "n",
        "t"
      ],
      [
        "n",
        "u"
      ],
      [
        "o",
        "t"
      ],
      [
        "o",
        "x"
      ],
      [
        "o",
        "z"
      ],
      [
        "o",
        "ver"
      ],
      [
        "p",
        "at"
      ],
      [
        "p",
        "pe"
      ],
      [
        "r",
        "s"
      ],
      [
        "r",
        "on"
      ],
      [
        "r",
        "ow"
      ],
      [
        "t",
        "o"
      ],
      [
        "t",
        "he"
      ],
      [
        "t",
        "hs"
      ],
      [
        "t",
        "ion"
      ],
      [
        "u",
        "re"
      ],
      [
        "x",
        "in"
      ],
      [
        "y",
        "ou"
      ],
      [
        "z",
        "ebr"
      ],
      [
        "¥",
        "½"
      ],
      [
        "¯",
        "ķ"
      ],
      [
        "µ",
        "ĭ"
      ],
      [
        "½",
        "ł"
      ],
      [
        "ä",
        "½ł"
      ],
      [
        "å",
        "¥½"
      ],
      [
        "æ",
        "ĸ"
      ],
      [
        "æ",
        "µĭ"
      ],
      [
        "ç",
        "ķ"
      ],
      [
        "è",
        "¯ķ"
      ],
      [
        "Ġ",
        "he"
      ],
      [
        "Ġ",
        "ve"
      ],
      [
        "Ġ",
        "fo"
      ],
      [
        "Ġ",
        "hat"
      ],
      [
        "Ġ",
        "is"
      ],
      [
        "Ġ",
        "it"
      ],
      [
        "Ġ",
        "five"
      ],
      [
        "Ġ",
        "over"
      ],
      [
        "Ġ",
        "pat"
      ],
      [
        "Ġ",
        "you"
      ],
      [
        "Ġ",
        "zebr"
      ],
      [
        "ĩ",
        "æµĭ"
      ],
      [
        "ĸ",
        "çķ"
      ],
      [
        "Ń",
        "æĸ"
      ],
      [
        "Ġs",
        "he"
      ]
    ]
  }
}