{
 "architectures": [
  "MiniCPMForCausalLM"
 ],
 "model_type": "minicpm",
 "hidden_size": 8,
 "intermediate_size": 12,
 "num_hidden_layers": 2,
 "num_attention_heads": 2,
 "num_key_value_heads": 1,
 "vocab_size": 13,
 "max_position_embeddings": 16,
 "rms_norm_eps": 1e-05,
 "rope_theta": 10000.0,
 "attention_bias": false,
 "tie_word_embeddings": true,
 "hidden_act": "silu",
 "scale_emb": 1.7,
 "scale_depth": 1.4,
 "dim_model_base": 5
}