{
 "architectures": [
  "Qwen3_5MoeForConditionalGeneration"
 ],
 "model_type": "qwen3_5_moe",
 "text_config": {
  "model_type": "qwen3_5_moe_text",
  "hidden_size": 8,
  "moe_intermediate_size": 5,
  "shared_expert_intermediate_size": 6,
  "num_experts": 4,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 4,
  "num_attention_heads": 2,
  "num_key_value_heads": 1,
  "head_dim": 8,
  "vocab_size": 13,
  "max_position_embeddings": 16,
  "rms_norm_eps": 1e-06,
  "attention_bias": false,
  "tie_word_embeddings": false,
  "hidden_act": "silu",
  "layer_types": [
   "linear_attention",
   "linear_attention",
   "linear_attention",
   "full_attention"
  ],
  "linear_num_key_heads": 2,
  "linear_num_value_heads": 4,
  "linear_key_head_dim": 4,
  "linear_value_head_dim": 4,
  "linear_conv_kernel_dim": 4,
  "rope_parameters": {
   "rope_type": "default",
   "rope_theta": 10000.0,
   "partial_rotary_factor": 0.25,
   "mrope_section": [
    1,
    0,
    0
   ],
   "mrope_interleaved": true
  }
 }
}