{
 "architectures": [
  "GptOssForCausalLM"
 ],
 "model_type": "gpt_oss",
 "hidden_size": 32,
 "intermediate_size": 32,
 "num_hidden_layers": 2,
 "num_attention_heads": 4,
 "num_key_value_heads": 1,
 "head_dim": 10,
 "vocab_size": 13,
 "max_position_embeddings": 16,
 "rms_norm_eps": 1e-05,
 "sliding_window": 4,
 "num_local_experts": 4,
 "num_experts_per_tok": 2,
 "tie_word_embeddings": false,
 "attention_bias": true,
 "layer_types": [
  "sliding_attention",
  "full_attention"
 ],
 "rope_parameters": {
  "rope_type": "yarn",
  "factor": 4.0,
  "beta_fast": 32.0,
  "beta_slow": 1.0,
  "truncate": false,
  "original_max_position_embeddings": 4,
  "rope_theta": 10000.0
 }
}