{
 "transformers_version": "5.11.0",
 "architectures": null,
 "output_hidden_states": false,
 "return_dict": true,
 "dtype": null,
 "chunk_size_feed_forward": 0,
 "is_encoder_decoder": false,
 "id2label": {
  "0": "LABEL_0",
  "1": "LABEL_1"
 },
 "label2id": {
  "LABEL_0": 0,
  "LABEL_1": 1
 },
 "problem_type": null,
 "hidden_size": 16,
 "num_hidden_layers": 2,
 "num_attention_heads": 4,
 "mlp_ratio": 4,
 "hidden_act": "gelu",
 "hidden_dropout_prob": 0.0,
 "attention_probs_dropout_prob": 0.0,
 "initializer_range": 0.02,
 "layer_norm_eps": 1e-06,
 "image_size": 12,
 "patch_size": 4,
 "num_channels": 3,
 "qkv_bias": true,
 "layerscale_value": 1.0,
 "drop_path_rate": 0.0,
 "use_swiglu_ffn": false,
 "apply_layernorm": true,
 "reshape_hidden_states": true,
 "use_mask_token": true,
 "stage_names": [
  "stem",
  "stage1",
  "stage2"
 ],
 "_name_or_path": "",
 "model_type": "dinov2",
 "output_attentions": false,
 "out_features": [
  "stage2"
 ],
 "out_indices": [
  2
 ]
}