{
 "model_type": "resnet",
 "architectures": [
  "ResNetForImageClassification"
 ],
 "depth": 18,
 "image_size": 64,
 "num_channels": 3,
 "num_labels": 5,
 "widths": [
  4,
  6,
  8,
  12
 ],
 "blocks_per_stage": [
  2,
  2,
  2,
  2
 ],
 "bn_eps": 1e-05
}