{
 "architectures": [
  "MistralForCausalLM"
 ],
 "model_type": "mistral",
 "hidden_size": 8,
 "intermediate_size": 12,
 "num_hidden_layers": 2,
 "num_attention_heads": 2,
 "num_key_value_heads": 1,
 "head_dim": 4,
 "vocab_size": 11,
 "max_position_embeddings": 16,
 "rms_norm_eps": 1e-05,
 "rope_theta": 10000.0,
 "sliding_window": 4,
 "tie_word_embeddings": false,
 "hidden_act": "silu"
}