{
 "architectures": [
  "PhiForCausalLM"
 ],
 "model_type": "phi",
 "hidden_size": 16,
 "intermediate_size": 24,
 "num_hidden_layers": 2,
 "num_attention_heads": 2,
 "vocab_size": 11,
 "max_position_embeddings": 16,
 "partial_rotary_factor": 0.5,
 "rope_theta": 10000.0,
 "layer_norm_eps": 1e-05,
 "hidden_act": "gelu_new",
 "qk_layernorm": false,
 "tie_word_embeddings": false
}