{
 "architectures": [
  "InternLM2ForCausalLM"
 ],
 "model_type": "internlm2",
 "hidden_size": 16,
 "intermediate_size": 24,
 "num_hidden_layers": 2,
 "num_attention_heads": 4,
 "num_key_value_heads": 2,
 "vocab_size": 13,
 "max_position_embeddings": 16,
 "rms_norm_eps": 1e-05,
 "rope_theta": 10000.0,
 "bias": false,
 "tie_word_embeddings": false,
 "hidden_act": "silu",
 "bos_token_id": 1,
 "eos_token_id": 2,
 "pad_token_id": 0
}