{
 "architectures": [
  "Phi3ForCausalLM"
 ],
 "model_type": "phi3",
 "hidden_size": 32,
 "intermediate_size": 24,
 "num_hidden_layers": 2,
 "num_attention_heads": 4,
 "num_key_value_heads": 2,
 "vocab_size": 13,
 "max_position_embeddings": 32,
 "original_max_position_embeddings": 8,
 "rms_norm_eps": 1e-05,
 "rope_theta": 10000.0,
 "partial_rotary_factor": 0.75,
 "rope_scaling": {
  "rope_type": "longrope",
  "short_factor": [
   1.0,
   1.0,
   1.0
  ],
  "long_factor": [
   1.0,
   1.3,
   1.8
  ],
  "rope_theta": 10000.0,
  "partial_rotary_factor": 0.75,
  "original_max_position_embeddings": 8
 },
 "tie_word_embeddings": true,
 "hidden_act": "silu",
 "bos_token_id": 1,
 "eos_token_id": 2,
 "pad_token_id": 0
}