{
 "architectures": [
  "CohereForCausalLM"
 ],
 "model_type": "cohere",
 "hidden_size": 8,
 "intermediate_size": 12,
 "num_hidden_layers": 3,
 "num_attention_heads": 2,
 "num_key_value_heads": 1,
 "head_dim": 4,
 "vocab_size": 13,
 "max_position_embeddings": 16,
 "layer_norm_eps": 1e-05,
 "rope_theta": 1000.0,
 "logit_scale": 0.0625,
 "attention_bias": false,
 "tie_word_embeddings": true,
 "use_qk_norm": true,
 "hidden_act": "silu"
}