{
 "transformers_version": "5.11.0",
 "architectures": null,
 "output_hidden_states": false,
 "return_dict": true,
 "dtype": null,
 "chunk_size_feed_forward": 0,
 "is_encoder_decoder": false,
 "id2label": {
  "0": "LABEL_0",
  "1": "LABEL_1"
 },
 "label2id": {
  "LABEL_0": 0,
  "LABEL_1": 1
 },
 "problem_type": null,
 "encoder_hidden_size": 2,
 "downsampling_ratios": [
  2,
  4
 ],
 "decoder_hidden_size": 16,
 "n_codebooks": 3,
 "codebook_size": 8,
 "codebook_dim": 4,
 "quantizer_dropout": 0.0,
 "commitment_loss_weight": 0.25,
 "codebook_loss_weight": 1.0,
 "sampling_rate": 8000,
 "upsampling_ratios": [
  4,
  2
 ],
 "hidden_size": 8,
 "hop_length": 8,
 "_name_or_path": "",
 "model_type": "dac",
 "output_attentions": false
}