{
 "architectures": [
  "LlamaForCausalLM"
 ],
 "model_type": "llama",
 "hidden_size": 8,
 "intermediate_size": 12,
 "num_hidden_layers": 2,
 "num_attention_heads": 2,
 "num_key_value_heads": 1,
 "vocab_size": 12,
 "max_position_embeddings": 16,
 "rms_norm_eps": 1e-05,
 "rope_theta": 100000,
 "rope_scaling": null,
 "tie_word_embeddings": true,
 "attention_bias": false,
 "mlp_bias": false,
 "hidden_act": "silu"
}