{
 "architectures": [
  "BitNetForCausalLM"
 ],
 "model_type": "bitnet",
 "hidden_size": 16,
 "intermediate_size": 32,
 "num_hidden_layers": 2,
 "num_attention_heads": 4,
 "num_key_value_heads": 2,
 "vocab_size": 13,
 "max_position_embeddings": 16,
 "rms_norm_eps": 1e-05,
 "hidden_act": "relu2",
 "attention_bias": false,
 "tie_word_embeddings": false,
 "rope_parameters": {
  "rope_theta": 500000.0,
  "rope_type": "default"
 },
 "bos_token_id": 1,
 "eos_token_id": 2,
 "pad_token_id": 0
}