{
 "transformers_version": "5.11.0",
 "architectures": null,
 "output_hidden_states": false,
 "return_dict": true,
 "dtype": null,
 "chunk_size_feed_forward": 0,
 "is_encoder_decoder": false,
 "id2label": {
  "0": "LABEL_0",
  "1": "LABEL_1",
  "2": "LABEL_2",
  "3": "LABEL_3",
  "4": "LABEL_4"
 },
 "label2id": {
  "LABEL_0": 0,
  "LABEL_1": 1,
  "LABEL_2": 2,
  "LABEL_3": 3,
  "LABEL_4": 4
 },
 "problem_type": null,
 "vocab_size": 8192,
 "hidden_size": 16,
 "num_hidden_layers": 2,
 "num_attention_heads": 4,
 "intermediate_size": 64,
 "hidden_act": "gelu",
 "hidden_dropout_prob": 0.0,
 "attention_probs_dropout_prob": 0.0,
 "initializer_range": 0.02,
 "layer_norm_eps": 1e-12,
 "image_size": 12,
 "patch_size": 4,
 "num_channels": 3,
 "use_mask_token": false,
 "use_absolute_position_embeddings": false,
 "use_relative_position_bias": true,
 "use_shared_relative_position_bias": false,
 "layer_scale_init_value": 0.1,
 "drop_path_rate": 0.0,
 "use_mean_pooling": true,
 "pool_scales": [
  1,
  2,
  3,
  6
 ],
 "use_auxiliary_head": true,
 "auxiliary_loss_weight": 0.4,
 "auxiliary_channels": 256,
 "auxiliary_num_convs": 1,
 "auxiliary_concat_input": false,
 "semantic_loss_ignore_index": 255,
 "add_fpn": false,
 "reshape_hidden_states": true,
 "stage_names": [
  "stem",
  "stage1",
  "stage2"
 ],
 "_name_or_path": "",
 "model_type": "beit",
 "output_attentions": false,
 "out_features": [
  "stage2"
 ],
 "out_indices": [
  2
 ]
}