{
 "architectures": [
  "WhisperForConditionalGeneration"
 ],
 "model_type": "whisper",
 "d_model": 12,
 "encoder_layers": 2,
 "decoder_layers": 2,
 "encoder_attention_heads": 2,
 "decoder_attention_heads": 2,
 "encoder_ffn_dim": 24,
 "decoder_ffn_dim": 24,
 "vocab_size": 31,
 "num_mel_bins": 80,
 "max_source_positions": 13,
 "max_target_positions": 12,
 "activation_function": "gelu",
 "scale_embedding": false,
 "tie_word_embeddings": true,
 "dropout": 0.0,
 "attention_dropout": 0.0,
 "activation_dropout": 0.0,
 "pad_token_id": 0,
 "bos_token_id": 1,
 "eos_token_id": 1,
 "decoder_start_token_id": 2
}