{
 "architectures": [
  "Starcoder2ForCausalLM"
 ],
 "model_type": "starcoder2",
 "hidden_size": 8,
 "intermediate_size": 16,
 "num_hidden_layers": 2,
 "num_attention_heads": 2,
 "num_key_value_heads": 1,
 "vocab_size": 13,
 "max_position_embeddings": 16,
 "norm_epsilon": 1e-05,
 "rope_theta": 100000.0,
 "sliding_window": null,
 "use_bias": true,
 "tie_word_embeddings": false,
 "hidden_act": "gelu_pytorch_tanh"
}