{
 "transformers_version": "5.11.0",
 "architectures": null,
 "output_hidden_states": false,
 "return_dict": true,
 "dtype": null,
 "chunk_size_feed_forward": 0,
 "is_encoder_decoder": false,
 "id2label": {
  "0": "LABEL_0",
  "1": "LABEL_1"
 },
 "label2id": {
  "LABEL_0": 0,
  "LABEL_1": 1
 },
 "problem_type": null,
 "vision_config": {
  "architectures": null,
  "output_hidden_states": false,
  "return_dict": true,
  "dtype": null,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "id2label": {
   "0": "LABEL_0",
   "1": "LABEL_1"
  },
  "label2id": {
   "LABEL_0": 0,
   "LABEL_1": 1
  },
  "problem_type": null,
  "hidden_size": 24,
  "intermediate_size": 48,
  "num_hidden_layers": 2,
  "num_attention_heads": 4,
  "num_channels": 3,
  "image_size": 12,
  "patch_size": 4,
  "hidden_act": "gelu_pytorch_tanh",
  "layer_norm_eps": 1e-06,
  "attention_dropout": 0.0,
  "_name_or_path": "",
  "model_type": "siglip_vision_model",
  "projection_dim": 32,
  "output_attentions": false
 },
 "text_config": {
  "architectures": null,
  "output_hidden_states": false,
  "return_dict": true,
  "dtype": null,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "id2label": {
   "0": "LABEL_0",
   "1": "LABEL_1"
  },
  "label2id": {
   "LABEL_0": 0,
   "LABEL_1": 1
  },
  "problem_type": null,
  "vocab_size": 50,
  "hidden_size": 32,
  "intermediate_size": 64,
  "num_hidden_layers": 2,
  "num_attention_heads": 4,
  "num_key_value_heads": 1,
  "head_dim": 8,
  "hidden_act": "gelu_pytorch_tanh",
  "max_position_embeddings": 64,
  "initializer_range": 0.02,
  "rms_norm_eps": 1e-06,
  "use_cache": true,
  "pad_token_id": 0,
  "eos_token_id": 1,
  "bos_token_id": 2,
  "tie_word_embeddings": false,
  "rope_parameters": {
   "rope_theta": 10000.0,
   "rope_type": "default"
  },
  "attention_bias": false,
  "attention_dropout": 0.0,
  "use_bidirectional_attention": true,
  "_name_or_path": "",
  "model_type": "gemma",
  "num_image_tokens": 9,
  "output_attentions": false,
  "rope_theta": 10000.0
 },
 "image_token_index": 49,
 "vocab_size": 257152,
 "projection_dim": 32,
 "hidden_size": 2048,
 "tie_word_embeddings": true,
 "_name_or_path": "",
 "model_type": "paligemma",
 "output_attentions": false
}