{
 "architectures": [
  "GPTNeoXForCausalLM"
 ],
 "model_type": "gpt_neox",
 "hidden_size": 16,
 "intermediate_size": 24,
 "num_hidden_layers": 2,
 "num_attention_heads": 2,
 "vocab_size": 11,
 "max_position_embeddings": 16,
 "rotary_pct": 0.25,
 "rotary_emb_base": 10000,
 "layer_norm_eps": 1e-05,
 "hidden_act": "gelu",
 "use_parallel_residual": false,
 "tie_word_embeddings": false
}