{
 "transformers_version": "5.11.0",
 "architectures": null,
 "output_hidden_states": false,
 "return_dict": true,
 "dtype": null,
 "chunk_size_feed_forward": 0,
 "is_encoder_decoder": false,
 "id2label": {
  "0": "LABEL_0",
  "1": "LABEL_1"
 },
 "label2id": {
  "LABEL_0": 0,
  "LABEL_1": 1
 },
 "problem_type": null,
 "target_bandwidths": [
  1.5,
  3.0,
  6.0,
  12.0,
  24.0
 ],
 "sampling_rate": 8000,
 "audio_channels": 1,
 "normalize": false,
 "chunk_length_s": null,
 "overlap": null,
 "hidden_size": 8,
 "num_filters": 2,
 "num_residual_layers": 1,
 "upsampling_ratios": [
  2,
  2
 ],
 "norm_type": "weight_norm",
 "kernel_size": 7,
 "last_kernel_size": 7,
 "residual_kernel_size": 3,
 "dilation_growth_rate": 2,
 "use_causal_conv": true,
 "pad_mode": "reflect",
 "compress": 2,
 "num_lstm_layers": 2,
 "trim_right_ratio": 1.0,
 "codebook_size": 8,
 "codebook_dim": 8,
 "use_conv_shortcut": true,
 "_name_or_path": "",
 "model_type": "encodec",
 "output_attentions": false
}