{
 "architectures": [
  "ModernBertModel"
 ],
 "model_type": "modernbert",
 "hidden_size": 8,
 "intermediate_size": 6,
 "num_hidden_layers": 4,
 "num_attention_heads": 2,
 "vocab_size": 13,
 "max_position_embeddings": 16,
 "norm_eps": 1e-05,
 "norm_bias": false,
 "attention_bias": false,
 "mlp_bias": false,
 "local_attention": 4,
 "global_attn_every_n_layers": 3,
 "global_rope_theta": 1000.0,
 "local_rope_theta": 10.0,
 "hidden_activation": "gelu",
 "pad_token_id": 0,
 "bos_token_id": 1,
 "eos_token_id": 2,
 "cls_token_id": 1,
 "sep_token_id": 2
}