{
 "architectures": [
  "NemotronHForCausalLM"
 ],
 "model_type": "nemotron_h",
 "vocab_size": 13,
 "hidden_size": 8,
 "hybrid_override_pattern": "M*E-",
 "num_attention_heads": 4,
 "num_key_value_heads": 2,
 "head_dim": 3,
 "attention_bias": false,
 "intermediate_size": 12,
 "mlp_hidden_act": "relu2",
 "mlp_bias": false,
 "n_routed_experts": 4,
 "num_experts_per_tok": 2,
 "moe_intermediate_size": 6,
 "n_shared_experts": 1,
 "moe_shared_expert_intermediate_size": 5,
 "norm_topk_prob": true,
 "routed_scaling_factor": 2.5,
 "n_group": 1,
 "topk_group": 1,
 "moe_latent_size": null,
 "ssm_state_size": 4,
 "mamba_num_heads": 2,
 "mamba_head_dim": 4,
 "n_groups": 1,
 "conv_kernel": 4,
 "chunk_size": 8,
 "use_bias": false,
 "use_conv_bias": true,
 "mamba_proj_bias": false,
 "layer_norm_epsilon": 1e-05,
 "tie_word_embeddings": false,
 "use_cache": true,
 "bos_token_id": 1,
 "eos_token_id": 2,
 "pad_token_id": 0
}