{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|im_end|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "Regex": "(?i:'s|'t|'re|'ve|'m|'ll|'d)|[^\\r\\n\\p{L}\\p{N}]?[\\p{L}\\p{M}]+|\\p{N}| ?[^\\s\\p{L}\\p{M}\\p{N}]+[\\r\\n]*|\\s*[\\r\\n]+|\\s+(?!\\S)|\\s+"
        },
        "behavior": "Isolated",
        "invert": false
      },
      {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": false
      }
    ]
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "<|im_end|>": 1,
      "!": 2,
      "\"": 3,
      "#": 4,
      "$": 5,
      "%": 6,
      "&": 7,
      "'": 8,
      "(": 9,
      ")": 10,
      "*": 11,
      "+": 12,
      ",": 13,
      "-": 14,
      ".": 15,
      "/": 16,
      "0": 17,
      "1": 18,
      "2": 19,
      "3": 20,
      "4": 21,
      "5": 22,
      "6": 23,
      "7": 24,
      "8": 25,
      "9": 26,
      ":": 27,
      ";": 28,
      "<": 29,
      "=": 30,
      ">": 31,
      "?": 32,
      "@": 33,
      "A": 34,
      "B": 35,
      "C": 36,
      "D": 37,
      "E": 38,
      "F": 39,
      "G": 40,
      "H": 41,
      "I": 42,
      "J": 43,
      "K": 44,
      "L": 45,
      "M": 46,
      "N": 47,
      "O": 48,
      "P": 49,
      "Q": 50,
      "R": 51,
      "S": 52,
      "T": 53,
      "U": 54,
      "V": 55,
      "W": 56,
      "X": 57,
      "Y": 58,
      "Z": 59,
      "[": 60,
      "\\": 61,
      "]": 62,
      "^": 63,
      "_": 64,
      "`": 65,
      "a": 66,
      "b": 67,
      "c": 68,
      "d": 69,
      "e": 70,
      "f": 71,
      "g": 72,
      "h": 73,
      "i": 74,
      "j": 75,
      "k": 76,
      "l": 77,
      "m": 78,
      "n": 79,
      "o": 80,
      "p": 81,
      "q": 82,
      "r": 83,
      "s": 84,
      "t": 85,
      "u": 86,
      "v": 87,
      "w": 88,
      "x": 89,
      "y": 90,
      "z": 91,
      "{": 92,
      "|": 93,
      "}": 94,
      "~": 95,
      "ТЁ": 96,
      "ТЂ": 97,
      "ТЃ": 98,
      "ТЄ": 99,
      "ТЅ": 100,
      "ТІ": 101,
      "ТЇ": 102,
      "ТЈ": 103,
      "ТЉ": 104,
      "ТЊ": 105,
      "ТЋ": 106,
      "ТЌ": 107,
      "ТЎ": 108,
      "ТЏ": 109,
      "ТА": 110,
      "ТБ": 111,
      "ТВ": 112,
      "ТГ": 113,
      "ТД": 114,
      "ТЕ": 115,
      "ТЖ": 116,
      "ТЗ": 117,
      "ТИ": 118,
      "ТЙ": 119,
      "ТК": 120,
      "ТЛ": 121,
      "ТМ": 122,
      "ТН": 123,
      "ТО": 124,
      "ТП": 125,
      "У": 126,
      "У": 127,
      "У": 128,
      "У": 129,
      "У": 130,
      "У": 131,
      "У": 132,
      "У": 133,
      "У": 134,
      "У": 135,
      "У": 136,
      "У": 137,
      "У": 138,
      "У": 139,
      "У": 140,
      "У": 141,
      "У": 142,
      "У": 143,
      "У": 144,
      "У": 145,
      "У": 146,
      "У": 147,
      "У": 148,
      "У": 149,
      "У": 150,
      "У": 151,
      "У": 152,
      "У": 153,
      "У": 154,
      "У": 155,
      "У": 156,
      "У": 157,
      "У ": 158,
      "УЁ": 159,
      "УЂ": 160,
      "УЃ": 161,
      "УЄ": 162,
      "УЅ": 163,
      "УІ": 164,
      "УЇ": 165,
      "УЈ": 166,
      "УЉ": 167,
      "УЊ": 168,
      "УЋ": 169,
      "УЌ": 170,
      "У­": 171,
      "УЎ": 172,
      "УЏ": 173,
      "УА": 174,
      "УБ": 175,
      "УВ": 176,
      "УГ": 177,
      "УД": 178,
      "УЕ": 179,
      "УЖ": 180,
      "УЗ": 181,
      "УИ": 182,
      "УЙ": 183,
      "УК": 184,
      "УЛ": 185,
      "УМ": 186,
      "УН": 187,
      "УО": 188,
      "УП": 189,
      "Ф": 190,
      "Ф": 191,
      "Ф": 192,
      "Ф": 193,
      "Ф": 194,
      "Ф": 195,
      "Ф": 196,
      "Ф": 197,
      "Ф": 198,
      "Ф": 199,
      "Ф": 200,
      "Ф": 201,
      "Ф": 202,
      "Ф": 203,
      "Ф": 204,
      "Ф": 205,
      "Ф": 206,
      "Ф": 207,
      "Ф": 208,
      "Ф": 209,
      "Ф": 210,
      "Ф": 211,
      "Ф": 212,
      "Ф": 213,
      "Ф": 214,
      "Ф": 215,
      "Ф": 216,
      "Ф": 217,
      "Ф": 218,
      "Ф": 219,
      "Ф": 220,
      "Ф": 221,
      "Ф ": 222,
      "ФЁ": 223,
      "ФЂ": 224,
      "ФЃ": 225,
      "ФЄ": 226,
      "ФЅ": 227,
      "ФІ": 228,
      "ФЇ": 229,
      "ФЈ": 230,
      "ФЉ": 231,
      "ФЊ": 232,
      "ФЋ": 233,
      "ФЌ": 234,
      "Ф­": 235,
      "ФЎ": 236,
      "ФЏ": 237,
      "ФА": 238,
      "ФБ": 239,
      "ФВ": 240,
      "ФГ": 241,
      "ФД": 242,
      "ФЕ": 243,
      "ФЖ": 244,
      "ФЗ": 245,
      "ФИ": 246,
      "ФЙ": 247,
      "ФК": 248,
      "ФЛ": 249,
      "ФМ": 250,
      "ФН": 251,
      "ФО": 252,
      "ФП": 253,
      "Х": 254,
      "Х": 255,
      "Х": 256,
      "Х": 257,
      "У ТЄ": 258,
      "he": 259,
      "У ТИ": 260,
      "У ТІ": 261,
      "Ф s": 262,
      "Ф t": 263,
      "re": 264,
      "У ТЅ": 265,
      "Ф the": 266,
      "УФЃ": 267,
      "Ф a": 268,
      "at": 269,
      "У ТЋ": 270,
      "on": 271,
      "ve": 272,
      "Ф b": 273,
      "Ф c": 274,
      "ll": 275,
      "Ф d": 276,
      "Ф l": 277,
      "Ф se": 278,
      "lls": 279,
      "af": 280,
      "as": 281,
      "ck": 282,
      "nd": 283,
      "qu": 284,
      "um": 285,
      "ТЊУ ТИ": 286,
      "Ф n": 287,
      "Ф w": 288,
      "Ф У ТЄ": 289,
      "Ф У ТІ": 290,
      "У ТИТЊУ ТИ": 291,
      "Ф and": 292,
      "?s": 293,
      "eУФЃ": 294,
      "in": 295,
      "ive": 296,
      "ick": 297,
      "og": 298,
      "or": 299,
      "ou": 300,
      "xУФЃ": 301,
      "ТЈУ ТЄ": 302,
      "ТИУ": 303,
      "ТЙУ": 304,
      "УТИУ": 305,
      "УТЙУ": 306,
      "УФЗ": 307,
      "Ф j": 308,
      "Ф m": 309,
      "Ф qu": 310,
      "ФЏУ ТЄ": 311,
      "hells": 312,
      "У ТЅФЉ": 313,
      "У ТЅФЏУ ТЄ": 314,
      "У ТЋТЈ": 315,
      "Ф be": 316,
      "Ф seas": 317,
      "УФЗУТЙУ": 318,
      "aive": 319,
      "en": 320,
      "er": 321,
      "ere": 322,
      "fo": 323,
      "hat": 324,
      "is": 325,
      "it": 326,
      "ly": 327,
      "ow": 328,
      "pe": 329,
      "ТЄУ ТЅФЉ": 330,
      "ТІУ ТЅ": 331,
      "ТЇУ ТИ": 332,
      "ТЈУ": 333,
      "ТЈУ ТІ": 334,
      "ТЉУТИУ": 335,
      "ТЊУ ТІ": 336,
      "ТЎУ ТЄ": 337,
      "ТБУ ТИТЊУ ТИ": 338,
      "ТИУ ТЅФЏУ ТЄ": 339,
      "ТОУ ТІ": 340,
      "ТПУ ТЄ": 341,
      "УФО": 342,
      "УТЉУТИУ": 343,
      "УТЈУ": 344,
      "УФЇ": 345,
      "УФА": 346,
      "УФД": 347,
      "Ф ?": 348,
      "Ф y": 349,
      "Ф on": 350,
      "Ф or": 351,
      "Ф xУФЃ": 352,
      "ФЃУФО": 353,
      "ФЖУ ТИ": 354,
      "У ТЄТЈУ ТЄ": 355,
      "Ф sat": 356,
      "У ТЋТЇ": 357,
      "У ТЋТЉ": 358,
      "ver": 359,
      "Ф caf": 360,
      "Ф dog": 361,
      "Ф li": 362,
      "Ф sells": 363,
      "ump": 364,
      "Ф naive": 365,
      "Ф У ТІФЗ": 366,
      "У ТИТЊУ ТИТЇУ ТИ": 367,
      "ing": 368,
      "Ф jump": 369,
      "Ф quick": 370,
      "Ф seashells": 371,
      "УФЗУТЙУФП": 372,
      "ers": 373,
      "ТЈУ ТІТП": 374,
      "ТЊУ ТІТОУ ТІ": 375,
      "ТЎУ ТЄТИУ ТЅФЏУ ТЄ": 376,
      "ТБУ ТИТЊУ ТИФЖУ ТИ": 377,
      "УТЉУТИУФЃУФО": 378,
      "У ТИТЊУ ТИТЇУ ТИТБУ ТИТЊУ ТИФЖУ ТИ": 379,
      "ТЊУ ТІТОУ ТІТЈУ ТІТП": 380,
      "ТЎУ ТЄТИУ ТЅФЏУ ТЄТЄУ ТЅФЉ": 381,
      "УТЉУТИУФЃУФОУФЗУТЙУФП": 382,
      "У ТИТЊУ ТИТЇУ ТИТБУ ТИТЊУ ТИФЖУ ТИТЕ": 383,
      "'s": 384,
      "'t": 385,
      "Don": 386,
      "How": 387,
      "In": 388,
      "Pa": 389,
      "She": 390,
      "The": 391,
      "ar": 392,
      "ay": 393,
      "az": 394,
      "br": 395,
      "bin": 396,
      "bers": 397,
      "ch": 398,
      "co": 399
    },
    "merges": [
      [
        "У ",
        "ТЄ"
      ],
      [
        "h",
        "e"
      ],
      [
        "У ",
        "ТИ"
      ],
      [
        "У ",
        "ТІ"
      ],
      [
        "Ф ",
        "s"
      ],
      [
        "Ф ",
        "t"
      ],
      [
        "r",
        "e"
      ],
      [
        "У ",
        "ТЅ"
      ],
      [
        "Ф t",
        "he"
      ],
      [
        "У",
        "ФЃ"
      ],
      [
        "Ф ",
        "a"
      ],
      [
        "a",
        "t"
      ],
      [
        "У ",
        "ТЋ"
      ],
      [
        "o",
        "n"
      ],
      [
        "v",
        "e"
      ],
      [
        "Ф ",
        "b"
      ],
      [
        "Ф ",
        "c"
      ],
      [
        "l",
        "l"
      ],
      [
        "Ф ",
        "d"
      ],
      [
        "Ф ",
        "l"
      ],
      [
        "Ф s",
        "e"
      ],
      [
        "ll",
        "s"
      ],
      [
        "a",
        "f"
      ],
      [
        "a",
        "s"
      ],
      [
        "c",
        "k"
      ],
      [
        "n",
        "d"
      ],
      [
        "q",
        "u"
      ],
      [
        "u",
        "m"
      ],
      [
        "ТЊ",
        "У ТИ"
      ],
      [
        "Ф ",
        "n"
      ],
      [
        "Ф ",
        "w"
      ],
      [
        "Ф ",
        "У ТЄ"
      ],
      [
        "Ф ",
        "У ТІ"
      ],
      [
        "У ТИ",
        "ТЊУ ТИ"
      ],
      [
        "Ф a",
        "nd"
      ],
      [
        "?",
        "s"
      ],
      [
        "e",
        "УФЃ"
      ],
      [
        "i",
        "n"
      ],
      [
        "i",
        "ve"
      ],
      [
        "i",
        "ck"
      ],
      [
        "o",
        "g"
      ],
      [
        "o",
        "r"
      ],
      [
        "o",
        "u"
      ],
      [
        "x",
        "УФЃ"
      ],
      [
        "ТЈ",
        "У ТЄ"
      ],
      [
        "ТИ",
        "У"
      ],
      [
        "ТЙ",
        "У"
      ],
      [
        "У",
        "ТИУ"
      ],
      [
        "У",
        "ТЙУ"
      ],
      [
        "У",
        "ФЗ"
      ],
      [
        "Ф ",
        "j"
      ],
      [
        "Ф ",
        "m"
      ],
      [
        "Ф ",
        "qu"
      ],
      [
        "ФЏ",
        "У ТЄ"
      ],
      [
        "he",
        "lls"
      ],
      [
        "У ТЅ",
        "ФЉ"
      ],
      [
        "У ТЅ",
        "ФЏУ ТЄ"
      ],
      [
        "У ТЋ",
        "ТЈ"
      ],
      [
        "Ф b",
        "e"
      ],
      [
        "Ф se",
        "as"
      ],
      [
        "УФЗ",
        "УТЙУ"
      ],
      [
        "a",
        "ive"
      ],
      [
        "e",
        "n"
      ],
      [
        "e",
        "r"
      ],
      [
        "e",
        "re"
      ],
      [
        "f",
        "o"
      ],
      [
        "h",
        "at"
      ],
      [
        "i",
        "s"
      ],
      [
        "i",
        "t"
      ],
      [
        "l",
        "y"
      ],
      [
        "o",
        "w"
      ],
      [
        "p",
        "e"
      ],
      [
        "ТЄ",
        "У ТЅФЉ"
      ],
      [
        "ТІ",
        "У ТЅ"
      ],
      [
        "ТЇ",
        "У ТИ"
      ],
      [
        "ТЈ",
        "У"
      ],
      [
        "ТЈ",
        "У ТІ"
      ],
      [
        "ТЉ",
        "УТИУ"
      ],
      [
        "ТЊ",
        "У ТІ"
      ],
      [
        "ТЎ",
        "У ТЄ"
      ],
      [
        "ТБ",
        "У ТИТЊУ ТИ"
      ],
      [
        "ТИ",
        "У ТЅФЏУ ТЄ"
      ],
      [
        "ТО",
        "У ТІ"
      ],
      [
        "ТП",
        "У ТЄ"
      ],
      [
        "У",
        "ФО"
      ],
      [
        "У",
        "ТЉУТИУ"
      ],
      [
        "У",
        "ТЈУ"
      ],
      [
        "У",
        "ФЇ"
      ],
      [
        "У",
        "ФА"
      ],
      [
        "У",
        "ФД"
      ],
      [
        "Ф ",
        "?"
      ],
      [
        "Ф ",
        "y"
      ],
      [
        "Ф ",
        "on"
      ],
      [
        "Ф ",
        "or"
      ],
      [
        "Ф ",
        "xУФЃ"
      ],
      [
        "ФЃ",
        "УФО"
      ],
      [
        "ФЖ",
        "У ТИ"
      ],
      [
        "У ТЄ",
        "ТЈУ ТЄ"
      ],
      [
        "Ф s",
        "at"
      ],
      [
        "У ТЋ",
        "ТЇ"
      ],
      [
        "У ТЋ",
        "ТЉ"
      ],
      [
        "ve",
        "r"
      ],
      [
        "Ф c",
        "af"
      ],
      [
        "Ф d",
        "og"
      ],
      [
        "Ф l",
        "i"
      ],
      [
        "Ф se",
        "lls"
      ],
      [
        "um",
        "p"
      ],
      [
        "Ф n",
        "aive"
      ],
      [
        "Ф У ТІ",
        "ФЗ"
      ],
      [
        "У ТИТЊУ ТИ",
        "ТЇУ ТИ"
      ],
      [
        "in",
        "g"
      ],
      [
        "Ф j",
        "ump"
      ],
      [
        "Ф qu",
        "ick"
      ],
      [
        "Ф seas",
        "hells"
      ],
      [
        "УФЗУТЙУ",
        "ФП"
      ],
      [
        "er",
        "s"
      ],
      [
        "ТЈУ ТІ",
        "ТП"
      ],
      [
        "ТЊУ ТІ",
        "ТОУ ТІ"
      ],
      [
        "ТЎУ ТЄ",
        "ТИУ ТЅФЏУ ТЄ"
      ],
      [
        "ТБУ ТИТЊУ ТИ",
        "ФЖУ ТИ"
      ],
      [
        "УТЉУТИУ",
        "ФЃУФО"
      ],
      [
        "У ТИТЊУ ТИТЇУ ТИ",
        "ТБУ ТИТЊУ ТИФЖУ ТИ"
      ],
      [
        "ТЊУ ТІТОУ ТІ",
        "ТЈУ ТІТП"
      ],
      [
        "ТЎУ ТЄТИУ ТЅФЏУ ТЄ",
        "ТЄУ ТЅФЉ"
      ],
      [
        "УТЉУТИУФЃУФО",
        "УФЗУТЙУФП"
      ],
      [
        "У ТИТЊУ ТИТЇУ ТИТБУ ТИТЊУ ТИФЖУ ТИ",
        "ТЕ"
      ],
      [
        "'",
        "s"
      ],
      [
        "'",
        "t"
      ],
      [
        "D",
        "on"
      ],
      [
        "H",
        "ow"
      ],
      [
        "I",
        "n"
      ],
      [
        "P",
        "a"
      ],
      [
        "S",
        "he"
      ],
      [
        "T",
        "he"
      ],
      [
        "a",
        "r"
      ],
      [
        "a",
        "y"
      ],
      [
        "a",
        "z"
      ],
      [
        "b",
        "r"
      ],
      [
        "b",
        "in"
      ],
      [
        "b",
        "ers"
      ],
      [
        "c",
        "h"
      ],
      [
        "c",
        "o"
      ]
    ]
  }
}