{
 "architectures": [
  "BertModel"
 ],
 "model_type": "bert",
 "hidden_size": 8,
 "num_hidden_layers": 2,
 "num_attention_heads": 2,
 "intermediate_size": 16,
 "vocab_size": 13,
 "max_position_embeddings": 16,
 "type_vocab_size": 2,
 "hidden_act": "gelu",
 "layer_norm_eps": 1e-12
}