{
 "architectures": [
  "DeepseekV2ForCausalLM"
 ],
 "model_type": "deepseek_v2",
 "vocab_size": 11,
 "hidden_size": 8,
 "num_hidden_layers": 2,
 "num_attention_heads": 2,
 "num_key_value_heads": 2,
 "qk_nope_head_dim": 6,
 "qk_rope_head_dim": 4,
 "v_head_dim": 6,
 "kv_lora_rank": 5,
 "q_lora_rank": null,
 "intermediate_size": 12,
 "moe_intermediate_size": 5,
 "n_shared_experts": 2,
 "n_routed_experts": 4,
 "num_experts_per_tok": 2,
 "first_k_dense_replace": 1,
 "moe_layer_freq": 1,
 "norm_topk_prob": false,
 "routed_scaling_factor": 1.5,
 "topk_method": "greedy",
 "scoring_func": "softmax",
 "max_position_embeddings": 16,
 "rope_theta": 10000.0,
 "rope_scaling": null,
 "rms_norm_eps": 1e-05,
 "hidden_act": "silu",
 "attention_bias": false,
 "tie_word_embeddings": false,
 "torch_dtype": "float32"
}