{"version": "1.0", "truncation": null, "padding": null, "added_tokens": [{"id": 0, "content": "<|endoftext|>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true}, {"id": 1, "content": "<|im_end|>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true}], "normalizer": null, "pre_tokenizer": {"type": "Sequence", "pretokenizers": [{"type": "Split", "pattern": {"Regex": "[\r\n]"}, "behavior": "Isolated", "invert": false}, {"type": "Split", "pattern": {"Regex": "\\s?[A-Za-z¬µ√А-√Ц√Ш-√ґ√Є-∆Ї∆Љ-∆њ«Д- У Х- ѓЌ∞-Ќ≥ЌґЌЈЌї-ЌљЌњќЖќИ-ќКќМќО-ќ°ќ£-ѕµѕЈ-“Б“К-‘ѓ‘±-’ЦбВ†-бГЕбО†-бПµбПЄ-бПљб≤Р-б≤Їб≤љ-б≤њбіА-біЂбµЂ-бµЈбµє-бґЪбЄА-бЉХбЉШ-бЉЭбЉ†-бљЕбљИ-бљНбљР-бљЧбљЩбљЫбљЭбљЯ-бљљбЊА-бЊібЊґ-бЊЉбЊЊбњВ-бњДбњЖ-бњМбњР-бњУбњЦ-бњЫбњ†-бњђбњ≤-бњібњґ-бњЉвДВвДЗвДК-вДУвДХвДЩ-вДЭвД§вД¶вД®вД™-вД≠вДѓ-вДівДєвДЉ-вДњвЕЕ-вЕЙвЕОвЖГвЖДв∞А-в±їв±Њ-в≥§в≥Ђ-в≥Ѓв≥≤в≥≥кЩА-кЩ≠кЪА-кЪЫкЬҐ-кЭѓкЭ±-кЮЗкЮЛ-кЮОк≠∞-кЃњпђА-пђЖпђУ-пђЧпЉ°-пЉЇпљБ-пљЪрРРА-рРСПрРТ∞-рРУУрРУШ-рРУїрР≤А-рР≤≤рР≥А-рР≥≤рСҐ†-рС£ЯрЮ§А-рЮ•Г]+"}, "behavior": "Isolated", "invert": false}, {"type": "Split", "pattern": {"Regex": "\\s?[!-/:-~пЉБ-пЉПпЉЪ-пљЮвАШ-вАЯгАА-гАВ]+"}, "behavior": "Isolated", "invert": false}, {"type": "Split", "pattern": {"Regex": "\\s+$"}, "behavior": "Isolated", "invert": false}, {"type": "Split", "pattern": {"Regex": "[дЄА-йЊ•а†А-дЄАк∞А-нЯњ]+"}, "behavior": "Isolated", "invert": false}, {"type": "Digits", "individual_digits": true}, {"type": "ByteLevel", "add_prefix_space": false, "trim_offsets": true, "use_regex": false}]}, "post_processor": null, "decoder": {"type": "ByteLevel", "add_prefix_space": true, "trim_offsets": true, "use_regex": true}, "model": {"type": "BPE", "dropout": null, "unk_token": null, "continuing_subword_prefix": null, "end_of_word_suffix": null, "fuse_unk": false, "byte_fallback": false, "ignore_merges": false, "vocab": {"<|endoftext|>": 0, "<|im_end|>": 1, "!": 2, "\"": 3, "#": 4, "$": 5, "%": 6, "&": 7, "'": 8, "(": 9, ")": 10, "*": 11, "+": 12, ",": 13, "-": 14, ".": 15, "/": 16, "0": 17, "1": 18, "2": 19, "3": 20, "4": 21, "5": 22, "6": 23, "7": 24, "8": 25, "9": 26, ":": 27, ";": 28, "<": 29, "=": 30, ">": 31, "?": 32, "@": 33, "A": 34, "B": 35, "C": 36, "D": 37, "E": 38, "F": 39, "G": 40, "H": 41, "I": 42, "J": 43, "K": 44, "L": 45, "M": 46, "N": 47, "O": 48, "P": 49, "Q": 50, "R": 51, "S": 52, "T": 53, "U": 54, "V": 55, "W": 56, "X": 57, "Y": 58, "Z": 59, "[": 60, "\\": 61, "]": 62, "^": 63, "_": 64, "`": 65, "a": 66, "b": 67, "c": 68, "d": 69, "e": 70, "f": 71, "g": 72, "h": 73, "i": 74, "j": 75, "k": 76, "l": 77, "m": 78, "n": 79, "o": 80, "p": 81, "q": 82, "r": 83, "s": 84, "t": 85, "u": 86, "v": 87, "w": 88, "x": 89, "y": 90, "z": 91, "{": 92, "|": 93, "}": 94, "~": 95, "¬°": 96, "¬Ґ": 97, "¬£": 98, "¬§": 99, "¬•": 100, "¬¶": 101, "¬І": 102, "¬®": 103, "¬©": 104, "¬™": 105, "¬Ђ": 106, "¬ђ": 107, "¬Ѓ": 108, "¬ѓ": 109, "¬∞": 110, "¬±": 111, "¬≤": 112, "¬≥": 113, "¬і": 114, "¬µ": 115, "¬ґ": 116, "¬Ј": 117, "¬Є": 118, "¬є": 119, "¬Ї": 120, "¬ї": 121, "¬Љ": 122, "¬љ": 123, "¬Њ": 124, "¬њ": 125, "√А": 126, "√Б": 127, "√В": 128, "√Г": 129, "√Д": 130, "√Е": 131, "√Ж": 132, "√З": 133, "√И": 134, "√Й": 135, "√К": 136, "√Л": 137, "√М": 138, "√Н": 139, "√О": 140, "√П": 141, "√Р": 142, "√С": 143, "√Т": 144, "√У": 145, "√Ф": 146, "√Х": 147, "√Ц": 148, "√Ч": 149, "√Ш": 150, "√Щ": 151, "√Ъ": 152, "√Ы": 153, "√Ь": 154, "√Э": 155, "√Ю": 156, "√Я": 157, "√†": 158, "√°": 159, "√Ґ": 160, "√£": 161, "√§": 162, "√•": 163, "√¶": 164, "√І": 165, "√®": 166, "√©": 167, "√™": 168, "√Ђ": 169, "√ђ": 170, "√≠": 171, "√Ѓ": 172, "√ѓ": 173, "√∞": 174, "√±": 175, "√≤": 176, "√≥": 177, "√і": 178, "√µ": 179, "√ґ": 180, "√Ј": 181, "√Є": 182, "√є": 183, "√Ї": 184, "√ї": 185, "√Љ": 186, "√љ": 187, "√Њ": 188, "√њ": 189, "ƒА": 190, "ƒБ": 191, "ƒВ": 192, "ƒГ": 193, "ƒД": 194, "ƒЕ": 195, "ƒЖ": 196, "ƒЗ": 197, "ƒИ": 198, "ƒЙ": 199, "ƒК": 200, "ƒЛ": 201, "ƒМ": 202, "ƒН": 203, "ƒО": 204, "ƒП": 205, "ƒР": 206, "ƒС": 207, "ƒТ": 208, "ƒУ": 209, "ƒФ": 210, "ƒХ": 211, "ƒЦ": 212, "ƒЧ": 213, "ƒШ": 214, "ƒЩ": 215, "ƒЪ": 216, "ƒЫ": 217, "ƒЬ": 218, "ƒЭ": 219, "ƒЮ": 220, "ƒЯ": 221, "ƒ†": 222, "ƒ°": 223, "ƒҐ": 224, "ƒ£": 225, "ƒ§": 226, "ƒ•": 227, "ƒ¶": 228, "ƒІ": 229, "ƒ®": 230, "ƒ©": 231, "ƒ™": 232, "ƒЂ": 233, "ƒђ": 234, "ƒ≠": 235, "ƒЃ": 236, "ƒѓ": 237, "ƒ∞": 238, "ƒ±": 239, "ƒ≤": 240, "ƒ≥": 241, "ƒі": 242, "ƒµ": 243, "ƒґ": 244, "ƒЈ": 245, "ƒЄ": 246, "ƒє": 247, "ƒЇ": 248, "ƒї": 249, "ƒЉ": 250, "ƒљ": 251, "ƒЊ": 252, "ƒњ": 253, "≈А": 254, "≈Б": 255, "≈В": 256, "≈Г": 257, "eƒ†": 258, "th": 259, "sƒ†": 260, "tƒ†": 261, "ƒ†th": 262, "er": 263, "el": 264, "on": 265, "ƒ†theƒ†": 266, "or": 267, "sh": 268, "yƒ†": 269, "ƒ†a": 270, "ell": 271, "atƒ†": 272, "ck": 273, "ea": 274, "nd": 275, "qu": 276, "ellsƒ†": 277, ",ƒ†": 278, "44": 279, "at": 280, "do": 281, "e.": 282, "ick": 283, "ju": 284, "nƒ†": 285, "ou": 286, "sea": 287, "ƒ†b": 288, "ƒ†w": 289, "eƒ†s": 290, "seash": 291, "33": 292, "af": 293, "and": 294, "ch": 295, "e,": 296, "g.": 297, "iv": 298, "li": 299, "mp": 300, "ow": 301, "ox": 302, "oƒ†b": 303, "rƒ†": 304, "s.": 305, "satƒ†": 306, "toƒ†b": 307, "ver": 308, "ze": 309, "√§¬Є": 310, "ƒ†d": 311, "ƒ†m": 312, "ƒ†n": 313, "ƒ†ju": 314, "eƒ†c": 315, "eƒ†qu": 316, "ereƒ†": 317, "onƒ†theƒ†": 318, "ƒ†aƒ†": 319, "ƒ†and": 320, "ƒ†wi": 321, "eƒ†sellsƒ†": 322, "satƒ†onƒ†theƒ†": 323, "'sƒ†": 324, "'tƒ†": 325, ".ƒ†theƒ†": 326, "02": 327, "12": 328, "1,ƒ†": 329, "22": 330, "2ƒ†w": 331, "202": 332, "36": 333, "3ƒ†and": 334, "5ƒ†d": 335, "52ƒ†w": 336, "6ƒ†th": 337, ";ƒ†": 338, "Aƒ†n": 339, "Don": 340, "How": 341, "Inƒ†": 342, "Pa": 343, "Sh": 344, "Th": 345, "ar": 346, "ay": 347, "az": 348, "asƒ†": 349, "aiv": 350, "be": 351, "br": 352, "by": 353, "ber": 354, "box": 355, "cr": 356, "cou": 357, "der": 358, "dƒ†aƒ†": 359, "ee": 360, "en": 361, "ep": 362, "es": 363, "ex": 364, "eyƒ†": 365, "ever": 366, "edƒ†aƒ†": 367, "ff": 368, "for": 369, "fiv": 370, "fox": 371, "gl": 372, "gs": 373, "gƒ†": 374, "her": 375, "hat": 376, "in": 377, "it": 378, "isƒ†": 379, "ion": 380, "keƒ†": 381, "ks.": 382, "lo": 383, "leƒ†": 384, "laz": 385, "mat": 386, "mber": 387, "nu": 388, "ntƒ†": 389, "never": 390, "otƒ†": 391, "over": 392, "pp": 393, "pat": 394, "rel": 395, "ron": 396, "row": 397, "s,ƒ†": 398, "se.": 399}, "merges": [["e", "ƒ†"], ["t", "h"], ["s", "ƒ†"], ["t", "ƒ†"], ["ƒ†", "th"], ["e", "r"], ["e", "l"], ["o", "n"], ["ƒ†th", "eƒ†"], ["o", "r"], ["s", "h"], ["y", "ƒ†"], ["ƒ†", "a"], ["el", "l"], ["a", "tƒ†"], ["c", "k"], ["e", "a"], ["n", "d"], ["q", "u"], ["ell", "sƒ†"], [",", "ƒ†"], ["4", "4"], ["a", "t"], ["d", "o"], ["e", "."], ["i", "ck"], ["j", "u"], ["n", "ƒ†"], ["o", "u"], ["s", "ea"], ["ƒ†", "b"], ["ƒ†", "w"], ["eƒ†", "s"], ["sea", "sh"], ["3", "3"], ["a", "f"], ["a", "nd"], ["c", "h"], ["e", ","], ["g", "."], ["i", "v"], ["l", "i"], ["m", "p"], ["o", "w"], ["o", "x"], ["o", "ƒ†b"], ["r", "ƒ†"], ["s", "."], ["s", "atƒ†"], ["t", "oƒ†b"], ["v", "er"], ["z", "e"], ["√§", "¬Є"], ["ƒ†", "d"], ["ƒ†", "m"], ["ƒ†", "n"], ["ƒ†", "ju"], ["eƒ†", "c"], ["eƒ†", "qu"], ["er", "eƒ†"], ["on", "ƒ†theƒ†"], ["ƒ†a", "ƒ†"], ["ƒ†a", "nd"], ["ƒ†w", "i"], ["eƒ†s", "ellsƒ†"], ["satƒ†", "onƒ†theƒ†"], ["'", "sƒ†"], ["'", "tƒ†"], [".", "ƒ†theƒ†"], ["0", "2"], ["1", "2"], ["1", ",ƒ†"], ["2", "2"], ["2", "ƒ†w"], ["2", "02"], ["3", "6"], ["3", "ƒ†and"], ["5", "ƒ†d"], ["5", "2ƒ†w"], ["6", "ƒ†th"], [";", "ƒ†"], ["A", "ƒ†n"], ["D", "on"], ["H", "ow"], ["I", "nƒ†"], ["P", "a"], ["S", "h"], ["T", "h"], ["a", "r"], ["a", "y"], ["a", "z"], ["a", "sƒ†"], ["a", "iv"], ["b", "e"], ["b", "r"], ["b", "y"], ["b", "er"], ["b", "ox"], ["c", "r"], ["c", "ou"], ["d", "er"], ["d", "ƒ†aƒ†"], ["e", "e"], ["e", "n"], ["e", "p"], ["e", "s"], ["e", "x"], ["e", "yƒ†"], ["e", "ver"], ["e", "dƒ†aƒ†"], ["f", "f"], ["f", "or"], ["f", "iv"], ["f", "ox"], ["g", "l"], ["g", "s"], ["g", "ƒ†"], ["h", "er"], ["h", "at"], ["i", "n"], ["i", "t"], ["i", "sƒ†"], ["i", "on"], ["k", "eƒ†"], ["k", "s."], ["l", "o"], ["l", "eƒ†"], ["l", "az"], ["m", "at"], ["m", "ber"], ["n", "u"], ["n", "tƒ†"], ["n", "ever"], ["o", "tƒ†"], ["o", "ver"], ["p", "p"], ["p", "at"], ["r", "el"], ["r", "on"], ["r", "ow"], ["s", ",ƒ†"], ["s", "e."]]}}