{
 "transformers_version": "5.11.0",
 "architectures": null,
 "output_hidden_states": false,
 "return_dict": true,
 "dtype": null,
 "chunk_size_feed_forward": 0,
 "is_encoder_decoder": false,
 "id2label": {
  "0": "LABEL_0",
  "1": "LABEL_1"
 },
 "label2id": {
  "LABEL_0": 0,
  "LABEL_1": 1
 },
 "problem_type": null,
 "vocab_size": 12,
 "hidden_size": 8,
 "num_hidden_layers": 2,
 "num_attention_heads": 2,
 "window_size": 4,
 "use_bias": true,
 "ffn_dim": 16,
 "layerdrop": 0.1,
 "ffn_kernel_size": 3,
 "flow_size": 8,
 "spectrogram_bins": 513,
 "hidden_act": "relu",
 "hidden_dropout": 0.1,
 "attention_dropout": 0.1,
 "activation_dropout": 0.1,
 "initializer_range": 0.02,
 "layer_norm_eps": 1e-05,
 "use_stochastic_duration_prediction": false,
 "num_speakers": 1,
 "speaker_embedding_size": 0,
 "upsample_initial_channel": 8,
 "upsample_rates": [
  4,
  4
 ],
 "upsample_kernel_sizes": [
  8,
  8
 ],
 "resblock_kernel_sizes": [
  3,
  7
 ],
 "resblock_dilation_sizes": [
  [
   1,
   3
  ],
  [
   1,
   3
  ]
 ],
 "leaky_relu_slope": 0.1,
 "depth_separable_channels": 2,
 "depth_separable_num_layers": 3,
 "duration_predictor_flow_bins": 10,
 "duration_predictor_tail_bound": 5.0,
 "duration_predictor_kernel_size": 3,
 "duration_predictor_dropout": 0.5,
 "duration_predictor_num_flows": 4,
 "duration_predictor_filter_channels": 16,
 "prior_encoder_num_flows": 2,
 "prior_encoder_num_wavenet_layers": 2,
 "posterior_encoder_num_wavenet_layers": 16,
 "wavenet_kernel_size": 5,
 "wavenet_dilation_rate": 1,
 "wavenet_dropout": 0.0,
 "speaking_rate": 1.0,
 "noise_scale": 0.667,
 "noise_scale_duration": 0.8,
 "sampling_rate": 16000,
 "pad_token_id": null,
 "_name_or_path": "",
 "model_type": "vits",
 "output_attentions": false
}