{"version": "1.0", "truncation": null, "padding": null, "added_tokens": [{"id": 0, "content": "<unk>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true}, {"id": 1, "content": "<s>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true}, {"id": 2, "content": "</s>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true}], "normalizer": null, "pre_tokenizer": {"type": "Metaspace", "replacement": "▁", "prepend_scheme": "first", "split": true}, "post_processor": null, "decoder": {"type": "Sequence", "decoders": [{"type": "Metaspace", "replacement": "▁", "prepend_scheme": "first", "split": true}, {"type": "ByteFallback"}, {"type": "Fuse"}]}, "model": {"type": "BPE", "dropout": null, "unk_token": "<unk>", "continuing_subword_prefix": null, "end_of_word_suffix": null, "fuse_unk": true, "byte_fallback": true, "ignore_merges": false, "vocab": {"<unk>": 0, "<s>": 1, "</s>": 2, "<0x00>": 3, "<0x01>": 4, "<0x02>": 5, "<0x03>": 6, "<0x04>": 7, "<0x05>": 8, "<0x06>": 9, "<0x07>": 10, "<0x08>": 11, "<0x09>": 12, "<0x0A>": 13, "<0x0B>": 14, "<0x0C>": 15, "<0x0D>": 16, "<0x0E>": 17, "<0x0F>": 18, "<0x10>": 19, "<0x11>": 20, "<0x12>": 21, "<0x13>": 22, "<0x14>": 23, "<0x15>": 24, "<0x16>": 25, "<0x17>": 26, "<0x18>": 27, "<0x19>": 28, "<0x1A>": 29, "<0x1B>": 30, "<0x1C>": 31, "<0x1D>": 32, "<0x1E>": 33, "<0x1F>": 34, "<0x20>": 35, "<0x21>": 36, "<0x22>": 37, "<0x23>": 38, "<0x24>": 39, "<0x25>": 40, "<0x26>": 41, "<0x27>": 42, "<0x28>": 43, "<0x29>": 44, "<0x2A>": 45, "<0x2B>": 46, "<0x2C>": 47, "<0x2D>": 48, "<0x2E>": 49, "<0x2F>": 50, "<0x30>": 51, "<0x31>": 52, "<0x32>": 53, "<0x33>": 54, "<0x34>": 55, "<0x35>": 56, "<0x36>": 57, "<0x37>": 58, "<0x38>": 59, "<0x39>": 60, "<0x3A>": 61, "<0x3B>": 62, "<0x3C>": 63, "<0x3D>": 64, "<0x3E>": 65, "<0x3F>": 66, "<0x40>": 67, "<0x41>": 68, "<0x42>": 69, "<0x43>": 70, "<0x44>": 71, "<0x45>": 72, "<0x46>": 73, "<0x47>": 74, "<0x48>": 75, "<0x49>": 76, "<0x4A>": 77, "<0x4B>": 78, "<0x4C>": 79, "<0x4D>": 80, "<0x4E>": 81, "<0x4F>": 82, "<0x50>": 83, "<0x51>": 84, "<0x52>": 85, "<0x53>": 86, "<0x54>": 87, "<0x55>": 88, "<0x56>": 89, "<0x57>": 90, "<0x58>": 91, "<0x59>": 92, "<0x5A>": 93, "<0x5B>": 94, "<0x5C>": 95, "<0x5D>": 96, "<0x5E>": 97, "<0x5F>": 98, "<0x60>": 99, "<0x61>": 100, "<0x62>": 101, "<0x63>": 102, "<0x64>": 103, "<0x65>": 104, "<0x66>": 105, "<0x67>": 106, "<0x68>": 107, "<0x69>": 108, "<0x6A>": 109, "<0x6B>": 110, "<0x6C>": 111, "<0x6D>": 112, "<0x6E>": 113, "<0x6F>": 114, "<0x70>": 115, "<0x71>": 116, "<0x72>": 117, "<0x73>": 118, "<0x74>": 119, "<0x75>": 120, "<0x76>": 121, "<0x77>": 122, "<0x78>": 123, "<0x79>": 124, "<0x7A>": 125, "<0x7B>": 126, "<0x7C>": 127, "<0x7D>": 128, "<0x7E>": 129, "<0x7F>": 130, "<0x80>": 131, "<0x81>": 132, "<0x82>": 133, "<0x83>": 134, "<0x84>": 135, "<0x85>": 136, "<0x86>": 137, "<0x87>": 138, "<0x88>": 139, "<0x89>": 140, "<0x8A>": 141, "<0x8B>": 142, "<0x8C>": 143, "<0x8D>": 144, "<0x8E>": 145, "<0x8F>": 146, "<0x90>": 147, "<0x91>": 148, "<0x92>": 149, "<0x93>": 150, "<0x94>": 151, "<0x95>": 152, "<0x96>": 153, "<0x97>": 154, "<0x98>": 155, "<0x99>": 156, "<0x9A>": 157, "<0x9B>": 158, "<0x9C>": 159, "<0x9D>": 160, "<0x9E>": 161, "<0x9F>": 162, "<0xA0>": 163, "<0xA1>": 164, "<0xA2>": 165, "<0xA3>": 166, "<0xA4>": 167, "<0xA5>": 168, "<0xA6>": 169, "<0xA7>": 170, "<0xA8>": 171, "<0xA9>": 172, "<0xAA>": 173, "<0xAB>": 174, "<0xAC>": 175, "<0xAD>": 176, "<0xAE>": 177, "<0xAF>": 178, "<0xB0>": 179, "<0xB1>": 180, "<0xB2>": 181, "<0xB3>": 182, "<0xB4>": 183, "<0xB5>": 184, "<0xB6>": 185, "<0xB7>": 186, "<0xB8>": 187, "<0xB9>": 188, "<0xBA>": 189, "<0xBB>": 190, "<0xBC>": 191, "<0xBD>": 192, "<0xBE>": 193, "<0xBF>": 194, "<0xC0>": 195, "<0xC1>": 196, "<0xC2>": 197, "<0xC3>": 198, "<0xC4>": 199, "<0xC5>": 200, "<0xC6>": 201, "<0xC7>": 202, "<0xC8>": 203, "<0xC9>": 204, "<0xCA>": 205, "<0xCB>": 206, "<0xCC>": 207, "<0xCD>": 208, "<0xCE>": 209, "<0xCF>": 210, "<0xD0>": 211, "<0xD1>": 212, "<0xD2>": 213, "<0xD3>": 214, "<0xD4>": 215, "<0xD5>": 216, "<0xD6>": 217, "<0xD7>": 218, "<0xD8>": 219, "<0xD9>": 220, "<0xDA>": 221, "<0xDB>": 222, "<0xDC>": 223, "<0xDD>": 224, "<0xDE>": 225, "<0xDF>": 226, "<0xE0>": 227, "<0xE1>": 228, "<0xE2>": 229, "<0xE3>": 230, "<0xE4>": 231, "<0xE5>": 232, "<0xE6>": 233, "<0xE7>": 234, "<0xE8>": 235, "<0xE9>": 236, "<0xEA>": 237, "<0xEB>": 238, "<0xEC>": 239, "<0xED>": 240, "<0xEE>": 241, "<0xEF>": 242, "<0xF0>": 243, "<0xF1>": 244, "<0xF2>": 245, "<0xF3>": 246, "<0xF4>": 247, "<0xF5>": 248, "<0xF6>": 249, "<0xF7>": 250, "<0xF8>": 251, "<0xF9>": 252, "<0xFA>": 253, "<0xFB>": 254, "<0xFC>": 255, "<0xFD>": 256, "<0xFE>": 257, "<0xFF>": 258, "!": 259, "'": 260, ",": 261, ".": 262, "0": 263, "1": 264, "2": 265, "3": 266, "4": 267, "5": 268, "6": 269, ";": 270, "?": 271, "A": 272, "D": 273, "H": 274, "I": 275, "P": 276, "S": 277, "T": 278, "a": 279, "b": 280, "c": 281, "d": 282, "e": 283, "f": 284, "g": 285, "h": 286, "i": 287, "j": 288, "k": 289, "l": 290, "m": 291, "n": 292, "o": 293, "p": 294, "q": 295, "r": 296, "s": 297, "t": 298, "u": 299, "v": 300, "w": 301, "x": 302, "y": 303, "z": 304, "▁": 305, "he": 306, "▁t": 307, "▁s": 308, "▁the": 309, "re": 310, "▁a": 311, "at": 312, "on": 313, "▁b": 314, "ll": 315, "ve": 316, "▁c": 317, "▁d": 318, "▁se": 319, "lls": 320, "as": 321, "ck": 322, "nd": 323, "qu": 324, "▁l": 325, "▁n": 326, "▁w": 327, "▁and": 328, "44": 329, "ick": 330, "ju": 331, "og": 332, "or": 333, "ou": 334, "▁m": 335, "▁qu": 336, "▁ju": 337, "hells": 338, "▁be": 339, "▁seas": 340, "33": 341, "af": 342, "e.": 343, "en": 344, "ere": 345, "fo": 346, "hat": 347, "is": 348, "it": 349, "ive": 350, "ly": 351, "mp": 352, "ow": 353, "▁1": 354, "▁2": 355, "▁on": 356, "▁or": 357, "▁to": 358, "▁sat": 359, "ver": 360, "▁dog": 361, "▁sells": 362, "▁li": 363, "▁quick": 364, "▁jump": 365, "▁seashells": 366, "'s": 367, "'t": 368, "02": 369, "2,": 370, "36": 371, "52": 372, "Don": 373, "How": 374, "In": 375, "Pa": 376, "She": 377, "The": 378, "ar": 379, "ay": 380, "az": 381, "aive": 382, "be": 383, "br": 384, "ch": 385, "dere": 386, "ee": 387, "es": 388, "ever": 389, "ear": 390, "ebr": 391, "ff": 392, "five": 393, "gs": 394, "gly": 395, "ho": 396, "hs": 397, "hick": 398, "in": 399, "ion": 400, "ke": 401, "ks": 402, "le": 403, "mbe": 404, "nt": 405, "ot": 406, "ox": 407, "oz": 408, "over": 409, "pp": 410, "pat": 411, "pe.": 412, "rs": 413, "ron": 414, "row": 415, "s,": 416, "ths": 417, "tion": 418, "ure": 419, "umbe": 420, "xin": 421, "you": 422, "zebr": 423, "▁A": 424, "▁he": 425, "▁ve": 426, "▁44": 427, "▁33": 428, "▁fo": 429, "▁hat": 430, "▁is": 431, "▁it": 432, "▁36": 433, "▁52": 434, "▁Don": 435, "▁How": 436, "▁In": 437, "▁Pa": 438, "▁She": 439, "▁The": 440, "▁five": 441, "▁over": 442, "▁pat": 443, "▁you": 444, "▁zebr": 445, "▁that": 446, "▁she": 447, "▁sou": 448, "▁shells": 449, "▁sure": 450, "▁they": 451, "▁there": 452, "re,": 453, "re.": 454, "repe.": 455, "▁are": 456, "▁app": 457, "at.": 458, "onths": 459, "▁by": 460, "▁box": 461, "▁brow": 462, "▁cat": 463, "▁cou": 464, "▁caf": 465, "▁chick": 466, "▁crepe.": 467, "▁daf": 468, "▁day": 469, "▁doz": 470, "quor": 471, "▁log": 472, "▁laz": 473, "▁naive": 474, "▁never": 475, "▁not": 476, "▁numbe": 477, "▁were": 478, "▁wis": 479, "▁wit": 480, "▁wee": 481, "▁my": 482, "▁mat.": 483, "▁months": 484, "▁ques": 485, "▁jugs": 486, "▁be,": 487, "▁befo": 488, "▁seasho": 489, "ens": 490, "▁1,": 491, "▁12": 492, "▁202": 493, "▁22,": 494, "▁ordere": 495, "▁dog.": 496, "▁like": 497, "▁liquor": 498, "▁jump?": 499, "▁jumps": 500, "▁seashells.": 501, "ch;": 502, "ffle": 503, "ks.": 504, "tion.": 505, "xingly": 506, "▁here.": 507, "▁vexingly": 508, "▁4444": 509, "▁333": 510, "▁fox": 511, "▁hatch;": 512, "▁it's": 513, "▁365": 514, "▁Don't": 515, "▁Pack": 516, "▁patron": 517, "▁your": 518, "▁zebras": 519, "▁souffle": 520, "▁surely": 521, "▁appear": 522, "▁brown": 523, "▁count": 524, "▁cafe": 525, "▁chickens": 526, "▁daft": 527, "▁days,": 528, "▁dozen": 529, "▁log.": 530, "▁lazy": 531, "▁numbers": 532, "▁wise.": 533, "▁with": 534, "▁weeks.": 535, "▁question.": 536, "▁jugs!": 537, "▁before": 538, "▁seashore,": 539, "▁2026": 540, "▁ordered": 541}, "merges": [["h", "e"], ["▁", "t"], ["▁", "s"], ["▁t", "he"], ["r", "e"], ["▁", "a"], ["a", "t"], ["o", "n"], ["▁", "b"], ["l", "l"], ["v", "e"], ["▁", "c"], ["▁", "d"], ["▁s", "e"], ["ll", "s"], ["a", "s"], ["c", "k"], ["n", "d"], ["q", "u"], ["▁", "l"], ["▁", "n"], ["▁", "w"], ["▁a", "nd"], ["4", "4"], ["i", "ck"], ["j", "u"], ["o", "g"], ["o", "r"], ["o", "u"], ["▁", "m"], ["▁", "qu"], ["▁", "ju"], ["he", "lls"], ["▁b", "e"], ["▁se", "as"], ["3", "3"], ["a", "f"], ["e", "."], ["e", "n"], ["e", "re"], ["f", "o"], ["h", "at"], ["i", "s"], ["i", "t"], ["i", "ve"], ["l", "y"], ["m", "p"], ["o", "w"], ["▁", "1"], ["▁", "2"], ["▁", "on"], ["▁", "or"], ["▁t", "o"], ["▁s", "at"], ["ve", "r"], ["▁d", "og"], ["▁se", "lls"], ["▁l", "i"], ["▁qu", "ick"], ["▁ju", "mp"], ["▁seas", "hells"], ["'", "s"], ["'", "t"], ["0", "2"], ["2", ","], ["3", "6"], ["5", "2"], ["D", "on"], ["H", "ow"], ["I", "n"], ["P", "a"], ["S", "he"], ["T", "he"], ["a", "r"], ["a", "y"], ["a", "z"], ["a", "ive"], ["b", "e"], ["b", "r"], ["c", "h"], ["d", "ere"], ["e", "e"], ["e", "s"], ["e", "ver"], ["e", "ar"], ["e", "br"], ["f", "f"], ["f", "ive"], ["g", "s"], ["g", "ly"], ["h", "o"], ["h", "s"], ["h", "ick"], ["i", "n"], ["i", "on"], ["k", "e"], ["k", "s"], ["l", "e"], ["m", "be"], ["n", "t"], ["o", "t"], ["o", "x"], ["o", "z"], ["o", "ver"], ["p", "p"], ["p", "at"], ["p", "e."], ["r", "s"], ["r", "on"], ["r", "ow"], ["s", ","], ["t", "hs"], ["t", "ion"], ["u", "re"], ["u", "mbe"], ["x", "in"], ["y", "ou"], ["z", "ebr"], ["▁", "A"], ["▁", "he"], ["▁", "ve"], ["▁", "44"], ["▁", "33"], ["▁", "fo"], ["▁", "hat"], ["▁", "is"], ["▁", "it"], ["▁", "36"], ["▁", "52"], ["▁", "Don"], ["▁", "How"], ["▁", "In"], ["▁", "Pa"], ["▁", "She"], ["▁", "The"], ["▁", "five"], ["▁", "over"], ["▁", "pat"], ["▁", "you"], ["▁", "zebr"], ["▁t", "hat"], ["▁s", "he"], ["▁s", "ou"], ["▁s", "hells"], ["▁s", "ure"], ["▁the", "y"], ["▁the", "re"], ["re", ","], ["re", "."], ["re", "pe."], ["▁a", "re"], ["▁a", "pp"], ["at", "."], ["on", "ths"], ["▁b", "y"], ["▁b", "ox"], ["▁b", "row"], ["▁c", "at"], ["▁c", "ou"], ["▁c", "af"], ["▁c", "hick"], ["▁c", "repe."], ["▁d", "af"], ["▁d", "ay"], ["▁d", "oz"], ["qu", "or"], ["▁l", "og"], ["▁l", "az"], ["▁n", "aive"], ["▁n", "ever"], ["▁n", "ot"], ["▁n", "umbe"], ["▁w", "ere"], ["▁w", "is"], ["▁w", "it"], ["▁w", "ee"], ["▁m", "y"], ["▁m", "at."], ["▁m", "onths"], ["▁qu", "es"], ["▁ju", "gs"], ["▁be", ","], ["▁be", "fo"], ["▁seas", "ho"], ["en", "s"], ["▁1", ","], ["▁1", "2"], ["▁2", "02"], ["▁2", "2,"], ["▁or", "dere"], ["▁dog", "."], ["▁li", "ke"], ["▁li", "quor"], ["▁jump", "?"], ["▁jump", "s"], ["▁seashells", "."], ["ch", ";"], ["ff", "le"], ["ks", "."], ["tion", "."], ["xin", "gly"], ["▁he", "re."], ["▁ve", "xingly"], ["▁44", "44"], ["▁33", "3"], ["▁fo", "x"], ["▁hat", "ch;"], ["▁it", "'s"], ["▁36", "5"], ["▁Don", "'t"], ["▁Pa", "ck"], ["▁pat", "ron"], ["▁you", "r"], ["▁zebr", "as"], ["▁sou", "ffle"], ["▁sure", "ly"], ["▁app", "ear"], ["▁brow", "n"], ["▁cou", "nt"], ["▁caf", "e"], ["▁chick", "ens"], ["▁daf", "t"], ["▁day", "s,"], ["▁doz", "en"], ["▁log", "."], ["▁laz", "y"], ["▁numbe", "rs"], ["▁wis", "e."], ["▁wit", "h"], ["▁wee", "ks."], ["▁ques", "tion."], ["▁jugs", "!"], ["▁befo", "re"], ["▁seasho", "re,"], ["▁202", "6"], ["▁ordere", "d"]]}}