{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|im_end|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "Regex": "(?i:'s|'t|'re|'ve|'m|'ll|'d)|[^\\r\\n\\p{L}\\p{N}]?\\p{L}+|\\p{N}| ?[^\\s\\p{L}\\p{N}]+[\\r\\n]*|\\s*[\\r\\n]+|\\s+(?!\\S)|\\s+"
        },
        "behavior": "Isolated",
        "invert": false
      },
      {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": false
      }
    ]
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "<|im_end|>": 1,
      "!": 2,
      "\"": 3,
      "#": 4,
      "$": 5,
      "%": 6,
      "&": 7,
      "'": 8,
      "(": 9,
      ")": 10,
      "*": 11,
      "+": 12,
      ",": 13,
      "-": 14,
      ".": 15,
      "/": 16,
      "0": 17,
      "1": 18,
      "2": 19,
      "3": 20,
      "4": 21,
      "5": 22,
      "6": 23,
      "7": 24,
      "8": 25,
      "9": 26,
      ":": 27,
      ";": 28,
      "<": 29,
      "=": 30,
      ">": 31,
      "?": 32,
      "@": 33,
      "A": 34,
      "B": 35,
      "C": 36,
      "D": 37,
      "E": 38,
      "F": 39,
      "G": 40,
      "H": 41,
      "I": 42,
      "J": 43,
      "K": 44,
      "L": 45,
      "M": 46,
      "N": 47,
      "O": 48,
      "P": 49,
      "Q": 50,
      "R": 51,
      "S": 52,
      "T": 53,
      "U": 54,
      "V": 55,
      "W": 56,
      "X": 57,
      "Y": 58,
      "Z": 59,
      "[": 60,
      "\\": 61,
      "]": 62,
      "^": 63,
      "_": 64,
      "`": 65,
      "a": 66,
      "b": 67,
      "c": 68,
      "d": 69,
      "e": 70,
      "f": 71,
      "g": 72,
      "h": 73,
      "i": 74,
      "j": 75,
      "k": 76,
      "l": 77,
      "m": 78,
      "n": 79,
      "o": 80,
      "p": 81,
      "q": 82,
      "r": 83,
      "s": 84,
      "t": 85,
      "u": 86,
      "v": 87,
      "w": 88,
      "x": 89,
      "y": 90,
      "z": 91,
      "{": 92,
      "|": 93,
      "}": 94,
      "~": 95,
      "ТЁ": 96,
      "ТЂ": 97,
      "ТЃ": 98,
      "ТЄ": 99,
      "ТЅ": 100,
      "ТІ": 101,
      "ТЇ": 102,
      "ТЈ": 103,
      "ТЉ": 104,
      "ТЊ": 105,
      "ТЋ": 106,
      "ТЌ": 107,
      "ТЎ": 108,
      "ТЏ": 109,
      "ТА": 110,
      "ТБ": 111,
      "ТВ": 112,
      "ТГ": 113,
      "ТД": 114,
      "ТЕ": 115,
      "ТЖ": 116,
      "ТЗ": 117,
      "ТИ": 118,
      "ТЙ": 119,
      "ТК": 120,
      "ТЛ": 121,
      "ТМ": 122,
      "ТН": 123,
      "ТО": 124,
      "ТП": 125,
      "У": 126,
      "У": 127,
      "У": 128,
      "У": 129,
      "У": 130,
      "У": 131,
      "У": 132,
      "У": 133,
      "У": 134,
      "У": 135,
      "У": 136,
      "У": 137,
      "У": 138,
      "У": 139,
      "У": 140,
      "У": 141,
      "У": 142,
      "У": 143,
      "У": 144,
      "У": 145,
      "У": 146,
      "У": 147,
      "У": 148,
      "У": 149,
      "У": 150,
      "У": 151,
      "У": 152,
      "У": 153,
      "У": 154,
      "У": 155,
      "У": 156,
      "У": 157,
      "У ": 158,
      "УЁ": 159,
      "УЂ": 160,
      "УЃ": 161,
      "УЄ": 162,
      "УЅ": 163,
      "УІ": 164,
      "УЇ": 165,
      "УЈ": 166,
      "УЉ": 167,
      "УЊ": 168,
      "УЋ": 169,
      "УЌ": 170,
      "У­": 171,
      "УЎ": 172,
      "УЏ": 173,
      "УА": 174,
      "УБ": 175,
      "УВ": 176,
      "УГ": 177,
      "УД": 178,
      "УЕ": 179,
      "УЖ": 180,
      "УЗ": 181,
      "УИ": 182,
      "УЙ": 183,
      "УК": 184,
      "УЛ": 185,
      "УМ": 186,
      "УН": 187,
      "УО": 188,
      "УП": 189,
      "Ф": 190,
      "Ф": 191,
      "Ф": 192,
      "Ф": 193,
      "Ф": 194,
      "Ф": 195,
      "Ф": 196,
      "Ф": 197,
      "Ф": 198,
      "Ф": 199,
      "Ф": 200,
      "Ф": 201,
      "Ф": 202,
      "Ф": 203,
      "Ф": 204,
      "Ф": 205,
      "Ф": 206,
      "Ф": 207,
      "Ф": 208,
      "Ф": 209,
      "Ф": 210,
      "Ф": 211,
      "Ф": 212,
      "Ф": 213,
      "Ф": 214,
      "Ф": 215,
      "Ф": 216,
      "Ф": 217,
      "Ф": 218,
      "Ф": 219,
      "Ф": 220,
      "Ф": 221,
      "Ф ": 222,
      "ФЁ": 223,
      "ФЂ": 224,
      "ФЃ": 225,
      "ФЄ": 226,
      "ФЅ": 227,
      "ФІ": 228,
      "ФЇ": 229,
      "ФЈ": 230,
      "ФЉ": 231,
      "ФЊ": 232,
      "ФЋ": 233,
      "ФЌ": 234,
      "Ф­": 235,
      "ФЎ": 236,
      "ФЏ": 237,
      "ФА": 238,
      "ФБ": 239,
      "ФВ": 240,
      "ФГ": 241,
      "ФД": 242,
      "ФЕ": 243,
      "ФЖ": 244,
      "ФЗ": 245,
      "ФИ": 246,
      "ФЙ": 247,
      "ФК": 248,
      "ФЛ": 249,
      "ФМ": 250,
      "ФН": 251,
      "ФО": 252,
      "ФП": 253,
      "Х": 254,
      "Х": 255,
      "Х": 256,
      "Х": 257,
      "he": 258,
      "Ф s": 259,
      "Ф t": 260,
      "re": 261,
      "Ф the": 262,
      "Ф a": 263,
      "at": 264,
      "on": 265,
      "Ф b": 266,
      "ll": 267,
      "ve": 268,
      "Ф c": 269,
      "Ф d": 270,
      "Ф se": 271,
      "lls": 272,
      "as": 273,
      "ck": 274,
      "nd": 275,
      "qu": 276,
      "Ф l": 277,
      "Ф w": 278,
      "Ф and": 279,
      "ick": 280,
      "ju": 281,
      "og": 282,
      "or": 283,
      "ou": 284,
      "Ф m": 285,
      "Ф n": 286,
      "Ф qu": 287,
      "Ф ju": 288,
      "hells": 289,
      "Ф be": 290,
      "Ф seas": 291,
      "af": 292,
      "en": 293,
      "ere": 294,
      "fo": 295,
      "hat": 296,
      "is": 297,
      "it": 298,
      "ive": 299,
      "ly": 300,
      "mp": 301,
      "ow": 302,
      "pe": 303,
      "Ф on": 304,
      "Ф or": 305,
      "Ф sat": 306,
      "ver": 307,
      "Ф dog": 308,
      "Ф sells": 309,
      "Ф li": 310,
      "Ф quick": 311,
      "Ф jump": 312,
      "Ф seashells": 313,
      "'s": 314,
      "'t": 315,
      "Don": 316,
      "How": 317,
      "In": 318,
      "Pa": 319,
      "She": 320,
      "The": 321,
      "ar": 322,
      "ay": 323,
      "az": 324,
      "aive": 325,
      "be": 326,
      "br": 327,
      "ch": 328,
      "dere": 329,
      "ee": 330,
      "es": 331,
      "ever": 332,
      "ebr": 333,
      "ff": 334,
      "five": 335,
      "gs": 336,
      "gly": 337,
      "ho": 338,
      "hs": 339,
      "hick": 340,
      "in": 341,
      "ion": 342,
      "ke": 343,
      "ks": 344,
      "le": 345,
      "mbe": 346,
      "nt": 347,
      "nu": 348,
      "ot": 349,
      "ox": 350,
      "oz": 351,
      "over": 352,
      "pat": 353,
      "ppe": 354,
      "rs": 355,
      "ron": 356,
      "row": 357,
      "to": 358,
      "the": 359,
      "ths": 360,
      "tion": 361,
      "ure": 362,
      "xin": 363,
      "you": 364,
      "zebr": 365,
      "Ф he": 366,
      "Ф ve": 367,
      "Ф fo": 368,
      "Ф hat": 369,
      "Ф is": 370,
      "Ф it": 371,
      "Ф five": 372,
      "Ф over": 373,
      "Ф pat": 374,
      "Ф you": 375,
      "Ф zebr": 376,
      "Ф she": 377,
      "Ф sou": 378,
      "Ф shells": 379,
      "Ф sure": 380,
      "Ф to": 381,
      "Ф that": 382,
      "repe": 383,
      "Ф they": 384,
      "Ф there": 385,
      "Ф are": 386,
      "Ф appe": 387,
      "onths": 388,
      "Ф by": 389,
      "Ф box": 390,
      "Ф brow": 391,
      "Ф cat": 392,
      "Ф cou": 393,
      "Ф caf": 394,
      "Ф chick": 395,
      "Ф crepe": 396,
      "Ф daf": 397,
      "Ф day": 398,
      "Ф doz": 399
    },
    "merges": [
      [
        "h",
        "e"
      ],
      [
        "Ф ",
        "s"
      ],
      [
        "Ф ",
        "t"
      ],
      [
        "r",
        "e"
      ],
      [
        "Ф t",
        "he"
      ],
      [
        "Ф ",
        "a"
      ],
      [
        "a",
        "t"
      ],
      [
        "o",
        "n"
      ],
      [
        "Ф ",
        "b"
      ],
      [
        "l",
        "l"
      ],
      [
        "v",
        "e"
      ],
      [
        "Ф ",
        "c"
      ],
      [
        "Ф ",
        "d"
      ],
      [
        "Ф s",
        "e"
      ],
      [
        "ll",
        "s"
      ],
      [
        "a",
        "s"
      ],
      [
        "c",
        "k"
      ],
      [
        "n",
        "d"
      ],
      [
        "q",
        "u"
      ],
      [
        "Ф ",
        "l"
      ],
      [
        "Ф ",
        "w"
      ],
      [
        "Ф a",
        "nd"
      ],
      [
        "i",
        "ck"
      ],
      [
        "j",
        "u"
      ],
      [
        "o",
        "g"
      ],
      [
        "o",
        "r"
      ],
      [
        "o",
        "u"
      ],
      [
        "Ф ",
        "m"
      ],
      [
        "Ф ",
        "n"
      ],
      [
        "Ф ",
        "qu"
      ],
      [
        "Ф ",
        "ju"
      ],
      [
        "he",
        "lls"
      ],
      [
        "Ф b",
        "e"
      ],
      [
        "Ф se",
        "as"
      ],
      [
        "a",
        "f"
      ],
      [
        "e",
        "n"
      ],
      [
        "e",
        "re"
      ],
      [
        "f",
        "o"
      ],
      [
        "h",
        "at"
      ],
      [
        "i",
        "s"
      ],
      [
        "i",
        "t"
      ],
      [
        "i",
        "ve"
      ],
      [
        "l",
        "y"
      ],
      [
        "m",
        "p"
      ],
      [
        "o",
        "w"
      ],
      [
        "p",
        "e"
      ],
      [
        "Ф ",
        "on"
      ],
      [
        "Ф ",
        "or"
      ],
      [
        "Ф s",
        "at"
      ],
      [
        "ve",
        "r"
      ],
      [
        "Ф d",
        "og"
      ],
      [
        "Ф se",
        "lls"
      ],
      [
        "Ф l",
        "i"
      ],
      [
        "Ф qu",
        "ick"
      ],
      [
        "Ф ju",
        "mp"
      ],
      [
        "Ф seas",
        "hells"
      ],
      [
        "'",
        "s"
      ],
      [
        "'",
        "t"
      ],
      [
        "D",
        "on"
      ],
      [
        "H",
        "ow"
      ],
      [
        "I",
        "n"
      ],
      [
        "P",
        "a"
      ],
      [
        "S",
        "he"
      ],
      [
        "T",
        "he"
      ],
      [
        "a",
        "r"
      ],
      [
        "a",
        "y"
      ],
      [
        "a",
        "z"
      ],
      [
        "a",
        "ive"
      ],
      [
        "b",
        "e"
      ],
      [
        "b",
        "r"
      ],
      [
        "c",
        "h"
      ],
      [
        "d",
        "ere"
      ],
      [
        "e",
        "e"
      ],
      [
        "e",
        "s"
      ],
      [
        "e",
        "ver"
      ],
      [
        "e",
        "br"
      ],
      [
        "f",
        "f"
      ],
      [
        "f",
        "ive"
      ],
      [
        "g",
        "s"
      ],
      [
        "g",
        "ly"
      ],
      [
        "h",
        "o"
      ],
      [
        "h",
        "s"
      ],
      [
        "h",
        "ick"
      ],
      [
        "i",
        "n"
      ],
      [
        "i",
        "on"
      ],
      [
        "k",
        "e"
      ],
      [
        "k",
        "s"
      ],
      [
        "l",
        "e"
      ],
      [
        "m",
        "be"
      ],
      [
        "n",
        "t"
      ],
      [
        "n",
        "u"
      ],
      [
        "o",
        "t"
      ],
      [
        "o",
        "x"
      ],
      [
        "o",
        "z"
      ],
      [
        "o",
        "ver"
      ],
      [
        "p",
        "at"
      ],
      [
        "p",
        "pe"
      ],
      [
        "r",
        "s"
      ],
      [
        "r",
        "on"
      ],
      [
        "r",
        "ow"
      ],
      [
        "t",
        "o"
      ],
      [
        "t",
        "he"
      ],
      [
        "t",
        "hs"
      ],
      [
        "t",
        "ion"
      ],
      [
        "u",
        "re"
      ],
      [
        "x",
        "in"
      ],
      [
        "y",
        "ou"
      ],
      [
        "z",
        "ebr"
      ],
      [
        "Ф ",
        "he"
      ],
      [
        "Ф ",
        "ve"
      ],
      [
        "Ф ",
        "fo"
      ],
      [
        "Ф ",
        "hat"
      ],
      [
        "Ф ",
        "is"
      ],
      [
        "Ф ",
        "it"
      ],
      [
        "Ф ",
        "five"
      ],
      [
        "Ф ",
        "over"
      ],
      [
        "Ф ",
        "pat"
      ],
      [
        "Ф ",
        "you"
      ],
      [
        "Ф ",
        "zebr"
      ],
      [
        "Ф s",
        "he"
      ],
      [
        "Ф s",
        "ou"
      ],
      [
        "Ф s",
        "hells"
      ],
      [
        "Ф s",
        "ure"
      ],
      [
        "Ф t",
        "o"
      ],
      [
        "Ф t",
        "hat"
      ],
      [
        "re",
        "pe"
      ],
      [
        "Ф the",
        "y"
      ],
      [
        "Ф the",
        "re"
      ],
      [
        "Ф a",
        "re"
      ],
      [
        "Ф a",
        "ppe"
      ],
      [
        "on",
        "ths"
      ],
      [
        "Ф b",
        "y"
      ],
      [
        "Ф b",
        "ox"
      ],
      [
        "Ф b",
        "row"
      ],
      [
        "Ф c",
        "at"
      ],
      [
        "Ф c",
        "ou"
      ],
      [
        "Ф c",
        "af"
      ],
      [
        "Ф c",
        "hick"
      ],
      [
        "Ф c",
        "repe"
      ],
      [
        "Ф d",
        "af"
      ],
      [
        "Ф d",
        "ay"
      ],
      [
        "Ф d",
        "oz"
      ]
    ]
  }
}