{
 "architectures": [
  "OlmoeForCausalLM"
 ],
 "model_type": "olmoe",
 "hidden_size": 8,
 "intermediate_size": 5,
 "num_hidden_layers": 2,
 "num_attention_heads": 2,
 "num_key_value_heads": 1,
 "vocab_size": 13,
 "max_position_embeddings": 16,
 "rms_norm_eps": 1e-05,
 "rope_theta": 10000.0,
 "attention_bias": false,
 "clip_qkv": null,
 "tie_word_embeddings": false,
 "hidden_act": "silu",
 "num_experts": 4,
 "num_experts_per_tok": 2,
 "norm_topk_prob": true,
 "eos_token_id": 2,
 "bos_token_id": 1,
 "pad_token_id": 0
}