{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": true
      }
    ]
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "ВЎ": 95,
      "Вў": 96,
      "ВЈ": 97,
      "ВӨ": 98,
      "ВҘ": 99,
      "ВҰ": 100,
      "В§": 101,
      "ВЁ": 102,
      "В©": 103,
      "ВӘ": 104,
      "В«": 105,
      "В¬": 106,
      "В®": 107,
      "ВҜ": 108,
      "В°": 109,
      "Вұ": 110,
      "ВІ": 111,
      "Ві": 112,
      "Вҙ": 113,
      "Вө": 114,
      "В¶": 115,
      "В·": 116,
      "Вё": 117,
      "В№": 118,
      "Вә": 119,
      "В»": 120,
      "Вј": 121,
      "ВҪ": 122,
      "Вҫ": 123,
      "Вҝ": 124,
      "ГҖ": 125,
      "ГҒ": 126,
      "ГӮ": 127,
      "Гғ": 128,
      "Г„": 129,
      "Г…": 130,
      "ГҶ": 131,
      "ГҮ": 132,
      "ГҲ": 133,
      "Гү": 134,
      "ГҠ": 135,
      "ГӢ": 136,
      "ГҢ": 137,
      "ГҚ": 138,
      "ГҺ": 139,
      "ГҸ": 140,
      "Гҗ": 141,
      "Г‘": 142,
      "Г’": 143,
      "Г“": 144,
      "Г”": 145,
      "Г•": 146,
      "Г–": 147,
      "Г—": 148,
      "Гҳ": 149,
      "Гҷ": 150,
      "Гҡ": 151,
      "Гӣ": 152,
      "Гң": 153,
      "Гқ": 154,
      "Гһ": 155,
      "Гҹ": 156,
      "Г ": 157,
      "ГЎ": 158,
      "Гў": 159,
      "ГЈ": 160,
      "ГӨ": 161,
      "ГҘ": 162,
      "ГҰ": 163,
      "Г§": 164,
      "ГЁ": 165,
      "Г©": 166,
      "ГӘ": 167,
      "Г«": 168,
      "Г¬": 169,
      "Гӯ": 170,
      "Г®": 171,
      "ГҜ": 172,
      "Г°": 173,
      "Гұ": 174,
      "ГІ": 175,
      "Гі": 176,
      "Гҙ": 177,
      "Гө": 178,
      "Г¶": 179,
      "Г·": 180,
      "Гё": 181,
      "Г№": 182,
      "Гә": 183,
      "Г»": 184,
      "Гј": 185,
      "ГҪ": 186,
      "Гҫ": 187,
      "Гҝ": 188,
      "ДҖ": 189,
      "ДҒ": 190,
      "ДӮ": 191,
      "Дғ": 192,
      "Д„": 193,
      "Д…": 194,
      "ДҶ": 195,
      "ДҮ": 196,
      "ДҲ": 197,
      "Дү": 198,
      "ДҠ": 199,
      "ДӢ": 200,
      "ДҢ": 201,
      "ДҚ": 202,
      "ДҺ": 203,
      "ДҸ": 204,
      "Дҗ": 205,
      "Д‘": 206,
      "Д’": 207,
      "Д“": 208,
      "Д”": 209,
      "Д•": 210,
      "Д–": 211,
      "Д—": 212,
      "Дҳ": 213,
      "Дҷ": 214,
      "Дҡ": 215,
      "Дӣ": 216,
      "Дң": 217,
      "Дқ": 218,
      "Дһ": 219,
      "Дҹ": 220,
      "Д ": 221,
      "ДЎ": 222,
      "Дў": 223,
      "ДЈ": 224,
      "ДӨ": 225,
      "ДҘ": 226,
      "ДҰ": 227,
      "Д§": 228,
      "ДЁ": 229,
      "Д©": 230,
      "ДӘ": 231,
      "Д«": 232,
      "Д¬": 233,
      "Дӯ": 234,
      "Д®": 235,
      "ДҜ": 236,
      "Д°": 237,
      "Дұ": 238,
      "ДІ": 239,
      "Ді": 240,
      "Дҙ": 241,
      "Дө": 242,
      "Д¶": 243,
      "Д·": 244,
      "Дё": 245,
      "Д№": 246,
      "Дә": 247,
      "Д»": 248,
      "Дј": 249,
      "ДҪ": 250,
      "Дҫ": 251,
      "Дҝ": 252,
      "ЕҖ": 253,
      "ЕҒ": 254,
      "ЕӮ": 255,
      "Еғ": 256,
      "he": 257,
      "Д s": 258,
      "Д t": 259,
      "re": 260,
      "Д the": 261,
      "Д a": 262,
      "at": 263,
      "on": 264,
      "Д b": 265,
      "ll": 266,
      "ve": 267,
      "Д c": 268,
      "Д d": 269,
      "Д se": 270,
      "lls": 271,
      "as": 272,
      "ck": 273,
      "nd": 274,
      "qu": 275,
      "Д l": 276,
      "Д w": 277,
      "Д and": 278,
      "ick": 279,
      "ju": 280,
      "og": 281,
      "or": 282,
      "ou": 283,
      "Д m": 284,
      "Д n": 285,
      "Д qu": 286,
      "Д ju": 287,
      "hells": 288,
      "Д be": 289,
      "Д seas": 290,
      "af": 291,
      "en": 292,
      "ere": 293,
      "fo": 294,
      "hat": 295,
      "is": 296,
      "it": 297,
      "ive": 298,
      "ly": 299,
      "mp": 300,
      "ow": 301,
      "pe": 302,
      "Д on": 303,
      "Д or": 304,
      "Д sat": 305,
      "ver": 306,
      "Д dog": 307,
      "Д sells": 308,
      "Д li": 309,
      "Д quick": 310,
      "Д jump": 311,
      "Д seashells": 312,
      "'s": 313,
      "'t": 314,
      "Don": 315,
      "How": 316,
      "In": 317,
      "Pa": 318,
      "She": 319,
      "The": 320,
      "ar": 321,
      "ay": 322,
      "az": 323,
      "aive": 324,
      "be": 325,
      "br": 326,
      "ch": 327,
      "dere": 328,
      "ee": 329,
      "es": 330,
      "ever": 331,
      "ebr": 332,
      "ff": 333,
      "five": 334,
      "gs": 335,
      "gly": 336,
      "ho": 337,
      "hs": 338,
      "hick": 339,
      "in": 340,
      "ion": 341,
      "ke": 342,
      "ks": 343,
      "le": 344,
      "mbe": 345,
      "nt": 346,
      "nu": 347,
      "ot": 348,
      "ox": 349,
      "oz": 350,
      "over": 351,
      "pat": 352,
      "ppe": 353,
      "rs": 354,
      "ron": 355,
      "row": 356,
      "to": 357,
      "the": 358,
      "ths": 359,
      "tion": 360,
      "ure": 361,
      "xin": 362,
      "you": 363,
      "zebr": 364,
      "Д he": 365,
      "Д ve": 366,
      "Д fo": 367,
      "Д hat": 368,
      "Д is": 369,
      "Д it": 370,
      "Д five": 371,
      "Д over": 372,
      "Д pat": 373,
      "Д you": 374,
      "Д zebr": 375,
      "Д she": 376,
      "Д sou": 377,
      "Д shells": 378,
      "Д sure": 379,
      "Д to": 380,
      "Д that": 381,
      "repe": 382,
      "Д they": 383,
      "Д there": 384,
      "Д are": 385,
      "Д appe": 386,
      "onths": 387,
      "Д by": 388,
      "Д box": 389,
      "Д brow": 390,
      "Д cat": 391,
      "Д cou": 392,
      "Д caf": 393,
      "Д chick": 394,
      "Д crepe": 395,
      "Д daf": 396,
      "Д day": 397,
      "Д doz": 398,
      "quor": 399
    },
    "merges": [
      [
        "h",
        "e"
      ],
      [
        "Д ",
        "s"
      ],
      [
        "Д ",
        "t"
      ],
      [
        "r",
        "e"
      ],
      [
        "Д t",
        "he"
      ],
      [
        "Д ",
        "a"
      ],
      [
        "a",
        "t"
      ],
      [
        "o",
        "n"
      ],
      [
        "Д ",
        "b"
      ],
      [
        "l",
        "l"
      ],
      [
        "v",
        "e"
      ],
      [
        "Д ",
        "c"
      ],
      [
        "Д ",
        "d"
      ],
      [
        "Д s",
        "e"
      ],
      [
        "ll",
        "s"
      ],
      [
        "a",
        "s"
      ],
      [
        "c",
        "k"
      ],
      [
        "n",
        "d"
      ],
      [
        "q",
        "u"
      ],
      [
        "Д ",
        "l"
      ],
      [
        "Д ",
        "w"
      ],
      [
        "Д a",
        "nd"
      ],
      [
        "i",
        "ck"
      ],
      [
        "j",
        "u"
      ],
      [
        "o",
        "g"
      ],
      [
        "o",
        "r"
      ],
      [
        "o",
        "u"
      ],
      [
        "Д ",
        "m"
      ],
      [
        "Д ",
        "n"
      ],
      [
        "Д ",
        "qu"
      ],
      [
        "Д ",
        "ju"
      ],
      [
        "he",
        "lls"
      ],
      [
        "Д b",
        "e"
      ],
      [
        "Д se",
        "as"
      ],
      [
        "a",
        "f"
      ],
      [
        "e",
        "n"
      ],
      [
        "e",
        "re"
      ],
      [
        "f",
        "o"
      ],
      [
        "h",
        "at"
      ],
      [
        "i",
        "s"
      ],
      [
        "i",
        "t"
      ],
      [
        "i",
        "ve"
      ],
      [
        "l",
        "y"
      ],
      [
        "m",
        "p"
      ],
      [
        "o",
        "w"
      ],
      [
        "p",
        "e"
      ],
      [
        "Д ",
        "on"
      ],
      [
        "Д ",
        "or"
      ],
      [
        "Д s",
        "at"
      ],
      [
        "ve",
        "r"
      ],
      [
        "Д d",
        "og"
      ],
      [
        "Д se",
        "lls"
      ],
      [
        "Д l",
        "i"
      ],
      [
        "Д qu",
        "ick"
      ],
      [
        "Д ju",
        "mp"
      ],
      [
        "Д seas",
        "hells"
      ],
      [
        "'",
        "s"
      ],
      [
        "'",
        "t"
      ],
      [
        "D",
        "on"
      ],
      [
        "H",
        "ow"
      ],
      [
        "I",
        "n"
      ],
      [
        "P",
        "a"
      ],
      [
        "S",
        "he"
      ],
      [
        "T",
        "he"
      ],
      [
        "a",
        "r"
      ],
      [
        "a",
        "y"
      ],
      [
        "a",
        "z"
      ],
      [
        "a",
        "ive"
      ],
      [
        "b",
        "e"
      ],
      [
        "b",
        "r"
      ],
      [
        "c",
        "h"
      ],
      [
        "d",
        "ere"
      ],
      [
        "e",
        "e"
      ],
      [
        "e",
        "s"
      ],
      [
        "e",
        "ver"
      ],
      [
        "e",
        "br"
      ],
      [
        "f",
        "f"
      ],
      [
        "f",
        "ive"
      ],
      [
        "g",
        "s"
      ],
      [
        "g",
        "ly"
      ],
      [
        "h",
        "o"
      ],
      [
        "h",
        "s"
      ],
      [
        "h",
        "ick"
      ],
      [
        "i",
        "n"
      ],
      [
        "i",
        "on"
      ],
      [
        "k",
        "e"
      ],
      [
        "k",
        "s"
      ],
      [
        "l",
        "e"
      ],
      [
        "m",
        "be"
      ],
      [
        "n",
        "t"
      ],
      [
        "n",
        "u"
      ],
      [
        "o",
        "t"
      ],
      [
        "o",
        "x"
      ],
      [
        "o",
        "z"
      ],
      [
        "o",
        "ver"
      ],
      [
        "p",
        "at"
      ],
      [
        "p",
        "pe"
      ],
      [
        "r",
        "s"
      ],
      [
        "r",
        "on"
      ],
      [
        "r",
        "ow"
      ],
      [
        "t",
        "o"
      ],
      [
        "t",
        "he"
      ],
      [
        "t",
        "hs"
      ],
      [
        "t",
        "ion"
      ],
      [
        "u",
        "re"
      ],
      [
        "x",
        "in"
      ],
      [
        "y",
        "ou"
      ],
      [
        "z",
        "ebr"
      ],
      [
        "Д ",
        "he"
      ],
      [
        "Д ",
        "ve"
      ],
      [
        "Д ",
        "fo"
      ],
      [
        "Д ",
        "hat"
      ],
      [
        "Д ",
        "is"
      ],
      [
        "Д ",
        "it"
      ],
      [
        "Д ",
        "five"
      ],
      [
        "Д ",
        "over"
      ],
      [
        "Д ",
        "pat"
      ],
      [
        "Д ",
        "you"
      ],
      [
        "Д ",
        "zebr"
      ],
      [
        "Д s",
        "he"
      ],
      [
        "Д s",
        "ou"
      ],
      [
        "Д s",
        "hells"
      ],
      [
        "Д s",
        "ure"
      ],
      [
        "Д t",
        "o"
      ],
      [
        "Д t",
        "hat"
      ],
      [
        "re",
        "pe"
      ],
      [
        "Д the",
        "y"
      ],
      [
        "Д the",
        "re"
      ],
      [
        "Д a",
        "re"
      ],
      [
        "Д a",
        "ppe"
      ],
      [
        "on",
        "ths"
      ],
      [
        "Д b",
        "y"
      ],
      [
        "Д b",
        "ox"
      ],
      [
        "Д b",
        "row"
      ],
      [
        "Д c",
        "at"
      ],
      [
        "Д c",
        "ou"
      ],
      [
        "Д c",
        "af"
      ],
      [
        "Д c",
        "hick"
      ],
      [
        "Д c",
        "repe"
      ],
      [
        "Д d",
        "af"
      ],
      [
        "Д d",
        "ay"
      ],
      [
        "Д d",
        "oz"
      ],
      [
        "qu",
        "or"
      ]
    ]
  }
}