{
 "architectures": [
  "OPTForCausalLM"
 ],
 "model_type": "opt",
 "hidden_size": 16,
 "word_embed_proj_dim": 12,
 "ffn_dim": 24,
 "num_hidden_layers": 2,
 "num_attention_heads": 2,
 "vocab_size": 11,
 "max_position_embeddings": 16,
 "layer_norm_elementwise_affine": true,
 "do_layer_norm_before": false,
 "enable_bias": true,
 "_remove_final_layer_norm": false,
 "activation_function": "relu",
 "dropout": 0.0,
 "attention_dropout": 0.0,
 "layerdrop": 0.0,
 "pad_token_id": 1,
 "bos_token_id": 2,
 "eos_token_id": 2,
 "tie_word_embeddings": true
}