{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "post_processor": null,
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "model": {
    "type": "Unigram",
    "unk_id": 0,
    "vocab": [
      [
        "<unk>",
        0.0
      ],
      [
        "<s>",
        0.0
      ],
      [
        "</s>",
        0.0
      ],
      [
        "▁",
        -1.818785301671209
      ],
      [
        "n",
        -2.5339813286449653
      ],
      [
        "▁the",
        -2.630396267030938
      ],
      [
        "g",
        -2.7175125791001395
      ],
      [
        "at",
        -2.787841776253579
      ],
      [
        "o",
        -2.8809706589877697
      ],
      [
        "in",
        -3.1258588754298926
      ],
      [
        "a",
        -3.16208567884894
      ],
      [
        "t",
        -3.292563127251311
      ],
      [
        "▁s",
        -3.5646660181090883
      ],
      [
        "▁c",
        -3.632525031473828
      ],
      [
        "i",
        -3.9269904409620944
      ],
      [
        "r",
        -3.9395999333749296
      ],
      [
        "ati",
        -4.087797116374782
      ],
      [
        "d",
        -4.08919349928393
      ],
      [
        "mat",
        -4.126874147834687
      ],
      [
        "e",
        -4.127808182929984
      ],
      [
        "▁a",
        -4.264987332518306
      ],
      [
        "s",
        -4.285506010725929
      ],
      [
        "nd",
        -4.299066148580138
      ],
      [
        "l",
        -4.486987641599207
      ],
      [
        "▁ra",
        -4.487659852412495
      ],
      [
        "re",
        -4.732372185602119
      ],
      [
        "eati",
        -4.808918694773192
      ],
      [
        "c",
        -4.85371697720717
      ],
      [
        "m",
        -4.904997877515347
      ],
      [
        "w",
        -4.914007843632029
      ],
      [
        "p",
        -4.9140078436320325
      ],
      [
        "he",
        -4.956518367714269
      ],
      [
        "fo",
        -5.0236361156052896
      ],
      [
        "ee",
        -5.053374191292384
      ],
      [
        "▁m",
        -5.065469797372553
      ],
      [
        "un",
        -5.188627576407983
      ],
      [
        "rea",
        -5.248615883214862
      ],
      [
        "u",
        -5.259694706941827
      ],
      [
        "it",
        -5.299126960333146
      ],
      [
        "▁re",
        -5.453948243368552
      ],
      [
        "ti",
        -5.524788434759541
      ],
      [
        "▁r",
        -5.600328084797816
      ],
      [
        "v",
        -5.673531653155846
      ],
      [
        "j",
        -5.673531653195799
      ],
      [
        "b",
        -5.673531653195799
      ],
      [
        "y",
        -5.673531653195799
      ],
      [
        "▁f",
        -5.690923303270973
      ],
      [
        "or",
        -6.0231796217866815
      ],
      [
        "h",
        -6.04908918966741
      ],
      [
        "the",
        -6.658962585138784
      ],
      [
        "▁h",
        -6.900277505864142
      ],
      [
        "▁i",
        -7.040869249586603
      ],
      [
        "f",
        -7.804552053781714
      ],
      [
        "▁t",
        -8.661231292260895
      ]
    ],
    "byte_fallback": false
  }
}