{
 "transformers_version": "5.11.0",
 "architectures": null,
 "output_hidden_states": false,
 "return_dict": true,
 "dtype": null,
 "chunk_size_feed_forward": 0,
 "is_encoder_decoder": false,
 "id2label": {
  "0": "LABEL_0",
  "1": "LABEL_1"
 },
 "label2id": {
  "LABEL_0": 0,
  "LABEL_1": 1
 },
 "problem_type": null,
 "text_config": {
  "architectures": null,
  "output_hidden_states": false,
  "return_dict": true,
  "dtype": null,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "id2label": {
   "0": "LABEL_0",
   "1": "LABEL_1"
  },
  "label2id": {
   "LABEL_0": 0,
   "LABEL_1": 1
  },
  "problem_type": null,
  "vocab_size": 40,
  "hidden_size": 16,
  "num_hidden_layers": 1,
  "num_attention_heads": 2,
  "intermediate_size": 32,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "attention_probs_dropout_prob": 0.1,
  "max_position_embeddings": 24,
  "type_vocab_size": 1,
  "initializer_factor": 1.0,
  "layer_norm_eps": 1e-12,
  "projection_dim": 12,
  "pad_token_id": 1,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "projection_hidden_act": "relu",
  "_name_or_path": "",
  "model_type": "clap_text_model",
  "output_attentions": false
 },
 "audio_config": {
  "architectures": null,
  "output_hidden_states": false,
  "return_dict": true,
  "dtype": null,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "id2label": {
   "0": "LABEL_0",
   "1": "LABEL_1"
  },
  "label2id": {
   "LABEL_0": 0,
   "LABEL_1": 1
  },
  "problem_type": null,
  "window_size": 2,
  "num_mel_bins": 16,
  "spec_size": 16,
  "hidden_act": "gelu",
  "patch_size": 2,
  "patch_stride": [
   2,
   2
  ],
  "num_classes": 10,
  "hidden_size": 16,
  "projection_dim": 12,
  "depths": [
   2,
   2
  ],
  "num_attention_heads": [
   2,
   4
  ],
  "enable_fusion": false,
  "hidden_dropout_prob": 0.1,
  "fusion_type": null,
  "patch_embed_input_channels": 1,
  "flatten_patch_embeds": true,
  "patch_embeds_hidden_size": 8,
  "enable_patch_layer_norm": true,
  "drop_path_rate": 0.0,
  "attention_probs_dropout_prob": 0.0,
  "qkv_bias": true,
  "mlp_ratio": 4.0,
  "aff_block_r": 4,
  "num_hidden_layers": 4,
  "projection_hidden_act": "relu",
  "layer_norm_eps": 1e-05,
  "initializer_factor": 1.0,
  "_name_or_path": "",
  "model_type": "clap_audio_model",
  "output_attentions": false
 },
 "logit_scale_init_value": 14.285714285714285,
 "projection_dim": 12,
 "projection_hidden_act": "relu",
 "initializer_factor": 1.0,
 "hidden_size": 16,
 "num_hidden_layers": 3,
 "_name_or_path": "",
 "model_type": "clap",
 "output_attentions": false
}