{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": null,
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "!": 5,
      "'": 6,
      ",": 7,
      ".": 8,
      "0": 9,
      "1": 10,
      "2": 11,
      "3": 12,
      "4": 13,
      "5": 14,
      "6": 15,
      ";": 16,
      "?": 17,
      "a": 18,
      "b": 19,
      "c": 20,
      "d": 21,
      "e": 22,
      "f": 23,
      "g": 24,
      "h": 25,
      "i": 26,
      "j": 27,
      "k": 28,
      "l": 29,
      "m": 30,
      "n": 31,
      "o": 32,
      "p": 33,
      "q": 34,
      "r": 35,
      "s": 36,
      "t": 37,
      "u": 38,
      "v": 39,
      "w": 40,
      "x": 41,
      "y": 42,
      "z": 43,
      "##n": 44,
      "##e": 45,
      "##v": 46,
      "##r": 47,
      "##4": 48,
      "##o": 49,
      "##w": 50,
      "##a": 51,
      "##t": 52,
      "##c": 53,
      "##h": 54,
      "##y": 55,
      "##p": 56,
      "##g": 57,
      "##u": 58,
      "##m": 59,
      "##b": 60,
      "##s": 61,
      "##i": 62,
      "##k": 63,
      "##z": 64,
      "##f": 65,
      "##x": 66,
      "##l": 67,
      "##d": 68,
      "##2": 69,
      "##0": 70,
      "##6": 71,
      "##5": 72,
      "##3": 73,
      "##q": 74,
      "##he": 75,
      "the": 76,
      "##re": 77,
      "##at": 78,
      "se": 79,
      "##ls": 80,
      "##lls": 81,
      "an": 82,
      "do": 83,
      "##ve": 84,
      "##as": 85,
      "##ck": 86,
      "and": 87,
      "be": 88,
      "ju": 89,
      "qu": 90,
      "she": 91,
      "##ere": 92,
      "##on": 93,
      "##ou": 94,
      "##ick": 95,
      "seas": 96,
      "da": 97,
      "li": 98,
      "on": 99,
      "or": 100,
      "sat": 101,
      "to": 102,
      "wi": 103,
      "##en": 104,
      "##44": 105,
      "##ow": 106,
      "##ox": 107,
      "##ore": 108,
      "##th": 109,
      "##pe": 110,
      "##mp": 111,
      "##ive": 112,
      "##ly": 113,
      "##hells": 114,
      "sells": 115,
      "dog": 116,
      "##ver": 117,
      "jump": 118,
      "quick": 119,
      "seashells": 120,
      "12": 121,
      "22": 122,
      "20": 123,
      "36": 124,
      "33": 125,
      "444": 126,
      "52": 127,
      "ap": 128,
      "are": 129,
      "br": 130,
      "by": 131,
      "box": 132,
      "ca": 133,
      "ch": 134,
      "cre": 135,
      "cat": 136,
      "cou": 137,
      "fox": 138,
      "five": 139,
      "hat": 140,
      "here": 141,
      "how": 142,
      "in": 143,
      "it": 144,
      "is": 145,
      "lo": 146,
      "la": 147,
      "my": 148,
      "mat": 149,
      "mon": 150,
      "ne": 151,
      "no": 152,
      "na": 153,
      "nu": 154,
      "over": 155,
      "pa": 156,
      "pat": 157,
      "su": 158,
      "sou": 159,
      "th": 160,
      "ve": 161,
      "we": 162,
      "were": 163,
      "you": 164,
      "ze": 165,
      "##nt": 166,
      "##ng": 167,
      "##er": 168,
      "##es": 169,
      "##ek": 170,
      "##ras": 171,
      "##ron": 172,
      "##or": 173,
      "##ar": 174,
      "##ti": 175,
      "##ch": 176,
      "##hore": 177,
      "##ys": 178,
      "##gs": 179,
      "##uor": 180,
      "##mb": 181,
      "##bras": 182,
      "##se": 183,
      "##ing": 184,
      "##ke": 185,
      "##zy": 186,
      "##zen": 187,
      "##fe": 188,
      "##ft": 189,
      "##ff": 190,
      "##fore": 191,
      "##xing": 192,
      "##le": 193,
      "##dere": 194,
      "##26": 195,
      "##quor": 196,
      "they": 197,
      "there": 198,
      "##rely": 199,
      "don": 200,
      "dozen": 201,
      "before": 202,
      "jugs": 203,
      "ques": 204,
      "shells": 205,
      "##icken": 206,
      "seashore": 207,
      "days": 208,
      "daft": 209,
      "like": 210,
      "liquor": 211,
      "ordere": 212,
      "with": 213,
      "wise": 214,
      "##own": 215,
      "##ths": 216,
      "##pear": 217,
      "jumps": 218,
      "2026": 219,
      "365": 220,
      "333": 221,
      "4444": 222,
      "appear": 223,
      "brown": 224,
      "cafe": 225,
      "chicken": 226,
      "crepe": 227,
      "count": 228,
      "hatch": 229,
      "log": 230,
      "lazy": 231,
      "months": 232,
      "never": 233,
      "not": 234,
      "naive": 235,
      "numb": 236,
      "pack": 237,
      "patron": 238,
      "surely": 239,
      "souff": 240,
      "that": 241,
      "vexing": 242,
      "week": 243,
      "your": 244,
      "zebras": 245,
      "##ers": 246,
      "##tion": 247,
      "question": 248,
      "ordered": 249,
      "chickens": 250,
      "numbers": 251,
      "souffle": 252,
      "vexingly": 253,
      "weeks": 254
    }
  }
}