{
 "transformers_version": "5.11.0",
 "architectures": null,
 "output_hidden_states": false,
 "return_dict": true,
 "dtype": null,
 "chunk_size_feed_forward": 0,
 "is_encoder_decoder": false,
 "id2label": {
  "0": "LABEL_0",
  "1": "LABEL_1"
 },
 "label2id": {
  "LABEL_0": 0,
  "LABEL_1": 1
 },
 "problem_type": null,
 "patch_size": 4,
 "hidden_size": 16,
 "intermediate_size": 64,
 "num_hidden_layers": 2,
 "num_attention_heads": 4,
 "hidden_act": "gelu",
 "attention_dropout": 0.0,
 "initializer_range": 0.02,
 "layer_norm_eps": 1e-06,
 "rope_theta": 100.0,
 "image_size": 12,
 "num_channels": 3,
 "query_bias": true,
 "key_bias": false,
 "value_bias": true,
 "proj_bias": true,
 "mlp_bias": true,
 "layerscale_value": 1.0,
 "drop_path_rate": 0.0,
 "use_gated_mlp": false,
 "num_register_tokens": 2,
 "pos_embed_shift": null,
 "pos_embed_jitter": null,
 "pos_embed_rescale": 2.0,
 "apply_layernorm": true,
 "reshape_hidden_states": true,
 "stage_names": [
  "stem",
  "stage1",
  "stage2"
 ],
 "_name_or_path": "",
 "model_type": "dinov3_vit",
 "output_attentions": false,
 "out_features": [
  "stage2"
 ],
 "out_indices": [
  2
 ]
}