{
 "transformers_version": "5.11.0",
 "architectures": null,
 "output_hidden_states": false,
 "return_dict": true,
 "dtype": null,
 "chunk_size_feed_forward": 0,
 "is_encoder_decoder": false,
 "id2label": {
  "0": "LABEL_0",
  "1": "LABEL_1",
  "2": "LABEL_2",
  "3": "LABEL_3",
  "4": "LABEL_4"
 },
 "label2id": {
  "LABEL_0": 0,
  "LABEL_1": 1,
  "LABEL_2": 2,
  "LABEL_3": 3,
  "LABEL_4": 4
 },
 "problem_type": null,
 "hidden_size": 16,
 "num_hidden_layers": 2,
 "num_attention_heads": 4,
 "intermediate_size": 32,
 "hidden_act": "gelu",
 "hidden_dropout_prob": 0.0,
 "attention_probs_dropout_prob": 0.0,
 "initializer_range": 0.02,
 "layer_norm_eps": 1e-12,
 "image_size": 12,
 "patch_size": 4,
 "num_channels": 3,
 "qkv_bias": true,
 "encoder_stride": 16,
 "pooler_output_size": 16,
 "pooler_act": "tanh",
 "_name_or_path": "",
 "model_type": "vit",
 "output_attentions": false
}