{
 "architectures": [
  "Glm4ForCausalLM"
 ],
 "model_type": "glm4",
 "hidden_size": 8,
 "intermediate_size": 12,
 "num_hidden_layers": 2,
 "num_attention_heads": 2,
 "num_key_value_heads": 1,
 "head_dim": 4,
 "partial_rotary_factor": 0.5,
 "vocab_size": 13,
 "max_position_embeddings": 16,
 "rms_norm_eps": 1e-05,
 "rope_theta": 10000.0,
 "attention_bias": true,
 "tie_word_embeddings": false,
 "hidden_act": "silu",
 "pad_token_id": 0,
 "eos_token_id": 1,
 "bos_token_id": 2
}