{"version": "1.0", "truncation": null, "padding": null, "added_tokens": [{"id": 0, "content": "<unk>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true}, {"id": 1, "content": "<s>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true}, {"id": 2, "content": "</s>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true}], "normalizer": {"type": "Sequence", "normalizers": [{"type": "Prepend", "prepend": "‚ĖĀ"}, {"type": "Replace", "pattern": {"String": " "}, "content": "‚ĖĀ"}]}, "pre_tokenizer": null, "post_processor": null, "decoder": {"type": "Sequence", "decoders": [{"type": "Replace", "pattern": {"String": "‚ĖĀ"}, "content": " "}, {"type": "ByteFallback"}, {"type": "Fuse"}, {"type": "Strip", "content": " ", "start": 1, "stop": 0}]}, "model": {"type": "BPE", "dropout": null, "unk_token": "<unk>", "continuing_subword_prefix": null, "end_of_word_suffix": null, "fuse_unk": true, "byte_fallback": true, "ignore_merges": false, "vocab": {"<unk>": 0, "<s>": 1, "</s>": 2, "<0x00>": 3, "<0x01>": 4, "<0x02>": 5, "<0x03>": 6, "<0x04>": 7, "<0x05>": 8, "<0x06>": 9, "<0x07>": 10, "<0x08>": 11, "<0x09>": 12, "<0x0A>": 13, "<0x0B>": 14, "<0x0C>": 15, "<0x0D>": 16, "<0x0E>": 17, "<0x0F>": 18, "<0x10>": 19, "<0x11>": 20, "<0x12>": 21, "<0x13>": 22, "<0x14>": 23, "<0x15>": 24, "<0x16>": 25, "<0x17>": 26, "<0x18>": 27, "<0x19>": 28, "<0x1A>": 29, "<0x1B>": 30, "<0x1C>": 31, "<0x1D>": 32, "<0x1E>": 33, "<0x1F>": 34, "<0x20>": 35, "<0x21>": 36, "<0x22>": 37, "<0x23>": 38, "<0x24>": 39, "<0x25>": 40, "<0x26>": 41, "<0x27>": 42, "<0x28>": 43, "<0x29>": 44, "<0x2A>": 45, "<0x2B>": 46, "<0x2C>": 47, "<0x2D>": 48, "<0x2E>": 49, "<0x2F>": 50, "<0x30>": 51, "<0x31>": 52, "<0x32>": 53, "<0x33>": 54, "<0x34>": 55, "<0x35>": 56, "<0x36>": 57, "<0x37>": 58, "<0x38>": 59, "<0x39>": 60, "<0x3A>": 61, "<0x3B>": 62, "<0x3C>": 63, "<0x3D>": 64, "<0x3E>": 65, "<0x3F>": 66, "<0x40>": 67, "<0x41>": 68, "<0x42>": 69, "<0x43>": 70, "<0x44>": 71, "<0x45>": 72, "<0x46>": 73, "<0x47>": 74, "<0x48>": 75, "<0x49>": 76, "<0x4A>": 77, "<0x4B>": 78, "<0x4C>": 79, "<0x4D>": 80, "<0x4E>": 81, "<0x4F>": 82, "<0x50>": 83, "<0x51>": 84, "<0x52>": 85, "<0x53>": 86, "<0x54>": 87, "<0x55>": 88, "<0x56>": 89, "<0x57>": 90, "<0x58>": 91, "<0x59>": 92, "<0x5A>": 93, "<0x5B>": 94, "<0x5C>": 95, "<0x5D>": 96, "<0x5E>": 97, "<0x5F>": 98, "<0x60>": 99, "<0x61>": 100, "<0x62>": 101, "<0x63>": 102, "<0x64>": 103, "<0x65>": 104, "<0x66>": 105, "<0x67>": 106, "<0x68>": 107, "<0x69>": 108, "<0x6A>": 109, "<0x6B>": 110, "<0x6C>": 111, "<0x6D>": 112, "<0x6E>": 113, "<0x6F>": 114, "<0x70>": 115, "<0x71>": 116, "<0x72>": 117, "<0x73>": 118, "<0x74>": 119, "<0x75>": 120, "<0x76>": 121, "<0x77>": 122, "<0x78>": 123, "<0x79>": 124, "<0x7A>": 125, "<0x7B>": 126, "<0x7C>": 127, "<0x7D>": 128, "<0x7E>": 129, "<0x7F>": 130, "<0x80>": 131, "<0x81>": 132, "<0x82>": 133, "<0x83>": 134, "<0x84>": 135, "<0x85>": 136, "<0x86>": 137, "<0x87>": 138, "<0x88>": 139, "<0x89>": 140, "<0x8A>": 141, "<0x8B>": 142, "<0x8C>": 143, "<0x8D>": 144, "<0x8E>": 145, "<0x8F>": 146, "<0x90>": 147, "<0x91>": 148, "<0x92>": 149, "<0x93>": 150, "<0x94>": 151, "<0x95>": 152, "<0x96>": 153, "<0x97>": 154, "<0x98>": 155, "<0x99>": 156, "<0x9A>": 157, "<0x9B>": 158, "<0x9C>": 159, "<0x9D>": 160, "<0x9E>": 161, "<0x9F>": 162, "<0xA0>": 163, "<0xA1>": 164, "<0xA2>": 165, "<0xA3>": 166, "<0xA4>": 167, "<0xA5>": 168, "<0xA6>": 169, "<0xA7>": 170, "<0xA8>": 171, "<0xA9>": 172, "<0xAA>": 173, "<0xAB>": 174, "<0xAC>": 175, "<0xAD>": 176, "<0xAE>": 177, "<0xAF>": 178, "<0xB0>": 179, "<0xB1>": 180, "<0xB2>": 181, "<0xB3>": 182, "<0xB4>": 183, "<0xB5>": 184, "<0xB6>": 185, "<0xB7>": 186, "<0xB8>": 187, "<0xB9>": 188, "<0xBA>": 189, "<0xBB>": 190, "<0xBC>": 191, "<0xBD>": 192, "<0xBE>": 193, "<0xBF>": 194, "<0xC0>": 195, "<0xC1>": 196, "<0xC2>": 197, "<0xC3>": 198, "<0xC4>": 199, "<0xC5>": 200, "<0xC6>": 201, "<0xC7>": 202, "<0xC8>": 203, "<0xC9>": 204, "<0xCA>": 205, "<0xCB>": 206, "<0xCC>": 207, "<0xCD>": 208, "<0xCE>": 209, "<0xCF>": 210, "<0xD0>": 211, "<0xD1>": 212, "<0xD2>": 213, "<0xD3>": 214, "<0xD4>": 215, "<0xD5>": 216, "<0xD6>": 217, "<0xD7>": 218, "<0xD8>": 219, "<0xD9>": 220, "<0xDA>": 221, "<0xDB>": 222, "<0xDC>": 223, "<0xDD>": 224, "<0xDE>": 225, "<0xDF>": 226, "<0xE0>": 227, "<0xE1>": 228, "<0xE2>": 229, "<0xE3>": 230, "<0xE4>": 231, "<0xE5>": 232, "<0xE6>": 233, "<0xE7>": 234, "<0xE8>": 235, "<0xE9>": 236, "<0xEA>": 237, "<0xEB>": 238, "<0xEC>": 239, "<0xED>": 240, "<0xEE>": 241, "<0xEF>": 242, "<0xF0>": 243, "<0xF1>": 244, "<0xF2>": 245, "<0xF3>": 246, "<0xF4>": 247, "<0xF5>": 248, "<0xF6>": 249, "<0xF7>": 250, "<0xF8>": 251, "<0xF9>": 252, "<0xFA>": 253, "<0xFB>": 254, "<0xFC>": 255, "<0xFD>": 256, "<0xFE>": 257, "<0xFF>": 258, "!": 259, "'": 260, ",": 261, ".": 262, "0": 263, "1": 264, "2": 265, "3": 266, "4": 267, "5": 268, "6": 269, ";": 270, "?": 271, "A": 272, "D": 273, "H": 274, "I": 275, "P": 276, "S": 277, "T": 278, "a": 279, "b": 280, "c": 281, "d": 282, "e": 283, "f": 284, "g": 285, "h": 286, "i": 287, "j": 288, "k": 289, "l": 290, "m": 291, "n": 292, "o": 293, "p": 294, "q": 295, "r": 296, "s": 297, "t": 298, "u": 299, "v": 300, "w": 301, "x": 302, "y": 303, "z": 304, "‚ĖĀ": 305, "e‚ĖĀ": 306, "th": 307, "s‚ĖĀ": 308, "‚ĖĀth": 309, "t‚ĖĀ": 310, "er": 311, "‚ĖĀthe‚ĖĀ": 312, "el": 313, "on": 314, "or": 315, "sh": 316, "y‚ĖĀ": 317, "‚ĖĀa": 318, "ell": 319, "at‚ĖĀ": 320, "ck": 321, "ea": 322, "nd": 323, "qu": 324, "ells‚ĖĀ": 325, ",‚ĖĀ": 326, "44": 327, "at": 328, "do": 329, "e.": 330, "ick": 331, "ju": 332, "n‚ĖĀ": 333, "ou": 334, "sea": 335, "‚ĖĀb": 336, "‚ĖĀn": 337, "‚ĖĀw": 338, "e‚ĖĀs": 339, "seash": 340, "33": 341, "af": 342, "and": 343, "ch": 344, "e,": 345, "g.": 346, "iv": 347, "li": 348, "mp": 349, "ow": 350, "ox": 351, "o‚ĖĀb": 352, "r‚ĖĀ": 353, "s.": 354, "sat‚ĖĀ": 355, "to‚ĖĀb": 356, "ver": 357, "ze": 358, "‚ĖĀd": 359, "‚ĖĀm": 360, "‚ĖĀju": 361, "e‚ĖĀqu": 362, "ere‚ĖĀ": 363, "‚ĖĀthe‚ĖĀl": 364, "‚ĖĀa‚ĖĀ": 365, "‚ĖĀand": 366, "‚ĖĀwi": 367, "e‚ĖĀsells‚ĖĀ": 368, "ive‚ĖĀ": 369, "sat‚ĖĀon": 370, "'s‚ĖĀ": 371, "'t‚ĖĀ": 372, ".‚ĖĀthe‚ĖĀ": 373, "02": 374, "12": 375, "1,‚ĖĀ": 376, "22": 377, "2‚ĖĀw": 378, "202": 379, "36": 380, "3‚ĖĀand": 381, "5‚ĖĀd": 382, "52‚ĖĀw": 383, "6‚ĖĀth": 384, ";‚ĖĀ": 385, "A‚ĖĀn": 386, "Don": 387, "How": 388, "In‚ĖĀ": 389, "Pa": 390, "Sh": 391, "Th": 392, "ar": 393, "ay": 394, "az": 395, "as‚ĖĀ": 396, "aive‚ĖĀ": 397, "be": 398, "br": 399, "by": 400, "ber": 401, "box": 402, "cr": 403, "cat‚ĖĀ": 404, "cou": 405, "caf": 406, "der": 407, "d‚ĖĀa‚ĖĀ": 408, "ee": 409, "en": 410, "ep": 411, "es": 412, "ex": 413, "ey‚ĖĀ": 414, "ever": 415, "ed‚ĖĀa‚ĖĀ": 416, "ff": 417, "for": 418, "fox": 419, "five‚ĖĀ": 420, "gl": 421, "gs": 422, "g‚ĖĀ": 423, "her": 424, "hat": 425, "in": 426, "it": 427, "is‚ĖĀ": 428, "ion": 429, "ke‚ĖĀ": 430, "ks.": 431, "le‚ĖĀ": 432, "mat": 433, "mber": 434, "nt‚ĖĀ": 435, "never": 436, "ot‚ĖĀ": 437, "og.": 438, "over": 439, "pp": 440, "pat": 441, "rel": 442, "ron": 443, "row": 444, "s,‚ĖĀ": 445, "se.": 446, "sou": 447, "tion": 448, "umber": 449, "urel": 450, "vex": 451, "were‚ĖĀ": 452, "you": 453, "‚ĖĀor": 454, "‚ĖĀ44": 455, "‚ĖĀto‚ĖĀb": 456, "‚ĖĀ52‚ĖĀw": 457, "‚ĖĀA‚ĖĀn": 458, "‚ĖĀDon": 459, "‚ĖĀHow": 460, "‚ĖĀIn‚ĖĀ": 461, "‚ĖĀPa": 462, "‚ĖĀSh": 463, "‚ĖĀTh": 464, "‚ĖĀfive‚ĖĀ": 465, "‚ĖĀvex": 466, "e‚ĖĀth": 467, "e‚ĖĀor": 468, "e‚ĖĀpat": 469, "ths‚ĖĀ": 470, "the‚ĖĀqu": 471, "th‚ĖĀfive‚ĖĀ": 472, "s‚ĖĀli": 473, "s‚ĖĀbe": 474, "s‚ĖĀover": 475, "‚ĖĀthat‚ĖĀ": 476, "t‚ĖĀze": 477, "‚ĖĀthe‚ĖĀsh": 478, "‚ĖĀthe‚ĖĀseash": 479, "‚ĖĀthe‚ĖĀcat‚ĖĀ": 480, "‚ĖĀthe‚ĖĀmat": 481, "onths‚ĖĀ": 482, "ore,": 483, "or‚ĖĀju": 484, "she‚ĖĀsells‚ĖĀ": 485, "y‚ĖĀqu": 486, "y‚ĖĀdo": 487, "y‚ĖĀseash": 488, "y‚ĖĀbox": 489, "‚ĖĀapp": 490, "ells.": 491, "ck‚ĖĀm": 492, "ear‚ĖĀ": 493, "quor‚ĖĀju": 494, "ells‚ĖĀby": 495, "ells‚ĖĀshe‚ĖĀsells‚ĖĀ": 496, ",‚ĖĀ33": 497, "44‚ĖĀapp": 498, "doze": 499, "dog‚ĖĀ": 500, "ick‚ĖĀb": 501, "ick‚ĖĀd": 502, "icken": 503, "jump": 504, "n‚ĖĀli": 505, "n‚ĖĀfox": 506, "‚ĖĀnot‚ĖĀ": 507, "‚ĖĀnumber": 508, "e‚ĖĀsurel": 509, "seashells‚ĖĀby": 510, "aft‚ĖĀze": 511, "and‚ĖĀa‚ĖĀ": 512, "and‚ĖĀ52‚ĖĀw": 513, "ch;‚ĖĀ": 514, "chicken": 515, "e,‚ĖĀthat‚ĖĀ": 516, "mps‚ĖĀover": 517, "r‚ĖĀchicken": 518, "to‚ĖĀbe,‚ĖĀthat‚ĖĀ": 519, "‚ĖĀmonths‚ĖĀ": 520, "‚ĖĀjumps‚ĖĀover": 521, "e‚ĖĀquick‚ĖĀb": 522, "ere‚ĖĀwere‚ĖĀ": 523, "‚ĖĀthe‚ĖĀlaz": 524, "‚ĖĀthe‚ĖĀlog.": 525, "‚ĖĀand‚ĖĀthe‚ĖĀsh": 526, "‚ĖĀwise.": 527, "‚ĖĀwith‚ĖĀfive‚ĖĀ": 528, "e‚ĖĀsells‚ĖĀseashells‚ĖĀby": 529, "sat‚ĖĀon‚ĖĀthe‚ĖĀmat": 530, "sat‚ĖĀon‚ĖĀthe‚ĖĀlog.": 531, "'s‚ĖĀnever": 532, "'t‚ĖĀcou": 533, ".‚ĖĀthe‚ĖĀdog‚ĖĀ": 534, "12‚ĖĀmonths‚ĖĀ": 535, "1,‚ĖĀ22": 536, "2026‚ĖĀth": 537, "365‚ĖĀd": 538, "3‚ĖĀand‚ĖĀ44": 539, "are‚ĖĀsurel": 540, "ays,‚ĖĀ": 541, "as‚ĖĀjump": 542, "aive‚ĖĀcaf": 543, "bras‚ĖĀjump": 544, "crep": 545, "dered‚ĖĀa‚ĖĀ": 546, "eeks.": 547, "estion": 548, "ey‚ĖĀhat": 549, "ffle‚ĖĀ": 550, "fore‚ĖĀth": 551, "gly‚ĖĀqu": 552, "gs!": 553, "here.": 554, "ingly‚ĖĀqu": 555, "it's‚ĖĀnever": 556, "is‚ĖĀthe‚ĖĀqu": 557, "ke‚ĖĀ1,‚ĖĀ22": 558, "nt‚ĖĀyou": 559}, "merges": [["e", "‚ĖĀ"], ["t", "h"], ["s", "‚ĖĀ"], ["‚ĖĀ", "th"], ["t", "‚ĖĀ"], ["e", "r"], ["‚ĖĀth", "e‚ĖĀ"], ["e", "l"], ["o", "n"], ["o", "r"], ["s", "h"], ["y", "‚ĖĀ"], ["‚ĖĀ", "a"], ["el", "l"], ["a", "t‚ĖĀ"], ["c", "k"], ["e", "a"], ["n", "d"], ["q", "u"], ["ell", "s‚ĖĀ"], [",", "‚ĖĀ"], ["4", "4"], ["a", "t"], ["d", "o"], ["e", "."], ["i", "ck"], ["j", "u"], ["n", "‚ĖĀ"], ["o", "u"], ["s", "ea"], ["‚ĖĀ", "b"], ["‚ĖĀ", "n"], ["‚ĖĀ", "w"], ["e‚ĖĀ", "s"], ["sea", "sh"], ["3", "3"], ["a", "f"], ["a", "nd"], ["c", "h"], ["e", ","], ["g", "."], ["i", "v"], ["l", "i"], ["m", "p"], ["o", "w"], ["o", "x"], ["o", "‚ĖĀb"], ["r", "‚ĖĀ"], ["s", "."], ["s", "at‚ĖĀ"], ["t", "o‚ĖĀb"], ["v", "er"], ["z", "e"], ["‚ĖĀ", "d"], ["‚ĖĀ", "m"], ["‚ĖĀ", "ju"], ["e‚ĖĀ", "qu"], ["er", "e‚ĖĀ"], ["‚ĖĀthe‚ĖĀ", "l"], ["‚ĖĀa", "‚ĖĀ"], ["‚ĖĀa", "nd"], ["‚ĖĀw", "i"], ["e‚ĖĀs", "ells‚ĖĀ"], ["iv", "e‚ĖĀ"], ["sat‚ĖĀ", "on"], ["'", "s‚ĖĀ"], ["'", "t‚ĖĀ"], [".", "‚ĖĀthe‚ĖĀ"], ["0", "2"], ["1", "2"], ["1", ",‚ĖĀ"], ["2", "2"], ["2", "‚ĖĀw"], ["2", "02"], ["3", "6"], ["3", "‚ĖĀand"], ["5", "‚ĖĀd"], ["5", "2‚ĖĀw"], ["6", "‚ĖĀth"], [";", "‚ĖĀ"], ["A", "‚ĖĀn"], ["D", "on"], ["H", "ow"], ["I", "n‚ĖĀ"], ["P", "a"], ["S", "h"], ["T", "h"], ["a", "r"], ["a", "y"], ["a", "z"], ["a", "s‚ĖĀ"], ["a", "ive‚ĖĀ"], ["b", "e"], ["b", "r"], ["b", "y"], ["b", "er"], ["b", "ox"], ["c", "r"], ["c", "at‚ĖĀ"], ["c", "ou"], ["c", "af"], ["d", "er"], ["d", "‚ĖĀa‚ĖĀ"], ["e", "e"], ["e", "n"], ["e", "p"], ["e", "s"], ["e", "x"], ["e", "y‚ĖĀ"], ["e", "ver"], ["e", "d‚ĖĀa‚ĖĀ"], ["f", "f"], ["f", "or"], ["f", "ox"], ["f", "ive‚ĖĀ"], ["g", "l"], ["g", "s"], ["g", "‚ĖĀ"], ["h", "er"], ["h", "at"], ["i", "n"], ["i", "t"], ["i", "s‚ĖĀ"], ["i", "on"], ["k", "e‚ĖĀ"], ["k", "s."], ["l", "e‚ĖĀ"], ["m", "at"], ["m", "ber"], ["n", "t‚ĖĀ"], ["n", "ever"], ["o", "t‚ĖĀ"], ["o", "g."], ["o", "ver"], ["p", "p"], ["p", "at"], ["r", "el"], ["r", "on"], ["r", "ow"], ["s", ",‚ĖĀ"], ["s", "e."], ["s", "ou"], ["t", "ion"], ["u", "mber"], ["u", "rel"], ["v", "ex"], ["w", "ere‚ĖĀ"], ["y", "ou"], ["‚ĖĀ", "or"], ["‚ĖĀ", "44"], ["‚ĖĀ", "to‚ĖĀb"], ["‚ĖĀ", "52‚ĖĀw"], ["‚ĖĀ", "A‚ĖĀn"], ["‚ĖĀ", "Don"], ["‚ĖĀ", "How"], ["‚ĖĀ", "In‚ĖĀ"], ["‚ĖĀ", "Pa"], ["‚ĖĀ", "Sh"], ["‚ĖĀ", "Th"], ["‚ĖĀ", "five‚ĖĀ"], ["‚ĖĀ", "vex"], ["e‚ĖĀ", "th"], ["e‚ĖĀ", "or"], ["e‚ĖĀ", "pat"], ["th", "s‚ĖĀ"], ["th", "e‚ĖĀqu"], ["th", "‚ĖĀfive‚ĖĀ"], ["s‚ĖĀ", "li"], ["s‚ĖĀ", "be"], ["s‚ĖĀ", "over"], ["‚ĖĀth", "at‚ĖĀ"], ["t‚ĖĀ", "ze"], ["‚ĖĀthe‚ĖĀ", "sh"], ["‚ĖĀthe‚ĖĀ", "seash"], ["‚ĖĀthe‚ĖĀ", "cat‚ĖĀ"], ["‚ĖĀthe‚ĖĀ", "mat"], ["on", "ths‚ĖĀ"], ["or", "e,"], ["or", "‚ĖĀju"], ["sh", "e‚ĖĀsells‚ĖĀ"], ["y‚ĖĀ", "qu"], ["y‚ĖĀ", "do"], ["y‚ĖĀ", "seash"], ["y‚ĖĀ", "box"], ["‚ĖĀa", "pp"], ["ell", "s."], ["ck", "‚ĖĀm"], ["ea", "r‚ĖĀ"], ["qu", "or‚ĖĀju"], ["ells‚ĖĀ", "by"], ["ells‚ĖĀ", "she‚ĖĀsells‚ĖĀ"], [",‚ĖĀ", "33"], ["44", "‚ĖĀapp"], ["do", "ze"], ["do", "g‚ĖĀ"], ["ick", "‚ĖĀb"], ["ick", "‚ĖĀd"], ["ick", "en"], ["ju", "mp"], ["n‚ĖĀ", "li"], ["n‚ĖĀ", "fox"], ["‚ĖĀn", "ot‚ĖĀ"], ["‚ĖĀn", "umber"], ["e‚ĖĀs", "urel"], ["seash", "ells‚ĖĀby"], ["af", "t‚ĖĀze"], ["and", "‚ĖĀa‚ĖĀ"], ["and", "‚ĖĀ52‚ĖĀw"], ["ch", ";‚ĖĀ"], ["ch", "icken"], ["e,", "‚ĖĀthat‚ĖĀ"], ["mp", "s‚ĖĀover"], ["r‚ĖĀ", "chicken"], ["to‚ĖĀb", "e,‚ĖĀthat‚ĖĀ"], ["‚ĖĀm", "onths‚ĖĀ"], ["‚ĖĀju", "mps‚ĖĀover"], ["e‚ĖĀqu", "ick‚ĖĀb"], ["ere‚ĖĀ", "were‚ĖĀ"], ["‚ĖĀthe‚ĖĀl", "az"], ["‚ĖĀthe‚ĖĀl", "og."], ["‚ĖĀand", "‚ĖĀthe‚ĖĀsh"], ["‚ĖĀwi", "se."], ["‚ĖĀwi", "th‚ĖĀfive‚ĖĀ"], ["e‚ĖĀsells‚ĖĀ", "seashells‚ĖĀby"], ["sat‚ĖĀon", "‚ĖĀthe‚ĖĀmat"], ["sat‚ĖĀon", "‚ĖĀthe‚ĖĀlog."], ["'s‚ĖĀ", "never"], ["'t‚ĖĀ", "cou"], [".‚ĖĀthe‚ĖĀ", "dog‚ĖĀ"], ["12", "‚ĖĀmonths‚ĖĀ"], ["1,‚ĖĀ", "22"], ["202", "6‚ĖĀth"], ["36", "5‚ĖĀd"], ["3‚ĖĀand", "‚ĖĀ44"], ["ar", "e‚ĖĀsurel"], ["ay", "s,‚ĖĀ"], ["as‚ĖĀ", "jump"], ["aive‚ĖĀ", "caf"], ["br", "as‚ĖĀjump"], ["cr", "ep"], ["der", "ed‚ĖĀa‚ĖĀ"], ["ee", "ks."], ["es", "tion"], ["ey‚ĖĀ", "hat"], ["ff", "le‚ĖĀ"], ["for", "e‚ĖĀth"], ["gl", "y‚ĖĀqu"], ["gs", "!"], ["her", "e."], ["in", "gly‚ĖĀqu"], ["it", "'s‚ĖĀnever"], ["is‚ĖĀ", "the‚ĖĀqu"], ["ke‚ĖĀ", "1,‚ĖĀ22"], ["nt‚ĖĀ", "you"]]}}