{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": false
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "¬°": 95,
      "¬Ґ": 96,
      "¬£": 97,
      "¬§": 98,
      "¬•": 99,
      "¬¶": 100,
      "¬І": 101,
      "¬®": 102,
      "¬©": 103,
      "¬™": 104,
      "¬Ђ": 105,
      "¬ђ": 106,
      "¬Ѓ": 107,
      "¬ѓ": 108,
      "¬∞": 109,
      "¬±": 110,
      "¬≤": 111,
      "¬≥": 112,
      "¬і": 113,
      "¬µ": 114,
      "¬ґ": 115,
      "¬Ј": 116,
      "¬Є": 117,
      "¬є": 118,
      "¬Ї": 119,
      "¬ї": 120,
      "¬Љ": 121,
      "¬љ": 122,
      "¬Њ": 123,
      "¬њ": 124,
      "√А": 125,
      "√Б": 126,
      "√В": 127,
      "√Г": 128,
      "√Д": 129,
      "√Е": 130,
      "√Ж": 131,
      "√З": 132,
      "√И": 133,
      "√Й": 134,
      "√К": 135,
      "√Л": 136,
      "√М": 137,
      "√Н": 138,
      "√О": 139,
      "√П": 140,
      "√Р": 141,
      "√С": 142,
      "√Т": 143,
      "√У": 144,
      "√Ф": 145,
      "√Х": 146,
      "√Ц": 147,
      "√Ч": 148,
      "√Ш": 149,
      "√Щ": 150,
      "√Ъ": 151,
      "√Ы": 152,
      "√Ь": 153,
      "√Э": 154,
      "√Ю": 155,
      "√Я": 156,
      "√†": 157,
      "√°": 158,
      "√Ґ": 159,
      "√£": 160,
      "√§": 161,
      "√•": 162,
      "√¶": 163,
      "√І": 164,
      "√®": 165,
      "√©": 166,
      "√™": 167,
      "√Ђ": 168,
      "√ђ": 169,
      "√≠": 170,
      "√Ѓ": 171,
      "√ѓ": 172,
      "√∞": 173,
      "√±": 174,
      "√≤": 175,
      "√≥": 176,
      "√і": 177,
      "√µ": 178,
      "√ґ": 179,
      "√Ј": 180,
      "√Є": 181,
      "√є": 182,
      "√Ї": 183,
      "√ї": 184,
      "√Љ": 185,
      "√љ": 186,
      "√Њ": 187,
      "√њ": 188,
      "ƒА": 189,
      "ƒБ": 190,
      "ƒВ": 191,
      "ƒГ": 192,
      "ƒД": 193,
      "ƒЕ": 194,
      "ƒЖ": 195,
      "ƒЗ": 196,
      "ƒИ": 197,
      "ƒЙ": 198,
      "ƒК": 199,
      "ƒЛ": 200,
      "ƒМ": 201,
      "ƒН": 202,
      "ƒО": 203,
      "ƒП": 204,
      "ƒР": 205,
      "ƒС": 206,
      "ƒТ": 207,
      "ƒУ": 208,
      "ƒФ": 209,
      "ƒХ": 210,
      "ƒЦ": 211,
      "ƒЧ": 212,
      "ƒШ": 213,
      "ƒЩ": 214,
      "ƒЪ": 215,
      "ƒЫ": 216,
      "ƒЬ": 217,
      "ƒЭ": 218,
      "ƒЮ": 219,
      "ƒЯ": 220,
      "ƒ†": 221,
      "ƒ°": 222,
      "ƒҐ": 223,
      "ƒ£": 224,
      "ƒ§": 225,
      "ƒ•": 226,
      "ƒ¶": 227,
      "ƒІ": 228,
      "ƒ®": 229,
      "ƒ©": 230,
      "ƒ™": 231,
      "ƒЂ": 232,
      "ƒђ": 233,
      "ƒ≠": 234,
      "ƒЃ": 235,
      "ƒѓ": 236,
      "ƒ∞": 237,
      "ƒ±": 238,
      "ƒ≤": 239,
      "ƒ≥": 240,
      "ƒі": 241,
      "ƒµ": 242,
      "ƒґ": 243,
      "ƒЈ": 244,
      "ƒЄ": 245,
      "ƒє": 246,
      "ƒЇ": 247,
      "ƒї": 248,
      "ƒЉ": 249,
      "ƒљ": 250,
      "ƒЊ": 251,
      "ƒњ": 252,
      "≈А": 253,
      "≈Б": 254,
      "≈В": 255,
      "≈Г": 256,
      "eƒ†": 257,
      "th": 258,
      "sƒ†": 259,
      "ƒ†th": 260,
      "tƒ†": 261,
      "er": 262,
      "ƒ†theƒ†": 263,
      "el": 264,
      "on": 265,
      "or": 266,
      "sh": 267,
      "yƒ†": 268,
      "ƒ†a": 269,
      "ell": 270,
      "atƒ†": 271,
      "ck": 272,
      "ea": 273,
      "nd": 274,
      "qu": 275,
      "ellsƒ†": 276,
      ",ƒ†": 277,
      "44": 278,
      "at": 279,
      "do": 280,
      "e.": 281,
      "ick": 282,
      "ju": 283,
      "nƒ†": 284,
      "ou": 285,
      "sea": 286,
      "ƒ†b": 287,
      "ƒ†n": 288,
      "ƒ†w": 289,
      "eƒ†s": 290,
      "seash": 291,
      "33": 292,
      "af": 293,
      "and": 294,
      "ch": 295,
      "e,": 296,
      "g.": 297,
      "iv": 298,
      "li": 299,
      "mp": 300,
      "ow": 301,
      "ox": 302,
      "oƒ†b": 303,
      "rƒ†": 304,
      "s.": 305,
      "satƒ†": 306,
      "toƒ†b": 307,
      "ver": 308,
      "ze": 309,
      "ƒ†d": 310,
      "ƒ†m": 311,
      "ƒ†ju": 312,
      "eƒ†qu": 313,
      "ereƒ†": 314,
      "ƒ†theƒ†l": 315,
      "ƒ†aƒ†": 316,
      "ƒ†and": 317,
      "ƒ†wi": 318,
      "eƒ†sellsƒ†": 319,
      "iveƒ†": 320,
      "satƒ†on": 321,
      "'sƒ†": 322,
      "'tƒ†": 323,
      ".ƒ†theƒ†": 324,
      "02": 325,
      "12": 326,
      "1,ƒ†": 327,
      "22": 328,
      "2ƒ†w": 329,
      "202": 330,
      "36": 331,
      "3ƒ†and": 332,
      "5ƒ†d": 333,
      "52ƒ†w": 334,
      "6ƒ†th": 335,
      ";ƒ†": 336,
      "Aƒ†n": 337,
      "Don": 338,
      "How": 339,
      "Inƒ†": 340,
      "Pa": 341,
      "Sh": 342,
      "Th": 343,
      "ar": 344,
      "ay": 345,
      "az": 346,
      "asƒ†": 347,
      "aiveƒ†": 348,
      "be": 349,
      "br": 350,
      "by": 351,
      "ber": 352,
      "box": 353,
      "cr": 354,
      "catƒ†": 355,
      "cou": 356,
      "caf": 357,
      "der": 358,
      "dƒ†aƒ†": 359,
      "ee": 360,
      "en": 361,
      "ep": 362,
      "es": 363,
      "ex": 364,
      "eyƒ†": 365,
      "ever": 366,
      "edƒ†aƒ†": 367,
      "ff": 368,
      "for": 369,
      "fox": 370,
      "fiveƒ†": 371,
      "gl": 372,
      "gs": 373,
      "gƒ†": 374,
      "her": 375,
      "hat": 376,
      "in": 377,
      "it": 378,
      "isƒ†": 379,
      "ion": 380,
      "keƒ†": 381,
      "ks.": 382,
      "leƒ†": 383,
      "mat": 384,
      "mber": 385,
      "ntƒ†": 386,
      "never": 387,
      "otƒ†": 388,
      "og.": 389,
      "over": 390,
      "pp": 391,
      "pat": 392,
      "rel": 393,
      "ron": 394,
      "row": 395,
      "s,ƒ†": 396,
      "se.": 397,
      "sou": 398,
      "tion": 399
    },
    "merges": [
      [
        "e",
        "ƒ†"
      ],
      [
        "t",
        "h"
      ],
      [
        "s",
        "ƒ†"
      ],
      [
        "ƒ†",
        "th"
      ],
      [
        "t",
        "ƒ†"
      ],
      [
        "e",
        "r"
      ],
      [
        "ƒ†th",
        "eƒ†"
      ],
      [
        "e",
        "l"
      ],
      [
        "o",
        "n"
      ],
      [
        "o",
        "r"
      ],
      [
        "s",
        "h"
      ],
      [
        "y",
        "ƒ†"
      ],
      [
        "ƒ†",
        "a"
      ],
      [
        "el",
        "l"
      ],
      [
        "a",
        "tƒ†"
      ],
      [
        "c",
        "k"
      ],
      [
        "e",
        "a"
      ],
      [
        "n",
        "d"
      ],
      [
        "q",
        "u"
      ],
      [
        "ell",
        "sƒ†"
      ],
      [
        ",",
        "ƒ†"
      ],
      [
        "4",
        "4"
      ],
      [
        "a",
        "t"
      ],
      [
        "d",
        "o"
      ],
      [
        "e",
        "."
      ],
      [
        "i",
        "ck"
      ],
      [
        "j",
        "u"
      ],
      [
        "n",
        "ƒ†"
      ],
      [
        "o",
        "u"
      ],
      [
        "s",
        "ea"
      ],
      [
        "ƒ†",
        "b"
      ],
      [
        "ƒ†",
        "n"
      ],
      [
        "ƒ†",
        "w"
      ],
      [
        "eƒ†",
        "s"
      ],
      [
        "sea",
        "sh"
      ],
      [
        "3",
        "3"
      ],
      [
        "a",
        "f"
      ],
      [
        "a",
        "nd"
      ],
      [
        "c",
        "h"
      ],
      [
        "e",
        ","
      ],
      [
        "g",
        "."
      ],
      [
        "i",
        "v"
      ],
      [
        "l",
        "i"
      ],
      [
        "m",
        "p"
      ],
      [
        "o",
        "w"
      ],
      [
        "o",
        "x"
      ],
      [
        "o",
        "ƒ†b"
      ],
      [
        "r",
        "ƒ†"
      ],
      [
        "s",
        "."
      ],
      [
        "s",
        "atƒ†"
      ],
      [
        "t",
        "oƒ†b"
      ],
      [
        "v",
        "er"
      ],
      [
        "z",
        "e"
      ],
      [
        "ƒ†",
        "d"
      ],
      [
        "ƒ†",
        "m"
      ],
      [
        "ƒ†",
        "ju"
      ],
      [
        "eƒ†",
        "qu"
      ],
      [
        "er",
        "eƒ†"
      ],
      [
        "ƒ†theƒ†",
        "l"
      ],
      [
        "ƒ†a",
        "ƒ†"
      ],
      [
        "ƒ†a",
        "nd"
      ],
      [
        "ƒ†w",
        "i"
      ],
      [
        "eƒ†s",
        "ellsƒ†"
      ],
      [
        "iv",
        "eƒ†"
      ],
      [
        "satƒ†",
        "on"
      ],
      [
        "'",
        "sƒ†"
      ],
      [
        "'",
        "tƒ†"
      ],
      [
        ".",
        "ƒ†theƒ†"
      ],
      [
        "0",
        "2"
      ],
      [
        "1",
        "2"
      ],
      [
        "1",
        ",ƒ†"
      ],
      [
        "2",
        "2"
      ],
      [
        "2",
        "ƒ†w"
      ],
      [
        "2",
        "02"
      ],
      [
        "3",
        "6"
      ],
      [
        "3",
        "ƒ†and"
      ],
      [
        "5",
        "ƒ†d"
      ],
      [
        "5",
        "2ƒ†w"
      ],
      [
        "6",
        "ƒ†th"
      ],
      [
        ";",
        "ƒ†"
      ],
      [
        "A",
        "ƒ†n"
      ],
      [
        "D",
        "on"
      ],
      [
        "H",
        "ow"
      ],
      [
        "I",
        "nƒ†"
      ],
      [
        "P",
        "a"
      ],
      [
        "S",
        "h"
      ],
      [
        "T",
        "h"
      ],
      [
        "a",
        "r"
      ],
      [
        "a",
        "y"
      ],
      [
        "a",
        "z"
      ],
      [
        "a",
        "sƒ†"
      ],
      [
        "a",
        "iveƒ†"
      ],
      [
        "b",
        "e"
      ],
      [
        "b",
        "r"
      ],
      [
        "b",
        "y"
      ],
      [
        "b",
        "er"
      ],
      [
        "b",
        "ox"
      ],
      [
        "c",
        "r"
      ],
      [
        "c",
        "atƒ†"
      ],
      [
        "c",
        "ou"
      ],
      [
        "c",
        "af"
      ],
      [
        "d",
        "er"
      ],
      [
        "d",
        "ƒ†aƒ†"
      ],
      [
        "e",
        "e"
      ],
      [
        "e",
        "n"
      ],
      [
        "e",
        "p"
      ],
      [
        "e",
        "s"
      ],
      [
        "e",
        "x"
      ],
      [
        "e",
        "yƒ†"
      ],
      [
        "e",
        "ver"
      ],
      [
        "e",
        "dƒ†aƒ†"
      ],
      [
        "f",
        "f"
      ],
      [
        "f",
        "or"
      ],
      [
        "f",
        "ox"
      ],
      [
        "f",
        "iveƒ†"
      ],
      [
        "g",
        "l"
      ],
      [
        "g",
        "s"
      ],
      [
        "g",
        "ƒ†"
      ],
      [
        "h",
        "er"
      ],
      [
        "h",
        "at"
      ],
      [
        "i",
        "n"
      ],
      [
        "i",
        "t"
      ],
      [
        "i",
        "sƒ†"
      ],
      [
        "i",
        "on"
      ],
      [
        "k",
        "eƒ†"
      ],
      [
        "k",
        "s."
      ],
      [
        "l",
        "eƒ†"
      ],
      [
        "m",
        "at"
      ],
      [
        "m",
        "ber"
      ],
      [
        "n",
        "tƒ†"
      ],
      [
        "n",
        "ever"
      ],
      [
        "o",
        "tƒ†"
      ],
      [
        "o",
        "g."
      ],
      [
        "o",
        "ver"
      ],
      [
        "p",
        "p"
      ],
      [
        "p",
        "at"
      ],
      [
        "r",
        "el"
      ],
      [
        "r",
        "on"
      ],
      [
        "r",
        "ow"
      ],
      [
        "s",
        ",ƒ†"
      ],
      [
        "s",
        "e."
      ],
      [
        "s",
        "ou"
      ],
      [
        "t",
        "ion"
      ]
    ]
  }
}