{
 "architectures": [
  "DebertaV2Model"
 ],
 "model_type": "deberta-v2",
 "hidden_size": 8,
 "intermediate_size": 10,
 "num_hidden_layers": 3,
 "num_attention_heads": 2,
 "vocab_size": 17,
 "max_position_embeddings": 16,
 "layer_norm_eps": 1e-07,
 "relative_attention": true,
 "position_buckets": 4,
 "max_relative_positions": 6,
 "pos_att_type": [
  "p2c",
  "c2p"
 ],
 "share_att_key": true,
 "norm_rel_ebd": "layer_norm",
 "position_biased_input": false,
 "type_vocab_size": 0,
 "hidden_act": "gelu",
 "pad_token_id": 0
}