{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "┬б": 95,
      "┬в": 96,
      "┬г": 97,
      "┬д": 98,
      "┬е": 99,
      "┬ж": 100,
      "┬з": 101,
      "┬и": 102,
      "┬й": 103,
      "┬к": 104,
      "┬л": 105,
      "┬м": 106,
      "┬о": 107,
      "┬п": 108,
      "┬░": 109,
      "┬▒": 110,
      "┬▓": 111,
      "┬│": 112,
      "┬┤": 113,
      "┬╡": 114,
      "┬╢": 115,
      "┬╖": 116,
      "┬╕": 117,
      "┬╣": 118,
      "┬║": 119,
      "┬╗": 120,
      "┬╝": 121,
      "┬╜": 122,
      "┬╛": 123,
      "┬┐": 124,
      "├А": 125,
      "├Б": 126,
      "├В": 127,
      "├Г": 128,
      "├Д": 129,
      "├Е": 130,
      "├Ж": 131,
      "├З": 132,
      "├И": 133,
      "├Й": 134,
      "├К": 135,
      "├Л": 136,
      "├М": 137,
      "├Н": 138,
      "├О": 139,
      "├П": 140,
      "├Р": 141,
      "├С": 142,
      "├Т": 143,
      "├У": 144,
      "├Ф": 145,
      "├Х": 146,
      "├Ц": 147,
      "├Ч": 148,
      "├Ш": 149,
      "├Щ": 150,
      "├Ъ": 151,
      "├Ы": 152,
      "├Ь": 153,
      "├Э": 154,
      "├Ю": 155,
      "├Я": 156,
      "├а": 157,
      "├б": 158,
      "├в": 159,
      "├г": 160,
      "├д": 161,
      "├е": 162,
      "├ж": 163,
      "├з": 164,
      "├и": 165,
      "├й": 166,
      "├к": 167,
      "├л": 168,
      "├м": 169,
      "├н": 170,
      "├о": 171,
      "├п": 172,
      "├░": 173,
      "├▒": 174,
      "├▓": 175,
      "├│": 176,
      "├┤": 177,
      "├╡": 178,
      "├╢": 179,
      "├╖": 180,
      "├╕": 181,
      "├╣": 182,
      "├║": 183,
      "├╗": 184,
      "├╝": 185,
      "├╜": 186,
      "├╛": 187,
      "├┐": 188,
      "─А": 189,
      "─Б": 190,
      "─В": 191,
      "─Г": 192,
      "─Д": 193,
      "─Е": 194,
      "─Ж": 195,
      "─З": 196,
      "─И": 197,
      "─Й": 198,
      "─К": 199,
      "─Л": 200,
      "─М": 201,
      "─Н": 202,
      "─О": 203,
      "─П": 204,
      "─Р": 205,
      "─С": 206,
      "─Т": 207,
      "─У": 208,
      "─Ф": 209,
      "─Х": 210,
      "─Ц": 211,
      "─Ч": 212,
      "─Ш": 213,
      "─Щ": 214,
      "─Ъ": 215,
      "─Ы": 216,
      "─Ь": 217,
      "─Э": 218,
      "─Ю": 219,
      "─Я": 220,
      "─а": 221,
      "─б": 222,
      "─в": 223,
      "─г": 224,
      "─д": 225,
      "─е": 226,
      "─ж": 227,
      "─з": 228,
      "─и": 229,
      "─й": 230,
      "─к": 231,
      "─л": 232,
      "─м": 233,
      "─н": 234,
      "─о": 235,
      "─п": 236,
      "─░": 237,
      "─▒": 238,
      "─▓": 239,
      "─│": 240,
      "─┤": 241,
      "─╡": 242,
      "─╢": 243,
      "─╖": 244,
      "─╕": 245,
      "─╣": 246,
      "─║": 247,
      "─╗": 248,
      "─╝": 249,
      "─╜": 250,
      "─╛": 251,
      "─┐": 252,
      "┼А": 253,
      "┼Б": 254,
      "┼В": 255,
      "┼Г": 256,
      "he": 257,
      "─аs": 258,
      "─аt": 259,
      "re": 260,
      "─аthe": 261,
      "─аa": 262,
      "at": 263,
      "on": 264,
      "─аb": 265,
      "ll": 266,
      "ve": 267,
      "─аc": 268,
      "─аd": 269,
      "─аse": 270,
      "lls": 271,
      "as": 272,
      "ck": 273,
      "nd": 274,
      "qu": 275,
      "─аl": 276,
      "─аw": 277,
      "─аand": 278,
      "44": 279,
      "ick": 280,
      "ju": 281,
      "og": 282,
      "or": 283,
      "ou": 284,
      "─аm": 285,
      "─аn": 286,
      "─аqu": 287,
      "─аju": 288,
      "hells": 289,
      "─аbe": 290,
      "─аseas": 291,
      "33": 292,
      "af": 293,
      "en": 294,
      "ere": 295,
      "fo": 296,
      "hat": 297,
      "is": 298,
      "it": 299,
      "ive": 300,
      "ly": 301,
      "mp": 302,
      "ow": 303,
      "pe": 304,
      "─а1": 305,
      "─а2": 306,
      "─аon": 307,
      "─аor": 308,
      "─аsat": 309,
      "ver": 310,
      "─аdog": 311,
      "─аsells": 312,
      "─аli": 313,
      "─аquick": 314,
      "─аjump": 315,
      "─аseashells": 316,
      "'s": 317,
      "'t": 318,
      "02": 319,
      "36": 320,
      "52": 321,
      "Don": 322,
      "How": 323,
      "In": 324,
      "Pa": 325,
      "She": 326,
      "The": 327,
      "ar": 328,
      "ay": 329,
      "az": 330,
      "aive": 331,
      "be": 332,
      "br": 333,
      "ch": 334,
      "dere": 335,
      "ee": 336,
      "es": 337,
      "ever": 338,
      "ebr": 339,
      "ff": 340,
      "five": 341,
      "gs": 342,
      "gly": 343,
      "ho": 344,
      "hs": 345,
      "hick": 346,
      "in": 347,
      "ion": 348,
      "ke": 349,
      "ks": 350,
      "le": 351,
      "mbe": 352,
      "nt": 353,
      "nu": 354,
      "ot": 355,
      "ox": 356,
      "oz": 357,
      "over": 358,
      "pat": 359,
      "ppe": 360,
      "rs": 361,
      "ron": 362,
      "row": 363,
      "to": 364,
      "the": 365,
      "ths": 366,
      "tion": 367,
      "ure": 368,
      "xin": 369,
      "you": 370,
      "zebr": 371,
      "─аhe": 372,
      "─аve": 373,
      "─а44": 374,
      "─а33": 375,
      "─аfo": 376,
      "─аhat": 377,
      "─аis": 378,
      "─аit": 379
    },
    "merges": [
      [
        "h",
        "e"
      ],
      [
        "─а",
        "s"
      ],
      [
        "─а",
        "t"
      ],
      [
        "r",
        "e"
      ],
      [
        "─аt",
        "he"
      ],
      [
        "─а",
        "a"
      ],
      [
        "a",
        "t"
      ],
      [
        "o",
        "n"
      ],
      [
        "─а",
        "b"
      ],
      [
        "l",
        "l"
      ],
      [
        "v",
        "e"
      ],
      [
        "─а",
        "c"
      ],
      [
        "─а",
        "d"
      ],
      [
        "─аs",
        "e"
      ],
      [
        "ll",
        "s"
      ],
      [
        "a",
        "s"
      ],
      [
        "c",
        "k"
      ],
      [
        "n",
        "d"
      ],
      [
        "q",
        "u"
      ],
      [
        "─а",
        "l"
      ],
      [
        "─а",
        "w"
      ],
      [
        "─аa",
        "nd"
      ],
      [
        "4",
        "4"
      ],
      [
        "i",
        "ck"
      ],
      [
        "j",
        "u"
      ],
      [
        "o",
        "g"
      ],
      [
        "o",
        "r"
      ],
      [
        "o",
        "u"
      ],
      [
        "─а",
        "m"
      ],
      [
        "─а",
        "n"
      ],
      [
        "─а",
        "qu"
      ],
      [
        "─а",
        "ju"
      ],
      [
        "he",
        "lls"
      ],
      [
        "─аb",
        "e"
      ],
      [
        "─аse",
        "as"
      ],
      [
        "3",
        "3"
      ],
      [
        "a",
        "f"
      ],
      [
        "e",
        "n"
      ],
      [
        "e",
        "re"
      ],
      [
        "f",
        "o"
      ],
      [
        "h",
        "at"
      ],
      [
        "i",
        "s"
      ],
      [
        "i",
        "t"
      ],
      [
        "i",
        "ve"
      ],
      [
        "l",
        "y"
      ],
      [
        "m",
        "p"
      ],
      [
        "o",
        "w"
      ],
      [
        "p",
        "e"
      ],
      [
        "─а",
        "1"
      ],
      [
        "─а",
        "2"
      ],
      [
        "─а",
        "on"
      ],
      [
        "─а",
        "or"
      ],
      [
        "─аs",
        "at"
      ],
      [
        "ve",
        "r"
      ],
      [
        "─аd",
        "og"
      ],
      [
        "─аse",
        "lls"
      ],
      [
        "─аl",
        "i"
      ],
      [
        "─аqu",
        "ick"
      ],
      [
        "─аju",
        "mp"
      ],
      [
        "─аseas",
        "hells"
      ],
      [
        "'",
        "s"
      ],
      [
        "'",
        "t"
      ],
      [
        "0",
        "2"
      ],
      [
        "3",
        "6"
      ],
      [
        "5",
        "2"
      ],
      [
        "D",
        "on"
      ],
      [
        "H",
        "ow"
      ],
      [
        "I",
        "n"
      ],
      [
        "P",
        "a"
      ],
      [
        "S",
        "he"
      ],
      [
        "T",
        "he"
      ],
      [
        "a",
        "r"
      ],
      [
        "a",
        "y"
      ],
      [
        "a",
        "z"
      ],
      [
        "a",
        "ive"
      ],
      [
        "b",
        "e"
      ],
      [
        "b",
        "r"
      ],
      [
        "c",
        "h"
      ],
      [
        "d",
        "ere"
      ],
      [
        "e",
        "e"
      ],
      [
        "e",
        "s"
      ],
      [
        "e",
        "ver"
      ],
      [
        "e",
        "br"
      ],
      [
        "f",
        "f"
      ],
      [
        "f",
        "ive"
      ],
      [
        "g",
        "s"
      ],
      [
        "g",
        "ly"
      ],
      [
        "h",
        "o"
      ],
      [
        "h",
        "s"
      ],
      [
        "h",
        "ick"
      ],
      [
        "i",
        "n"
      ],
      [
        "i",
        "on"
      ],
      [
        "k",
        "e"
      ],
      [
        "k",
        "s"
      ],
      [
        "l",
        "e"
      ],
      [
        "m",
        "be"
      ],
      [
        "n",
        "t"
      ],
      [
        "n",
        "u"
      ],
      [
        "o",
        "t"
      ],
      [
        "o",
        "x"
      ],
      [
        "o",
        "z"
      ],
      [
        "o",
        "ver"
      ],
      [
        "p",
        "at"
      ],
      [
        "p",
        "pe"
      ],
      [
        "r",
        "s"
      ],
      [
        "r",
        "on"
      ],
      [
        "r",
        "ow"
      ],
      [
        "t",
        "o"
      ],
      [
        "t",
        "he"
      ],
      [
        "t",
        "hs"
      ],
      [
        "t",
        "ion"
      ],
      [
        "u",
        "re"
      ],
      [
        "x",
        "in"
      ],
      [
        "y",
        "ou"
      ],
      [
        "z",
        "ebr"
      ],
      [
        "─а",
        "he"
      ],
      [
        "─а",
        "ve"
      ],
      [
        "─а",
        "44"
      ],
      [
        "─а",
        "33"
      ],
      [
        "─а",
        "fo"
      ],
      [
        "─а",
        "hat"
      ],
      [
        "─а",
        "is"
      ],
      [
        "─а",
        "it"
      ]
    ]
  }
}