{
 "architectures": [
  "LlamaForCausalLM"
 ],
 "model_type": "llama",
 "hidden_size": 32,
 "intermediate_size": 32,
 "num_hidden_layers": 2,
 "num_attention_heads": 2,
 "num_key_value_heads": 1,
 "vocab_size": 8,
 "max_position_embeddings": 12,
 "rms_norm_eps": 1e-05,
 "rope_theta": 10000.0,
 "tie_word_embeddings": true,
 "rope_scaling": null
}