{"version": "1.0", "truncation": null, "padding": null, "added_tokens": [{"id": 0, "content": "<|endoftext|>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true}, {"id": 1, "content": "<|im_end|>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true}], "normalizer": null, "pre_tokenizer": {"type": "Sequence", "pretokenizers": [{"type": "Split", "pattern": {"Regex": "(?i:'s|'t|'re|'ve|'m|'ll|'d)|[^\\r\\n\\p{L}\\p{N}]?[\\p{L}\\p{M}]+|\\p{N}| ?[^\\s\\p{L}\\p{M}\\p{N}]+[\\r\\n]*|\\s*[\\r\\n]+|\\s+(?!\\S)|\\s+"}, "behavior": "Isolated", "invert": false}, {"type": "ByteLevel", "add_prefix_space": false, "trim_offsets": true, "use_regex": false}]}, "post_processor": null, "decoder": {"type": "ByteLevel", "add_prefix_space": true, "trim_offsets": true, "use_regex": true}, "model": {"type": "BPE", "dropout": null, "unk_token": null, "continuing_subword_prefix": null, "end_of_word_suffix": null, "fuse_unk": false, "byte_fallback": false, "ignore_merges": false, "vocab": {"<|endoftext|>": 0, "<|im_end|>": 1, "!": 2, "\"": 3, "#": 4, "$": 5, "%": 6, "&": 7, "'": 8, "(": 9, ")": 10, "*": 11, "+": 12, ",": 13, "-": 14, ".": 15, "/": 16, "0": 17, "1": 18, "2": 19, "3": 20, "4": 21, "5": 22, "6": 23, "7": 24, "8": 25, "9": 26, ":": 27, ";": 28, "<": 29, "=": 30, ">": 31, "?": 32, "@": 33, "A": 34, "B": 35, "C": 36, "D": 37, "E": 38, "F": 39, "G": 40, "H": 41, "I": 42, "J": 43, "K": 44, "L": 45, "M": 46, "N": 47, "O": 48, "P": 49, "Q": 50, "R": 51, "S": 52, "T": 53, "U": 54, "V": 55, "W": 56, "X": 57, "Y": 58, "Z": 59, "[": 60, "\\": 61, "]": 62, "^": 63, "_": 64, "`": 65, "a": 66, "b": 67, "c": 68, "d": 69, "e": 70, "f": 71, "g": 72, "h": 73, "i": 74, "j": 75, "k": 76, "l": 77, "m": 78, "n": 79, "o": 80, "p": 81, "q": 82, "r": 83, "s": 84, "t": 85, "u": 86, "v": 87, "w": 88, "x": 89, "y": 90, "z": 91, "{": 92, "|": 93, "}": 94, "~": 95, "ВЎ": 96, "Вў": 97, "ВЈ": 98, "ВӨ": 99, "ВҘ": 100, "ВҰ": 101, "В§": 102, "ВЁ": 103, "В©": 104, "ВӘ": 105, "В«": 106, "В¬": 107, "В®": 108, "ВҜ": 109, "В°": 110, "Вұ": 111, "ВІ": 112, "Ві": 113, "Вҙ": 114, "Вө": 115, "В¶": 116, "В·": 117, "Вё": 118, "В№": 119, "Вә": 120, "В»": 121, "Вј": 122, "ВҪ": 123, "Вҫ": 124, "Вҝ": 125, "ГҖ": 126, "ГҒ": 127, "ГӮ": 128, "Гғ": 129, "Г„": 130, "Г…": 131, "ГҶ": 132, "ГҮ": 133, "ГҲ": 134, "Гү": 135, "ГҠ": 136, "ГӢ": 137, "ГҢ": 138, "ГҚ": 139, "ГҺ": 140, "ГҸ": 141, "Гҗ": 142, "Г‘": 143, "Г’": 144, "Г“": 145, "Г”": 146, "Г•": 147, "Г–": 148, "Г—": 149, "Гҳ": 150, "Гҷ": 151, "Гҡ": 152, "Гӣ": 153, "Гң": 154, "Гқ": 155, "Гһ": 156, "Гҹ": 157, "Г ": 158, "ГЎ": 159, "Гў": 160, "ГЈ": 161, "ГӨ": 162, "ГҘ": 163, "ГҰ": 164, "Г§": 165, "ГЁ": 166, "Г©": 167, "ГӘ": 168, "Г«": 169, "Г¬": 170, "Гӯ": 171, "Г®": 172, "ГҜ": 173, "Г°": 174, "Гұ": 175, "ГІ": 176, "Гі": 177, "Гҙ": 178, "Гө": 179, "Г¶": 180, "Г·": 181, "Гё": 182, "Г№": 183, "Гә": 184, "Г»": 185, "Гј": 186, "ГҪ": 187, "Гҫ": 188, "Гҝ": 189, "ДҖ": 190, "ДҒ": 191, "ДӮ": 192, "Дғ": 193, "Д„": 194, "Д…": 195, "ДҶ": 196, "ДҮ": 197, "ДҲ": 198, "Дү": 199, "ДҠ": 200, "ДӢ": 201, "ДҢ": 202, "ДҚ": 203, "ДҺ": 204, "ДҸ": 205, "Дҗ": 206, "Д‘": 207, "Д’": 208, "Д“": 209, "Д”": 210, "Д•": 211, "Д–": 212, "Д—": 213, "Дҳ": 214, "Дҷ": 215, "Дҡ": 216, "Дӣ": 217, "Дң": 218, "Дқ": 219, "Дһ": 220, "Дҹ": 221, "Д ": 222, "ДЎ": 223, "Дў": 224, "ДЈ": 225, "ДӨ": 226, "ДҘ": 227, "ДҰ": 228, "Д§": 229, "ДЁ": 230, "Д©": 231, "ДӘ": 232, "Д«": 233, "Д¬": 234, "Дӯ": 235, "Д®": 236, "ДҜ": 237, "Д°": 238, "Дұ": 239, "ДІ": 240, "Ді": 241, "Дҙ": 242, "Дө": 243, "Д¶": 244, "Д·": 245, "Дё": 246, "Д№": 247, "Дә": 248, "Д»": 249, "Дј": 250, "ДҪ": 251, "Дҫ": 252, "Дҝ": 253, "ЕҖ": 254, "ЕҒ": 255, "ЕӮ": 256, "Еғ": 257, "he": 258, "Д s": 259, "Д t": 260, "re": 261, "Д the": 262, "Д a": 263, "at": 264, "on": 265, "Д b": 266, "ll": 267, "ve": 268, "Д c": 269, "Д d": 270, "Д se": 271, "lls": 272, "as": 273, "ck": 274, "nd": 275, "qu": 276, "Д l": 277, "Д w": 278, "Д and": 279, "ick": 280, "ju": 281, "og": 282, "or": 283, "ou": 284, "Д m": 285, "Д n": 286, "Д qu": 287, "Д ju": 288, "hells": 289, "Д be": 290, "Д seas": 291, "af": 292, "en": 293, "ere": 294, "fo": 295, "hat": 296, "is": 297, "it": 298, "ive": 299, "ly": 300, "mp": 301, "ow": 302, "pe": 303, "Д on": 304, "Д or": 305, "Д sat": 306, "ver": 307, "Д dog": 308, "Д sells": 309, "Д li": 310, "Д quick": 311, "Д jump": 312, "Д seashells": 313, "'s": 314, "'t": 315, "Don": 316, "How": 317, "In": 318, "Pa": 319, "She": 320, "The": 321, "ar": 322, "ay": 323, "az": 324, "aive": 325, "be": 326, "br": 327, "ch": 328, "dere": 329, "ee": 330, "es": 331, "ever": 332, "ebr": 333, "ff": 334, "five": 335, "gs": 336, "gly": 337, "ho": 338, "hs": 339, "hick": 340, "in": 341, "ion": 342, "ke": 343, "ks": 344, "le": 345, "mbe": 346, "nt": 347, "nu": 348, "ot": 349, "ox": 350, "oz": 351, "over": 352, "pat": 353, "ppe": 354, "rs": 355, "ron": 356, "row": 357, "to": 358, "the": 359, "ths": 360, "tion": 361, "ure": 362, "xin": 363, "you": 364, "zebr": 365, "Д he": 366, "Д ve": 367, "Д fo": 368, "Д hat": 369, "Д is": 370, "Д it": 371, "Д five": 372, "Д over": 373, "Д pat": 374, "Д you": 375, "Д zebr": 376, "Д she": 377, "Д sou": 378, "Д shells": 379, "Д sure": 380, "Д to": 381, "Д that": 382, "repe": 383, "Д they": 384, "Д there": 385, "Д are": 386, "Д appe": 387, "onths": 388, "Д by": 389, "Д box": 390, "Д brow": 391, "Д cat": 392, "Д cou": 393, "Д caf": 394, "Д chick": 395, "Д crepe": 396, "Д daf": 397, "Д day": 398, "Д doz": 399}, "merges": [["h", "e"], ["Д ", "s"], ["Д ", "t"], ["r", "e"], ["Д t", "he"], ["Д ", "a"], ["a", "t"], ["o", "n"], ["Д ", "b"], ["l", "l"], ["v", "e"], ["Д ", "c"], ["Д ", "d"], ["Д s", "e"], ["ll", "s"], ["a", "s"], ["c", "k"], ["n", "d"], ["q", "u"], ["Д ", "l"], ["Д ", "w"], ["Д a", "nd"], ["i", "ck"], ["j", "u"], ["o", "g"], ["o", "r"], ["o", "u"], ["Д ", "m"], ["Д ", "n"], ["Д ", "qu"], ["Д ", "ju"], ["he", "lls"], ["Д b", "e"], ["Д se", "as"], ["a", "f"], ["e", "n"], ["e", "re"], ["f", "o"], ["h", "at"], ["i", "s"], ["i", "t"], ["i", "ve"], ["l", "y"], ["m", "p"], ["o", "w"], ["p", "e"], ["Д ", "on"], ["Д ", "or"], ["Д s", "at"], ["ve", "r"], ["Д d", "og"], ["Д se", "lls"], ["Д l", "i"], ["Д qu", "ick"], ["Д ju", "mp"], ["Д seas", "hells"], ["'", "s"], ["'", "t"], ["D", "on"], ["H", "ow"], ["I", "n"], ["P", "a"], ["S", "he"], ["T", "he"], ["a", "r"], ["a", "y"], ["a", "z"], ["a", "ive"], ["b", "e"], ["b", "r"], ["c", "h"], ["d", "ere"], ["e", "e"], ["e", "s"], ["e", "ver"], ["e", "br"], ["f", "f"], ["f", "ive"], ["g", "s"], ["g", "ly"], ["h", "o"], ["h", "s"], ["h", "ick"], ["i", "n"], ["i", "on"], ["k", "e"], ["k", "s"], ["l", "e"], ["m", "be"], ["n", "t"], ["n", "u"], ["o", "t"], ["o", "x"], ["o", "z"], ["o", "ver"], ["p", "at"], ["p", "pe"], ["r", "s"], ["r", "on"], ["r", "ow"], ["t", "o"], ["t", "he"], ["t", "hs"], ["t", "ion"], ["u", "re"], ["x", "in"], ["y", "ou"], ["z", "ebr"], ["Д ", "he"], ["Д ", "ve"], ["Д ", "fo"], ["Д ", "hat"], ["Д ", "is"], ["Д ", "it"], ["Д ", "five"], ["Д ", "over"], ["Д ", "pat"], ["Д ", "you"], ["Д ", "zebr"], ["Д s", "he"], ["Д s", "ou"], ["Д s", "hells"], ["Д s", "ure"], ["Д t", "o"], ["Д t", "hat"], ["re", "pe"], ["Д the", "y"], ["Д the", "re"], ["Д a", "re"], ["Д a", "ppe"], ["on", "ths"], ["Д b", "y"], ["Д b", "ox"], ["Д b", "row"], ["Д c", "at"], ["Д c", "ou"], ["Д c", "af"], ["Д c", "hick"], ["Д c", "repe"], ["Д d", "af"], ["Д d", "ay"], ["Д d", "oz"]]}}