{
 "transformers_version": "5.11.0",
 "architectures": null,
 "output_hidden_states": false,
 "return_dict": true,
 "dtype": null,
 "chunk_size_feed_forward": 0,
 "is_encoder_decoder": false,
 "id2label": {
  "0": "LABEL_0",
  "1": "LABEL_1"
 },
 "label2id": {
  "LABEL_0": 0,
  "LABEL_1": 1
 },
 "problem_type": null,
 "sampling_rate": 800,
 "audio_channels": 1,
 "hidden_size": 16,
 "num_filters": 4,
 "num_residual_layers": 1,
 "upsampling_ratios": [
  2,
  2
 ],
 "kernel_size": 7,
 "last_kernel_size": 3,
 "residual_kernel_size": 3,
 "dilation_growth_rate": 2,
 "use_causal_conv": true,
 "pad_mode": "constant",
 "compress": 2,
 "trim_right_ratio": 1.0,
 "codebook_size": 8,
 "codebook_dim": 8,
 "num_quantizers": 4,
 "use_conv_shortcut": false,
 "vector_quantization_hidden_dimension": 8,
 "num_semantic_quantizers": 1,
 "upsample_groups": 16,
 "num_hidden_layers": 2,
 "intermediate_size": 32,
 "num_attention_heads": 2,
 "num_key_value_heads": 2,
 "head_dim": 8,
 "hidden_act": "gelu",
 "max_position_embeddings": 8000,
 "initializer_range": 0.02,
 "norm_eps": 1e-05,
 "use_cache": false,
 "use_streaming": false,
 "rope_parameters": {
  "rope_theta": 10000.0,
  "rope_type": "default"
 },
 "sliding_window": 250,
 "attention_dropout": 0.0,
 "layer_scale_initial_scale": 0.01,
 "attention_bias": false,
 "tie_word_embeddings": true,
 "_frame_rate": 100,
 "_name_or_path": "",
 "model_type": "mimi",
 "output_attentions": false
}